/* Copyright 2004-2009 Myriad Group AG. All Rights Reserved. */
/* THIS FILE IS AUTOMATICALLY GENERATED */

#ifndef _JBED_JAVAINSTANCE_H_
#define _JBED_JAVAINSTANCE_H_

#if defined(__cplusplus)
extern "C" {
#endif
#pragma pack (push, 1)

#include <jbedcoreinstance.h>

struct INSTANCE_JBedFastCoder_OptList_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	INTARRAY                                                     data; /* 12 */
	INTARRAY                                                     regs; /* 16 */
	jint                                                         size; /* 20 */
	jint                                                         elementSize; /* 24 */
	jint                                                         currentValueReg; /* 28 */
	jint                                                         currentAddressLoc; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_ams_AMSSecurity_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_AmsCallHandler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_AmsMIDletSuiteInfo_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              id; /* 12 */
	struct INSTANCE_com_jbed_util_Properties_s *                 properties; /* 16 */
	STRING_INSTANCE                                              jadUrl; /* 20 */
	jint                                                         numMidlets; /* 24 */
	char pad28[4]; /* pad to offset 32 */
	jlong                                                        sizeUsed; /* 32 */
	STRINGARRAY                                                  midletNames; /* 40 */
	jboolean                                                     trusted; /* 44 */
	char pad45[3]; /* pad to offset 48 */
	STRING_INSTANCE                                              domain; /* 48 */
	STRINGARRAY                                                  pushList; /* 52 */
	STRING_INSTANCE                                              fileRoot; /* 56 */
}; /* 60 bytes */

struct INSTANCE_com_jbed_ams_AmsToolkitBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     notifyUncaughtExceptions; /* 12 */
	char pad13[3]; /* pad to offset 16 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_ams_AmsUtils_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_BrowseFiles_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_ams_Manager_s *                     manager; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         display; /* 16 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     oldDisplay; /* 20 */
	struct INSTANCE_javax_microedition_lcdui_List_s *            list; /* 24 */
	STRING_INSTANCE                                              removeDir; /* 28 */
	STRING_INSTANCE                                              removeLeaf; /* 32 */
	jboolean                                                     isSearchDone; /* 36 */
	char pad37[3]; /* pad to offset 40 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_ams_BrowseFiles_000243_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_CommandProcessor_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_CommandState_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         status; /* 12 */
	jint                                                         currentCommand; /* 16 */
	jint                                                         nextCommand; /* 20 */
	jboolean                                                     forceOverwrite; /* 24 */
	char pad25[3]; /* pad to offset 28 */
	STRING_INSTANCE                                              suiteURL; /* 28 */
	STRING_INSTANCE                                              username; /* 32 */
	STRING_INSTANCE                                              password; /* 36 */
	STRING_INSTANCE                                              originalSuiteURL; /* 40 */
	jboolean                                                     hidden; /* 44 */
	char pad45[3]; /* pad to offset 48 */
	STRING_INSTANCE                                              suiteStorageName; /* 48 */
	jboolean                                                     runOnce; /* 52 */
	jboolean                                                     autotest; /* 53 */
	char pad54[2]; /* pad to offset 56 */
	STRING_INSTANCE                                              descriptorName; /* 56 */
	STRING_INSTANCE                                              midletName; /* 60 */
	jint                                                         midletNum; /* 64 */
	STRING_INSTANCE                                              midletClassName; /* 68 */
	jboolean                                                     logoDisplayed; /* 72 */
	jboolean                                                     showPreinstalled; /* 73 */
	jboolean                                                     midletStartScreenDisplayed; /* 74 */
	jboolean                                                     manage; /* 75 */
	STRING_INSTANCE                                              jarName; /* 76 */
	STRING_INSTANCE                                              preinstallFolder; /* 80 */
	struct INSTANCE_com_jbed_ams_Folder_s *                      currentFolder; /* 84 */
	STRING_INSTANCE                                              installDir; /* 88 */
	jint                                                         currentMIDlet; /* 92 */
	jboolean                                                     nativeAms; /* 96 */
	char pad97[3]; /* pad to offset 100 */
	STRING_INSTANCE                                              domainOverride; /* 100 */
	STRING_INSTANCE                                              tckUrl; /* 104 */
	jboolean                                                     pushThisSession; /* 108 */
	jboolean                                                     pushNextSession; /* 109 */
	char pad110[2]; /* pad to offset 112 */
	STRING_INSTANCE                                              pendingPlatformRequestUrl; /* 112 */
	jboolean                                                     multiMIDlets; /* 116 */
	char pad117[3]; /* pad to offset 120 */
	jint                                                         launchedPushId; /* 120 */
	STRING_INSTANCE                                              nameToChange; /* 124 */
	jboolean                                                     noSprintTCK; /* 128 */
	jboolean                                                     runMemoryMeasurementsInstall; /* 129 */
	char pad130[2]; /* pad to offset 132 */
	STRING_INSTANCE                                              notifyErrorString; /* 132 */
	jint                                                         taskManagerState; /* 136 */
	STRINGARRAY                                                  taskManagerInfo; /* 140 */
	jboolean                                                     clearMIDlets; /* 144 */
	jboolean                                                     clearPreinstalledMIDlets; /* 145 */
	jboolean                                                     clearProtectedMIDlets; /* 146 */
	jboolean                                                     runMemoryMeasurementsExec; /* 147 */
	struct INSTANCE_com_jbed_ams_PreinstallConfigurationParser_s *  preinstallParser; /* 148 */
}; /* 152 bytes */

struct INSTANCE_com_jbed_ams_DisplaySizeInfo_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         width; /* 12 */
	jint                                                         height; /* 16 */
	jfloat                                                       portraitScale; /* 20 */
	jfloat                                                       landscapeScale; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_ams_File_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_Folder_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                folderData; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_ams_ImageStorage_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_InstallListener_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_InstallState_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         source; /* 12 */
	STRING_INSTANCE                                              updateJadUrl; /* 16 */
	jint                                                         nextStep; /* 20 */
	jboolean                                                     stopInstallation; /* 24 */
	jboolean                                                     writingSuite; /* 25 */
	char pad26[2]; /* pad to offset 28 */
	struct INSTANCE_com_jbed_ams_InvalidJadException_s *         exception; /* 28 */
	STRING_INSTANCE                                              jadUrl; /* 32 */
	STRING_INSTANCE                                              previousJadUrl; /* 36 */
	STRING_INSTANCE                                              jarUrl; /* 40 */
	STRINGARRAY                                                  httpHeaders; /* 44 */
	jboolean                                                     force; /* 48 */
	char pad49[3]; /* pad to offset 52 */
	BYTEARRAY                                                    jad; /* 52 */
	STRING_INSTANCE                                              jadEncoding; /* 56 */
	struct INSTANCE_com_jbed_ams_SuiteProperties_s *             suiteProps; /* 60 */
	STRING_INSTANCE                                              username; /* 64 */
	STRING_INSTANCE                                              password; /* 68 */
	jboolean                                                     deleteLock; /* 72 */
	jboolean                                                     isDrmInstall; /* 73 */
	char pad74[2]; /* pad to offset 76 */
	jint                                                         expectedDrmSize; /* 76 */
	STRING_INSTANCE                                              contentName; /* 80 */
	STRING_INSTANCE                                              storageName; /* 84 */
	jboolean                                                     hasContentHandler; /* 88 */
	char pad89[3]; /* pad to offset 92 */
	STRING_INSTANCE                                              ca; /* 92 */
	struct INSTANCE_java_lang_StringBuffer_s *                   lastCa; /* 96 */
	struct INSTANCE_javax_microedition_pki_Certificate_s *       cpCert; /* 100 */
	STRING_INSTANCE                                              signCertSubject; /* 104 */
	STRING_INSTANCE                                              signCertIssuer; /* 108 */
	STRING_INSTANCE                                              signCertSerialNumber; /* 112 */
	STRING_INSTANCE                                              rootCertSubject; /* 116 */
	STRING_INSTANCE                                              rootKeyHash; /* 120 */
	STRING_INSTANCE                                              rootCertHash; /* 124 */
	STRING_INSTANCE                                              signingInfo; /* 128 */
	jboolean                                                     signedsuite; /* 132 */
	char pad133[3]; /* pad to offset 136 */
	STRING_INSTANCE                                              domain; /* 136 */
	struct INSTANCE_com_jbed_ams_SecurityPermissions_s *         permissions; /* 140 */
	STRING_INSTANCE                                              permissionAnswers; /* 144 */
	STRING_INSTANCE                                              fg_permissionAnswers; /* 148 */
	STRING_INSTANCE                                              jarFilename; /* 152 */
	jboolean                                                     jarOnly; /* 156 */
	char pad157[3]; /* pad to offset 160 */
	jint                                                         expectedJarSize; /* 160 */
	struct INSTANCE_com_jbed_ams_InstallListener_s *             listener; /* 164 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                update; /* 168 */
	jboolean                                                     hidden; /* 172 */
	jboolean                                                     localInstall; /* 173 */
	char pad174[2]; /* pad to offset 176 */
	struct INSTANCE_com_jbed_ams_NotificationItem_s *            powerLossNotification; /* 176 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                targetFolder; /* 180 */
	STRING_INSTANCE                                              targetStorage; /* 184 */
	jboolean                                                     retainRms; /* 188 */
	char pad189[3]; /* pad to offset 192 */
	struct INSTANCE_java_util_Vector_s *                         rmsToOverwrite; /* 192 */
	jboolean                                                     runMemoryMeasurementsInstall; /* 196 */
	jboolean                                                     compileToRam; /* 197 */
	char pad198[2]; /* pad to offset 200 */
	jint                                                         totalClassSize; /* 200 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                installed; /* 204 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         disp; /* 208 */
	jint                                                         dataSize; /* 212 */
}; /* 216 bytes */

struct INSTANCE_com_jbed_ams_InstalledMIDlet_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                midletData; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_ams_Installer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_io_HttpConnection_s *     httpConnection; /* 12 */
	struct INSTANCE_java_io_InputStream_s *                      httpInputStream; /* 16 */
	struct INSTANCE_com_jbed_ams_InstallListener_s *             listener; /* 20 */
	struct INSTANCE_com_jbed_ams_InstallState_s *                state; /* 24 */
	jboolean                                                     waiting; /* 28 */
	char pad29[3]; /* pad to offset 32 */
	jint                                                         jarDownloadResult; /* 32 */
	jint                                                         neededSpace; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_ams_MIDletManager_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_MIDletState_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         state; /* 12 */
	jint                                                         previousState; /* 16 */
	char pad20[4]; /* pad to offset 24 */
	jlong                                                        timeout; /* 24 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                midletData; /* 32 */
	struct INSTANCE_com_jbed_ams_TaskManagerState_s *            taskManagerState; /* 36 */
	struct INSTANCE_javax_microedition_midlet_MIDlet_s *         midlet; /* 40 */
	struct INSTANCE_com_jbed_midp_midlet_MIDletMap_s *           map; /* 44 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         display; /* 48 */
	jboolean                                                     wantsRunningWhenBackground; /* 52 */
	jboolean                                                     wantsForeground; /* 53 */
	char pad54[2]; /* pad to offset 56 */
	struct INSTANCE_com_jbed_ams_AmsThread_s *                   lifeCycleThread; /* 56 */
	STRING_INSTANCE                                              storageName; /* 60 */
}; /* 64 bytes */

struct INSTANCE_com_jbed_ams_MIDletSuite_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_ams_SuiteProperties_s *             bufferedProps; /* 12 */
	STRING_INSTANCE                                              initialMIDletClassName; /* 16 */
	STRING_INSTANCE                                              storageName; /* 20 */
	struct INSTANCE_com_jbed_ams_SecurityPermissions_s *         securityPermissions; /* 24 */
	jboolean                                                     isTrusted; /* 28 */
	char pad29[3]; /* pad to offset 32 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_ams_Main_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_NativeAppController_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_NotificationItem_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         retries; /* 12 */
	STRING_INSTANCE                                              msg; /* 16 */
	STRING_INSTANCE                                              suiteIdentifier; /* 20 */
	STRING_INSTANCE                                              URL; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_ams_Option_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         saveSettingsCmd; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_ams_PermissionGUI_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	BYTEARRAY                                                    permLookup; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_ChoiceGroup_s *     group; /* 16 */
	jbyte                                                        answer; /* 20 */
	char pad21[3]; /* pad to offset 24 */
	struct INSTANCE_javax_microedition_lcdui_StringItem_s *      stringitem; /* 24 */
	jint                                                         handle; /* 28 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                sd; /* 32 */
	STRING_INSTANCE                                              label; /* 36 */
	struct INSTANCE_com_jbed_ams_SecurityPermissions_s *         sp; /* 40 */
	jint                                                         iFG; /* 44 */
	jint                                                         lastValidSel; /* 48 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         display; /* 52 */
	struct INSTANCE_com_jbed_ams_PermissionGUI_s *               parent; /* 56 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     currDisplayable; /* 60 */
	struct INSTANCE_javax_microedition_lcdui_Form_s *            form; /* 64 */
	struct INSTANCE_javax_microedition_lcdui_Alert_s *           alert; /* 68 */
	jboolean                                                     completed; /* 72 */
	char pad73[3]; /* pad to offset 76 */
	jint                                                         contendingIfg; /* 76 */
	jlong                                                        permIgnoreMask; /* 80 */
	jshort                                                       perm; /* 88 */
	char pad90[2]; /* pad to offset 92 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cmdOkay; /* 92 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cmdChangeYes; /* 96 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cmdBack; /* 100 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cmdIgnore; /* 104 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cmdYes; /* 108 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cmdNo; /* 112 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cmdBackmain; /* 116 */
	struct INSTANCE_java_lang_StringBuffer_s *                   amsg; /* 120 */
	jint                                                         id; /* 124 */
	STRING_INSTANCE                                              midlet; /* 128 */
	jboolean                                                     multipleConn; /* 132 */
	char pad133[3]; /* pad to offset 136 */
}; /* 136 bytes */

struct INSTANCE_com_jbed_ams_PlatformRequestGUI_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cmdOk; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cmdCancel; /* 16 */
	jboolean                                                     answer; /* 20 */
	jboolean                                                     done; /* 21 */
	char pad22[2]; /* pad to offset 24 */
	struct INSTANCE_com_jbed_util_CallContext_s *                context; /* 24 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     current; /* 28 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_ams_PreinstallConfigurationParser_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              preloadPath; /* 12 */
	struct INSTANCE_java_util_Hashtable_s *                      midletCategory; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_ams_PushRegistryCallHandler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_PushRegistryImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_RecordStoreFile_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              recordStoreName; /* 12 */
	STRING_INSTANCE                                              fileSystemName; /* 16 */
	struct INSTANCE_com_jbed_io_JbedFileConnection_s *           fileConnection; /* 20 */
	struct INSTANCE_com_jbed_ams_ReservationFile_s *             resf; /* 24 */
	jboolean                                                     existedAlready; /* 28 */
	char pad29[3]; /* pad to offset 32 */
	STRING_INSTANCE                                              myStoragePath; /* 32 */
	jint                                                         minimumSize; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_ams_ReservationFile_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              root; /* 12 */
	struct INSTANCE_com_jbed_io_JbedFileConnection_s *           file; /* 16 */
	jint                                                         openCount; /* 20 */
	jint                                                         reserved; /* 24 */
	jint                                                         bytesLeft; /* 28 */
	jboolean                                                     needFlush; /* 32 */
	char pad33[3]; /* pad to offset 36 */
	BYTEARRAY                                                    header; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_ams_Resource_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_SatsaRequest_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_Scheduler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_Scheduler_00024DisplaySwitchHandler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_util_Vector_s *                         requestQueue; /* 12 */
	jboolean                                                     isRunning; /* 16 */
	char pad17[3]; /* pad to offset 20 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_ams_Scheduler_00024DisplaySwitchHandler_00024SwitchRequest_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         action; /* 12 */
	struct INSTANCE_com_jbed_ams_MIDletState_s *                 from; /* 16 */
	struct INSTANCE_com_jbed_ams_MIDletState_s *                 to; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_ams_Scheduler_00024ThreadToCheckIsolateState_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_ams_MIDletStateProxy_s *            proxy; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_ams_SelectorData_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                parent; /* 12 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                child; /* 16 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                peer; /* 20 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                prev; /* 24 */
	jint                                                         type; /* 28 */
	jlong                                                        lastAvailableFS; /* 32 */
	jint                                                         i18nName; /* 40 */
	STRING_INSTANCE                                              name; /* 44 */
	STRING_INSTANCE                                              realName; /* 48 */
	STRING_INSTANCE                                              vendor; /* 52 */
	STRING_INSTANCE                                              buildID; /* 56 */
	STRING_INSTANCE                                              root; /* 60 */
	STRING_INSTANCE                                              fileRoot; /* 64 */
	STRING_INSTANCE                                              filePath; /* 68 */
	jint                                                         numChildren; /* 72 */
	jint                                                         num; /* 76 */
	STRING_INSTANCE                                              iconName; /* 80 */
	struct INSTANCE_javax_microedition_lcdui_Image_s *           icon; /* 84 */
	jint                                                         iconState; /* 88 */
	char pad92[4]; /* pad to offset 96 */
	jlong                                                        installTime; /* 96 */
	jboolean                                                     expired; /* 104 */
	char pad105[3]; /* pad to offset 108 */
	STRING_INSTANCE                                              className; /* 108 */
	jlong                                                        expiryTime; /* 112 */
	jint                                                         expiryCount; /* 120 */
	jint                                                         runCount; /* 124 */
	jboolean                                                     preinstalled; /* 128 */
	jboolean                                                     linkedIn; /* 129 */
	jboolean                                                     backgroundRunning; /* 130 */
	char pad131[1]; /* pad to offset 132 */
	STRING_INSTANCE                                              permissionAnswers; /* 132 */
	STRING_INSTANCE                                              fg_permissionAnswers; /* 136 */
	STRING_INSTANCE                                              domain; /* 140 */
	jboolean                                                     removable; /* 144 */
	jboolean                                                     modifiable; /* 145 */
	jboolean                                                     movable; /* 146 */
	jboolean                                                     updatable; /* 147 */
	jboolean                                                     modifiableContent; /* 148 */
	char pad149[3]; /* pad to offset 152 */
	struct INSTANCE_com_jbed_ams_DisplaySizeInfo_s *             displaySizeInfo; /* 152 */
	jboolean                                                     hidden; /* 156 */
	char pad157[3]; /* pad to offset 160 */
	STRING_INSTANCE                                              rootKeyHash; /* 160 */
	STRING_INSTANCE                                              rootCertHash; /* 164 */
	STRING_INSTANCE                                              signingInfo; /* 168 */
	STRING_INSTANCE                                              suiteId; /* 172 */
	STRING_INSTANCE                                              version; /* 176 */
	STRINGARRAY                                                  pushConnections; /* 180 */
	jboolean                                                     launchPowerOn; /* 184 */
	jboolean                                                     isRemovableMedia; /* 185 */
	jboolean                                                     newlyAdded; /* 186 */
	jboolean                                                     justRemoved; /* 187 */
	STRING_INSTANCE                                              wnsIdentifier; /* 188 */
}; /* 192 bytes */

struct INSTANCE_com_jbed_ams_SelectorStream_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                currData; /* 12 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                container; /* 16 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                last; /* 20 */
	jint                                                         nMidlets; /* 24 */
	jint                                                         pushIndex; /* 28 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_ams_TaskManager_000241_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_TaskManagerState_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_ams_PermissionGUI_s *               permissionGUI; /* 12 */
	jint                                                         endPressedCount; /* 16 */
	jboolean                                                     pausedForEndKey; /* 20 */
	char pad21[3]; /* pad to offset 24 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_build_Config_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_cldc_CldcConfigBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_concurrent_NamedMutex_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_install_JarInstaller_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_io_CharConverter_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_io_FileSystemCallHandler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 listeners; /* 12 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 listenerMaps; /* 16 */
	struct INSTANCE_java_util_Vector_s *                         roots; /* 20 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 rootPaths; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_io_HttpAuthentication_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_io_IoToolkitBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_io_JarReader_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_io_JbedFileConnection_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         inCount; /* 12 */
	struct INSTANCE_com_jbed_io_RawInputStream_s *               in; /* 16 */
	struct INSTANCE_com_jbed_io_RawOutputStream_s *              out; /* 20 */
	jboolean                                                     opened; /* 24 */
	char pad25[3]; /* pad to offset 28 */
	jint                                                         pos; /* 28 */
	jint                                                         rpos; /* 32 */
	jint                                                         wpos; /* 36 */
	jint                                                         length; /* 40 */
	STRING_INSTANCE                                              encoding; /* 44 */
	STRING_INSTANCE                                              mediaType; /* 48 */
	jboolean                                                     isHandleValid; /* 52 */
	char pad53[3]; /* pad to offset 56 */
	jint                                                         mode; /* 56 */
	jint                                                         openMode; /* 60 */
	STRING_INSTANCE                                              name; /* 64 */
	jint                                                         handle; /* 68 */
	REFARRAY                                                     wblocks; /* 72 */
	jint                                                         wblocksCount; /* 76 */
	struct INSTANCE_com_jbed_io_JbedFileConnection_00024CacheBlock_s *  rblock; /* 80 */
	jint                                                         bufferLen; /* 84 */
	jboolean                                                     buffered; /* 88 */
	char pad89[3]; /* pad to offset 92 */
	jint                                                         __nextFinalized__; /* 92 */
}; /* 96 bytes */

struct INSTANCE_com_jbed_io_JbedFileConnection_00024CacheBlock_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	BYTEARRAY                                                    data; /* 12 */
	struct INSTANCE_com_jbed_io_JbedFileConnection_s *           conn; /* 16 */
	jint                                                         pos; /* 20 */
	jint                                                         available; /* 24 */
	jboolean                                                     dirty; /* 28 */
	char pad29[3]; /* pad to offset 32 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_microedition_media_CoreManager_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_microedition_media_TimeBaseImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_microedition_media_player_CoreBasicPlayer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_tina_media_MediaPlayer_s *          _mediaPlayer; /* 12 */
	jint                                                         _selfSupportedStdControls; /* 16 */
	REFARRAY                                                     _selfControlCache; /* 20 */
	jint                                                         _state; /* 24 */
	jint                                                         _loopCount; /* 28 */
	jint                                                         _loopCounter; /* 32 */
	jint                                                         _curLevel; /* 36 */
	jboolean                                                     _isMuted; /* 40 */
	jboolean                                                     _atEom; /* 41 */
	char pad42[2]; /* pad to offset 44 */
	struct INSTANCE_java_util_Vector_s *                         _playerListenerQueue; /* 44 */
	struct INSTANCE_java_util_Hashtable_s *                      _metaData; /* 48 */
	struct INSTANCE_com_jbed_microedition_media_TimeBaseImpl_s *  _timeBase; /* 52 */
	struct INSTANCE_com_jbed_microedition_media_player_StopTimeTask_s *  _stopTimeAction; /* 56 */
	jint                                                         _mediaTypeId; /* 60 */
	struct INSTANCE_com_jbed_midp_midlet_MIDletMap_s *           _midletMap; /* 64 */
	char pad68[4]; /* pad to offset 72 */
	jlong                                                        currentPlayingTime; /* 72 */
	jlong                                                        lastStartedTime; /* 80 */
}; /* 88 bytes */

struct INSTANCE_com_jbed_microedition_media_player_FormatSupport_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_util_Hashtable_s *                      intParametersRange; /* 12 */
	struct INSTANCE_java_util_Hashtable_s *                      strParametersValues; /* 16 */
	STRING_INSTANCE                                              contentType; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_microedition_media_player_MediaEventManager_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Thread_s *                         _dispatcherThread; /* 12 */
	struct INSTANCE_java_util_Vector_s *                         _eventQueue; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_microedition_media_player_MediaEventManager_00024MediaEvent_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         _originator; /* 12 */
	struct INSTANCE_java_lang_Object_s *                         _addressee; /* 16 */
	STRING_INSTANCE                                              _event; /* 20 */
	struct INSTANCE_java_lang_Object_s *                         _eventData; /* 24 */
	struct INSTANCE_com_jbed_midp_midlet_MIDletMap_s *           _midletMap; /* 28 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_microedition_media_player_MetaDataControlImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_microedition_media_player_CoreBasicPlayer_s *  _player; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_microedition_media_player_RecordControlImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_microedition_media_player_CoreBasicPlayer_s *  _player; /* 12 */
	struct INSTANCE_com_jbed_tina_media_MediaPlayer_s *          _tinaRecorder; /* 16 */
	struct INSTANCE_java_io_OutputStream_s *                     _recordStream; /* 20 */
	STRING_INSTANCE                                              _recordLocation; /* 24 */
	jboolean                                                     _recordStarted; /* 28 */
	jboolean                                                     _isStandbyMode; /* 29 */
	jboolean                                                     _isRecordStartEventSend; /* 30 */
	jboolean                                                     needCommit; /* 31 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_microedition_media_player_StopTimeControlImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_microedition_media_player_CoreBasicPlayer_s *  _player; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_microedition_media_player_StopTimeTask_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Thread_s *                         _timerThread; /* 12 */
	jlong                                                        _stopMediaTime; /* 16 */
	jlong                                                        _intervalUntilStopTime; /* 24 */
	struct INSTANCE_com_jbed_microedition_media_player_CoreBasicPlayer_s *  _player; /* 32 */
	jboolean                                                     _enabled; /* 36 */
	char pad37[3]; /* pad to offset 40 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_microedition_media_player_ToneControlImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_microedition_media_player_CoreBasicPlayer_s *  _player; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_microedition_media_player_VideoControlImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_microedition_media_player_CoreBasicPlayer_s *  _player; /* 12 */
	struct INSTANCE_com_jbed_tina_media_player_TinaExpandedVideoPlayer_s *  _tinaPlayer; /* 16 */
	jint                                                         _displayMode; /* 20 */
	struct INSTANCE_java_lang_Object_s *                         _guiObject; /* 24 */
	jboolean                                                     _canvasVisible; /* 28 */
	char pad29[3]; /* pad to offset 32 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_microedition_media_player_VolumeControlImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_microedition_media_player_CoreBasicPlayer_s *  _player; /* 12 */
	struct INSTANCE_com_jbed_tina_media_MediaPlayer_s *          _tinaPlayer; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_microedition_media_protocol_DataSourceSingleClipHelper_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_media_protocol_SourceStream_s *  _primaryStream; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_ExceptionNotifier_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_ImageCache_s
{
	/* Type of field "fImageFactory" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.ImageFactory;" */
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         fImageFactory; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_StringDataImageFactory_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_event_EventToolkit_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_ConfigBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_DefaultActionMapper_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_MIDPToolkit_s *                fToolkit; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_DefaultDeviceCapabilities_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_DefaultPhoneSystem_s
{
	/* Type of field "fEventLoop" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.lookandfeel.EventLoop;" */
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         fEventLoop; /* 12 */
	jboolean                                                     fCanFlashBacklight; /* 16 */
	jboolean                                                     fCanPlatformFlashBacklight; /* 17 */
	jboolean                                                     fCanVibrate; /* 18 */
	jboolean                                                     fDefaultBacklight; /* 19 */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_EventLoop_00024Canceller_s *  fFlashCanceller; /* 20 */
	struct INSTANCE_java_util_Timer_s *                          fVibrateTask; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_midp_lcdui_DefaultPhoneSystem_00024FlashHandler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	char pad12[4]; /* pad to offset 16 */
	jlong                                                        fEndTime; /* 16 */
	jboolean                                                     fLight; /* 24 */
	char pad25[3]; /* pad to offset 28 */
	struct INSTANCE_com_jbed_midp_lcdui_DefaultPhoneSystem_s *   this_000240; /* 28 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_midp_lcdui_NetworkIndicatorHandler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_ScreenRefresher_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	char pad12[4]; /* pad to offset 16 */
	jlong                                                        fLastRefreshTime; /* 16 */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_EventLoop_00024Canceller_s *  fCanceller; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_midp_lcdui_ScreenRefresher_00024Task_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_ScreenRefresher_s *      fScreenRefresher; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_UpcallBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_ValidationProfiler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s *        fParent; /* 12 */
	jint                                                         fX; /* 16 */
	jint                                                         fY; /* 20 */
	jint                                                         fWidth; /* 24 */
	jint                                                         fHeight; /* 28 */
	jint                                                         fVisX; /* 32 */
	jint                                                         fVisY; /* 36 */
	jint                                                         fVisWidth; /* 40 */
	jint                                                         fVisHeight; /* 44 */
	jint                                                         fMinimumWidth; /* 48 */
	jint                                                         fMinimumHeight; /* 52 */
	jint                                                         fPreferredWidth; /* 56 */
	jint                                                         fPreferredHeight; /* 60 */
	jboolean                                                     fLayoutDirty; /* 64 */
	jboolean                                                     fTraverse; /* 65 */
	jboolean                                                     fPaintDirty; /* 66 */
	jboolean                                                     fIsVisible; /* 67 */
	jint                                                         fLayoutData; /* 68 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_ComponentStateListener_s *  fComponentStateListener; /* 72 */
}; /* 76 bytes */

struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_000241_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s *        this_000240; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_ewt_Display_s
{
	/* Type of field "fEventLoop" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.lookandfeel.EventLoop;" */
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         fLCDUIDisplay; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Graphics_s *        fGraphics; /* 16 */
	jint                                                         fWidth; /* 20 */
	jint                                                         fHeight; /* 24 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Shell_s *            fShell; /* 28 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Display_00024EventListener_s *  fEventListener; /* 32 */
	struct INSTANCE_java_lang_Object_s *                         fEventLoop; /* 36 */
	struct INSTANCE_com_jbed_util_FastHashtable_s *              fScheduleMap; /* 40 */
}; /* 44 bytes */

struct INSTANCE_com_jbed_midp_lcdui_ewt_Display_000241_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         val_00024key; /* 12 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Display_00024EventListener_s *  this_000241; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_ewt_Display_00024EventListener_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s *        fReceiver; /* 12 */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_EventLoop_00024Canceller_s *  fKeyRepeatCanceller; /* 16 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Display_s *          this_000240; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_midp_lcdui_ewt_Display_00024ScheduleAction_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         fDelay; /* 12 */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_EventLoop_00024Canceller_s *  fCanceller; /* 16 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fRunnables; /* 20 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Display_s *          this_000240; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_midp_lcdui_javaui_FBCCEventLoop_000241_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_tina_event_EventAction_s *          val_00024eventAction; /* 12 */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_EventLoop_00024Action_s *  val_00024action; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_javaui_FBCCEventLoop_000242_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_javaui_FBCCEventLoop_s *  this_000240; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_javaui_FBCCEventLoop_000243_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_javaui_FBCCEventLoop_s *  this_000240; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_javaui_LinearGradient_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	INTARRAY                                                     fStopColors; /* 12 */
	INTARRAY                                                     fStopOffsets; /* 16 */
	jint                                                         fStopElementCount; /* 20 */
	jint                                                         fDirection; /* 24 */
	jboolean                                                     fIsInvalid; /* 28 */
	char pad29[3]; /* pad to offset 32 */
	INTARRAY                                                     fCachedColors; /* 32 */
	jboolean                                                     fIsPlainColor; /* 36 */
	char pad37[3]; /* pad to offset 40 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_midp_lcdui_javaui_PressedKeyCache_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_nativeui_CommandManager_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_util_FastHashtable_s *              fMapNativeCommands; /* 12 */
	jint                                                         fCommandId; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_DefaultLookAndFeel_s
{
	/* Type of field "fDisplayPeer" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.lookandfeel.peer.DisplayPeer;" */
	/* Type of field "fActionMapper" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.lookandfeel.ActionMapper;" */
	/* Type of field "fDeviceCapabilities" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.lookandfeel.DeviceCapabilities;" */
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         fDeviceCapabilities; /* 12 */
	struct INSTANCE_java_lang_Object_s *                         fActionMapper; /* 16 */
	struct INSTANCE_java_lang_Object_s *                         fDisplayPeer; /* 20 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     fCurrentDisplayable; /* 24 */
	struct INSTANCE_com_jbed_midp_lcdui_model_SystemScreen_s *   fCurrentSystemScreen; /* 28 */
	jint                                                         fInstanceId; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_esmertec_CommandMenu_000241_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandContext_s *  val_00024context; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_esmertec_EsmertecChoiceItemFactory_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     fList; /* 12 */
	char pad13[3]; /* pad to offset 16 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_esmertec_EsmertecPeerFactory_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_esmertec_FocusRenderer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     fAskAncestors; /* 12 */
	char pad13[3]; /* pad to offset 16 */
	jint                                                         fDeltaHeight; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_esmertec_GaugeRenderer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     fDrawValueText; /* 12 */
	char pad13[3]; /* pad to offset 16 */
	struct INSTANCE_javax_microedition_lcdui_Font_s *            fGaugeFont; /* 16 */
	jint                                                         fFocusColor; /* 20 */
	jint                                                         fButtonBackgroundColor; /* 24 */
	struct INSTANCE_com_jbed_midp_lcdui_javaui_LinearGradient_s *  fButtonBackgroundColorGradient; /* 28 */
	jint                                                         fButtonForegroundColor; /* 32 */
	jint                                                         fBorderColor; /* 36 */
	jint                                                         fAnimationStep; /* 40 */
	jboolean                                                     fPaintFocus; /* 44 */
	char pad45[3]; /* pad to offset 48 */
	jint                                                         fBackgroundColor; /* 48 */
	struct INSTANCE_com_jbed_midp_lcdui_javaui_LinearGradient_s *  fBackgroundColorGradient; /* 52 */
}; /* 56 bytes */

struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_esmertec_ImageLinkRenderer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_esmertec_IndicatorDecoration_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     fNetworkActive; /* 12 */
	char pad13[3]; /* pad to offset 16 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_esmertec_Resources_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_esmertec_ScrollBarRenderer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         fButtonBackgroundColor; /* 12 */
	struct INSTANCE_com_jbed_midp_lcdui_javaui_LinearGradient_s *  fButtonBackgroundColorGradient; /* 16 */
	jint                                                         fButtonForegroundColor; /* 20 */
	jint                                                         fBackgroundColor; /* 24 */
	struct INSTANCE_com_jbed_midp_lcdui_javaui_LinearGradient_s *  fBackgroundColorGradient; /* 28 */
	jint                                                         fLightShadowColor; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_esmertec_TextInputTools_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_model_SystemScreen_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         fData; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_datepicker_CalendarController_000241_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_datepicker_CalendarController_s *  this_000240; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_datepicker_CalendarUtils_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_datepicker_DatePicker_000241_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_datepicker_DatePicker_s *  this_000240; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_BackgroundRenderer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         fColor; /* 12 */
	struct INSTANCE_com_jbed_midp_lcdui_javaui_LinearGradient_s *  fLinearGradient; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_Border_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	INTARRAY                                                     fBorderWidths; /* 12 */
	INTARRAY                                                     fBorders; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandContext_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         fCommand; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommitRegistry_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fListeners; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CyclingEditTextInputHandler_000241_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CyclingEditTextInputHandler_s *  this_000240; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_InputHandlerAdapter_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_InputHandlerDecorator_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_InputHandler_s *  fDecoree; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_KeyRegistry_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fKeyConsumers; /* 12 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fKeyRegistryListeners; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_LazyDisplayableShell_000241_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_LazyDisplayableShell_s *  this_000240; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardCommandHandler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_KeyRegistry_s *  fKeyRegistry; /* 12 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommitRegistry_s *  fCommitRegistry; /* 16 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fCommandConsumers; /* 20 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     fDisplayable; /* 24 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fDisplayableCommandContexts; /* 28 */
	struct INSTANCE_javax_microedition_lcdui_Item_s *            fItem; /* 32 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         fItemDefaultCommand; /* 36 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fItemCommandContexts; /* 40 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fInternalCommandContexts; /* 44 */
	INTARRAY                                                     fWatchKeys; /* 48 */
	BOOLEANARRAY                                                 fWatchKeysRegistered; /* 52 */
	jint                                                         fKeyCount; /* 56 */
	INTARRAY                                                     fKeys; /* 60 */
	REFARRAY                                                     fAssignedCommandContexts; /* 64 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandContext_s *  fMenuCommandContext; /* 68 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fMenuCommandContexts; /* 72 */
	jboolean                                                     fForceDisplayableCommands; /* 76 */
	char pad77[3]; /* pad to offset 80 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_DisplayableShell_s *  fShell; /* 80 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandComponent_s *  fSoftLeftComponent; /* 84 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandComponent_s *  fSoftRightComponent; /* 88 */
}; /* 92 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardInputHandler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     fIsKeyRegistered; /* 12 */
	char pad13[3]; /* pad to offset 16 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardLayout_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         fAlignment; /* 12 */
	jint                                                         fPaddingTop; /* 16 */
	jint                                                         fPaddingRight; /* 20 */
	jint                                                         fPaddingBottom; /* 24 */
	jint                                                         fPaddingLeft; /* 28 */
	jint                                                         fLastWidthHint; /* 32 */
	jint                                                         fLastHeightHint; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_VerticalLayout_00024Distributor_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Composite_s *        fComposite; /* 12 */
	jint                                                         fAvailableHeight; /* 16 */
	jint                                                         fContentMinHeight; /* 20 */
	jint                                                         fContentPrfHeight; /* 24 */
	jint                                                         fContentReqHeight; /* 28 */
	jint                                                         fExpandables; /* 32 */
	jint                                                         fCollapsedExpandables; /* 36 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_VerticalLayout_s *  this_000240; /* 40 */
}; /* 44 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_model_ModelListenerTools_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_NativeTextBoxDispatcherImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_model_NativeTextBoxListener_s *  fListener; /* 12 */
	jint                                                         fCommandId; /* 16 */
	STRING_INSTANCE                                              fText; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_NativeTextBoxPeer_s
{
	/* Type of field "fDispatcher" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.model.NativeTextBoxDispatcher;" */
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_TextBox_s *         fTextBox; /* 12 */
	struct INSTANCE_java_lang_Object_s *                         fDispatcher; /* 16 */
	jboolean                                                     fIsVisible; /* 20 */
	char pad21[3]; /* pad to offset 24 */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_nativeui_CommandManager_s *  fCommandManager; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardDisplayPeer_s
{
	/* Type of field "fPhoneSystem" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.lookandfeel.PhoneSystem;" */
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         fLCDUIDisplay; /* 12 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Display_s *          fEWTDisplay; /* 16 */
	struct INSTANCE_java_lang_Object_s *                         fPhoneSystem; /* 20 */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_DisplayablePeer_s *  fDisplayablePeer; /* 24 */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_DisplayablePeer_s *  fSystemScreenPeer; /* 28 */
	INTARRAY                                                     fColors; /* 32 */
	jint                                                         fBestListImageWidth; /* 36 */
	jint                                                         fBestChoiceGroupImageWidth; /* 40 */
	jint                                                         fBestAlertImageWidth; /* 44 */
	jint                                                         fBestListImageHeight; /* 48 */
	jint                                                         fBestChoiceGroupImageHeight; /* 52 */
	jint                                                         fBestAlertImageHeight; /* 56 */
	jint                                                         fNormalBorderStyle; /* 60 */
	jint                                                         fHighlightedBorderStyle; /* 64 */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_IndicatorListener_s *  fIndicatorListener; /* 68 */
}; /* 72 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardDisplayablePeer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     fDisplayable; /* 12 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_DisplayableShell_s *  fShell; /* 16 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_TextComponent_s *    fTitleComponent; /* 20 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_TextComponent_s *    fTickerComponent; /* 24 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s *        fSizeComponent; /* 28 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Composite_s *        fContent; /* 32 */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_IndicatorListener_s *  fIndicatorListener; /* 36 */
	jboolean                                                     fIsVisible; /* 40 */
	char pad41[3]; /* pad to offset 44 */
}; /* 44 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardItemPeer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Item_s *            fItem; /* 12 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_ItemComposite_s *  fItemComposite; /* 16 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s *        fContentComponent; /* 20 */
	jboolean                                                     fInitialized; /* 24 */
	char pad25[3]; /* pad to offset 28 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StringSequence_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRINGARRAY                                                  fStrings; /* 12 */
	INTARRAY                                                     fConstraints; /* 16 */
	jint                                                         fIndex; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_DefaultTextFormatter_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_LineBreakIterator_s *  fBreakIterator; /* 12 */
	jint                                                         fBehavior; /* 16 */
	INTARRAY                                                     fOffsets; /* 20 */
	INTARRAY                                                     fLengths; /* 24 */
	INTARRAY                                                     fWidths; /* 28 */
	jint                                                         fCount; /* 32 */
	jint                                                         fMaxWidth; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_EditTextFormatterFactory_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_EditTextComponent_s *  fEditTextComponent; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_FormattedText_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              string; /* 12 */
	INTARRAY                                                     offsets; /* 16 */
	INTARRAY                                                     lengths; /* 20 */
	INTARRAY                                                     widths; /* 24 */
	jint                                                         lineCount; /* 28 */
	jint                                                         maxWidth; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_LineBreakIterator_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_SingleLineTextFormatter_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_LineBreakIterator_s *  fBreakIterator; /* 12 */
	STRING_INSTANCE                                              fBreakString; /* 16 */
	struct INSTANCE_java_lang_StringBuffer_s *                   fBuffer; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_TextFormatterDecorator_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_TextFormatter_s *  fDecoree; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_midlet_MIDletMap_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_midlet_MIDlet_s *         midlet; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         disp; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_nokia_NokiaGraphicsImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         alpha; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Graphics_s *        graphics; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_nokia_NokiaPlayerListener_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_nokia_mid_sound_SoundListener_s *        _listener; /* 12 */
	struct INSTANCE_com_nokia_mid_sound_Sound_s *                _sound; /* 16 */
	jboolean                                                     _receiveEvent; /* 20 */
	char pad21[3]; /* pad to offset 24 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_nokia_NokiaToneToMidi_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         BPM_default; /* 12 */
	BYTEARRAY                                                    _dataStream; /* 16 */
	jint                                                         _dataLength; /* 20 */
	jint                                                         _curByteIndex; /* 24 */
	jbyte                                                        _bit; /* 28 */
	char pad29[3]; /* pad to offset 32 */
	struct INSTANCE_java_util_Vector_s *                         _vector; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_nokia_NokiaToneToMidi_00024NoteInformation_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jbyte                                                        note; /* 12 */
	char pad13[3]; /* pad to offset 16 */
	jint                                                         duration; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_pim_Coder_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_pim_Field_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         id; /* 12 */
	jint                                                         dataType; /* 16 */
	jint                                                         capacity; /* 20 */
	jint                                                         countValues; /* 24 */
	INTARRAY                                                     attributes; /* 28 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_pim_LocalStringTokenizer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              value; /* 12 */
	STRING_INSTANCE                                              separator; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_pim_PIMItemEnumerationImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_pim_PIMItemImpl_s *                 curItem; /* 12 */
	struct INSTANCE_javax_microedition_pim_PIMList_s *           pimList; /* 16 */
	struct INSTANCE_com_jbed_pim_PIMItemImpl_s *                 matchingItem; /* 20 */
	STRING_INSTANCE                                              matchingValue; /* 24 */
	jint                                                         todoField; /* 28 */
	jlong                                                        startDate; /* 32 */
	jlong                                                        endDate; /* 40 */
	STRING_INSTANCE                                              category; /* 48 */
	jint                                                         selectType; /* 52 */
}; /* 56 bytes */

struct INSTANCE_com_jbed_pim_PIMItemImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	BYTEARRAY                                                    vData; /* 12 */
	STRING_INSTANCE                                              itemUID; /* 16 */
	struct INSTANCE_java_util_Vector_s *                         categories; /* 20 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 deletedCategories; /* 24 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 addedCategories; /* 28 */
	REFARRAY                                                     fields; /* 32 */
	jboolean                                                     modified; /* 36 */
	char pad37[3]; /* pad to offset 40 */
	jint                                                         mode; /* 40 */
	struct INSTANCE_com_jbed_pim_PIMListImpl_s *                 pimList; /* 44 */
	jlong                                                        revision; /* 48 */
}; /* 56 bytes */

struct INSTANCE_com_jbed_pim_PIMListImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         id; /* 12 */
	STRING_INSTANCE                                              name; /* 16 */
	jboolean                                                     isDefaultName; /* 20 */
	char pad21[3]; /* pad to offset 24 */
	jint                                                         handle; /* 24 */
	jboolean                                                     isHandleValid; /* 28 */
	char pad29[3]; /* pad to offset 32 */
	jint                                                         open; /* 32 */
	jint                                                         mode; /* 36 */
	jint                                                         pimListType; /* 40 */
	INTARRAY                                                     suppFields; /* 44 */
	INTARRAY                                                     suppFieldsMaxValues; /* 48 */
	struct INSTANCE_java_util_Hashtable_s *                      tableSuppAttrs; /* 52 */
	struct INSTANCE_java_util_Hashtable_s *                      tableSuppArrElems; /* 56 */
	struct INSTANCE_java_util_Hashtable_s *                      fieldLabels; /* 60 */
	jint                                                         __nextFinalized__; /* 64 */
}; /* 68 bytes */

struct INSTANCE_com_jbed_pim_PIMListProxy_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_pim_Parameter_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              type; /* 12 */
	struct INSTANCE_java_util_Vector_s *                         values; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_pim_Property_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              name; /* 12 */
	struct INSTANCE_java_util_Vector_s *                         params; /* 16 */
	STRING_INSTANCE                                              value; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_pim_Record_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              name; /* 12 */
	struct INSTANCE_java_util_Vector_s *                         properties; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_pim_VCalWriter_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_io_OutputStreamWriter_s *               osw; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_pim_VCardWriter_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_io_OutputStreamWriter_s *               osw; /* 12 */
	jboolean                                                     versionIs30; /* 16 */
	char pad17[3]; /* pad to offset 20 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_pim_VReader_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         encoding; /* 12 */
	STRING_INSTANCE                                              charset; /* 16 */
	struct INSTANCE_java_io_InputStream_s *                      inputStream; /* 20 */
	struct INSTANCE_java_io_InputStreamReader_s *                inStrRder; /* 24 */
	struct INSTANCE_java_io_InputStreamReader_s *                tempReader; /* 28 */
	jboolean                                                     WSPFound; /* 32 */
	jboolean                                                     stop; /* 33 */
	jboolean                                                     pause; /* 34 */
	jboolean                                                     lastEvent; /* 35 */
	jint                                                         type; /* 36 */
	jint                                                         state; /* 40 */
	struct INSTANCE_java_util_Vector_s *                         records; /* 44 */
	struct INSTANCE_com_jbed_pim_Record_s *                      entry; /* 48 */
	struct INSTANCE_com_jbed_pim_Property_s *                    property; /* 52 */
	struct INSTANCE_java_lang_StringBuffer_s *                   tokenBuffer; /* 56 */
	STRING_INSTANCE                                              currentItem; /* 60 */
	jchar                                                        c; /* 64 */
	char pad66[2]; /* pad to offset 68 */
	jint                                                         depth; /* 68 */
	jint                                                         vFormat; /* 72 */
	STRING_INSTANCE                                              version; /* 76 */
	jboolean                                                     skipParams; /* 80 */
	jboolean                                                     readInternalVCard; /* 81 */
	jboolean                                                     containtsInternalVCard; /* 82 */
	char pad83[1]; /* pad to offset 84 */
	struct INSTANCE_com_jbed_pim_PIMListImpl_s *                 currentPIMList; /* 84 */
	struct INSTANCE_com_jbed_pim_ContactListImpl_s *             internalContactList; /* 88 */
	struct INSTANCE_com_jbed_pim_EventListImpl_s *               internalEventList; /* 92 */
	struct INSTANCE_com_jbed_pim_ToDoListImpl_s *                internalToDoList; /* 96 */
}; /* 100 bytes */

struct INSTANCE_com_jbed_reflect_ClassAccess_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	REFARRAY                                                     dynClasses; /* 12 */
	REFARRAY                                                     dynClassInfo; /* 16 */
	STRINGARRAY                                                  nameCache; /* 20 */
	jboolean                                                     allClasses; /* 24 */
	char pad25[3]; /* pad to offset 28 */
	LONGARRAY                                                    params; /* 28 */
	jint                                                         nextLowClassId; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_reflect_ClassAccess_00024ClassIterator_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_reflect_ClassAccess_s *             classes; /* 12 */
	jint                                                         bundle; /* 16 */
	struct INSTANCE_java_lang_Class_s *                          lastClass; /* 20 */
	jboolean                                                     allBundles; /* 24 */
	jboolean                                                     done; /* 25 */
	char pad26[2]; /* pad to offset 28 */
	jint                                                         dynamicClassIdx; /* 28 */
	jboolean                                                     ownState; /* 32 */
	char pad33[3]; /* pad to offset 36 */
	REFARRAY                                                     tables; /* 36 */
	REFARRAY                                                     dynClassesCopy; /* 40 */
}; /* 44 bytes */

struct INSTANCE_com_jbed_reflect_ClassRefTable_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         tableAdr; /* 12 */
	jint                                                         bktMask; /* 16 */
	jint                                                         idxMask; /* 20 */
	jint                                                         numClasses; /* 24 */
	STRINGARRAY                                                  nameCache; /* 28 */
	INTARRAY                                                     classAdrs; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_reflect_Field_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Class_s *                          owner; /* 12 */
	jint                                                         modifiers; /* 16 */
	jchar                                                        nameId; /* 20 */
	char pad22[2]; /* pad to offset 24 */
	jint                                                         typeId; /* 24 */
	jint                                                         adr; /* 28 */
	jint                                                         from; /* 32 */
	jint                                                         to; /* 36 */
	struct INSTANCE_com_jbed_reflect_Field_s *                   next; /* 40 */
}; /* 44 bytes */

struct INSTANCE_com_jbed_reflect_Method_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Class_s *                          owner; /* 12 */
	jint                                                         modifiers; /* 16 */
	jchar                                                        nameId; /* 20 */
	jchar                                                        typeId; /* 22 */
	jint                                                         adr; /* 24 */
	jshort                                                       num; /* 28 */
	jchar                                                        size; /* 30 */
	jint                                                         profilingInfo; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_reflect_ReflectionTable_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         tableAdr; /* 12 */
	jint                                                         bktShift; /* 16 */
	jint                                                         bktMask; /* 20 */
	jint                                                         idxMask; /* 24 */
	jint                                                         dBucketBits; /* 28 */
	jint                                                         dIndexBits; /* 32 */
	jint                                                         dBktShift; /* 36 */
	jint                                                         dBktMask; /* 40 */
	jint                                                         dIdxMask; /* 44 */
	jint                                                         extraBit; /* 48 */
	REFARRAY                                                     dTable; /* 52 */
	jint                                                         dTableData; /* 56 */
	jint                                                         dTableEntries; /* 60 */
	jint                                                         dTableFullBuckets; /* 64 */
	jint                                                         dTableUsedBuckets; /* 68 */
	struct INSTANCE_com_jbed_reflect_ReflectionTable_s *         dynamicTable; /* 72 */
}; /* 76 bytes */

struct INSTANCE_com_jbed_reflect_SignatureEncoder_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	BYTEARRAY                                                    sig; /* 12 */
	jint                                                         sigLen; /* 16 */
	jboolean                                                     highNibble; /* 20 */
	jboolean                                                     addedVoid; /* 21 */
	char pad22[2]; /* pad to offset 24 */
	jint                                                         currentId; /* 24 */
	jint                                                         sigIdx; /* 28 */
	struct INSTANCE_com_jbed_reflect_ClassAccess_s *             classes; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_runtime_ArchBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Assert_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_AsyncFinalized_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         nextFinalized; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_runtime_Base_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_ClassLoader_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_CodeAnchor_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         smbId; /* 12 */
	struct INSTANCE_java_lang_Object_s *                         runningCodeAnchor; /* 16 */
	struct INSTANCE_com_jbed_tbcc_CodeBlock_s *                  codeBlock; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_runtime_CollectorBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_ConfigTraceBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_DebugVm_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Double_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_FinalizedQueue_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         nextQueue; /* 12 */
	jint                                                         finList; /* 16 */
	struct INSTANCE_com_jbed_runtime_AsyncFinalized_s *          appendedObjects; /* 20 */
	struct INSTANCE_com_jbed_runtime_AsyncFinalized_s *          qHead; /* 24 */
	struct INSTANCE_com_jbed_runtime_AsyncFinalized_s *          qTail; /* 28 */
	jint                                                         numQueued; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_runtime_Float_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_GlobalCallHandler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         hash; /* 12 */
	jint                                                         bucketIdx; /* 16 */
	jint                                                         id; /* 20 */
	jint                                                         type; /* 24 */
	struct INSTANCE_com_jbed_runtime_Isolate_s *                 iso; /* 28 */
	jint                                                         localIdx; /* 32 */
	struct INSTANCE_com_jbed_runtime_GlobalCallHandler_s *       prev; /* 36 */
	struct INSTANCE_com_jbed_runtime_GlobalCallHandler_s *       next; /* 40 */
}; /* 44 bytes */

struct INSTANCE_com_jbed_runtime_GlobalCallHandler_00024Iterator_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_runtime_GlobalCallHandler_s *       current; /* 12 */
	struct INSTANCE_com_jbed_runtime_Isolate_s *                 iso; /* 16 */
	jint                                                         hash; /* 20 */
	jint                                                         bucketIdx; /* 24 */
	jint                                                         validState; /* 28 */
	jint                                                         type; /* 32 */
	jboolean                                                     allBuckets; /* 36 */
	char pad37[3]; /* pad to offset 40 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_runtime_HeapChunk_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         addr; /* 12 */
	jint                                                         rawAddr; /* 16 */
	jint                                                         size; /* 20 */
	struct INSTANCE_com_jbed_runtime_HeapChunk_s *               next; /* 24 */
	jboolean                                                     locked; /* 28 */
	jboolean                                                     lockable; /* 29 */
	char pad30[2]; /* pad to offset 32 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_runtime_Integer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Isolate_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         state; /* 12 */
	jboolean                                                     active; /* 16 */
	char pad17[3]; /* pad to offset 20 */
	STRINGARRAY                                                  argv; /* 20 */
	jboolean                                                     nativeNotify; /* 24 */
	char pad25[3]; /* pad to offset 28 */
	struct INSTANCE_com_jbed_runtime_CodeAnchor_s *              loadedClassesAnchor; /* 28 */
	jint                                                         finList; /* 32 */
	jint                                                         finQueueList; /* 36 */
	struct INSTANCE_com_jbed_runtime_Signal_s *                  stateSignal; /* 40 */
	jint                                                         desiredState; /* 44 */
	jint                                                         desiredStateAdr; /* 48 */
	jint                                                         curState; /* 52 */
	jint                                                         nextState; /* 56 */
}; /* 60 bytes */

struct INSTANCE_com_jbed_runtime_IsolateContext_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_IsolateDisplay_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Kni_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Long_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Main_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_MemSupport_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Memory_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Memory_00024GGCIsolateMarker_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_runtime_Memory_00024GGCIsolateMarker_s *  next; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_runtime_NativeCallStateStack_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         base; /* 12 */
	jint                                                         limit; /* 16 */
	jint                                                         adr; /* 20 */
	jint                                                         frame; /* 24 */
	BYTEARRAY                                                    buff; /* 28 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_runtime_NativeOps_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_NativeTransport_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         transportHandle; /* 12 */
	jboolean                                                     handleValid; /* 16 */
	char pad17[3]; /* pad to offset 20 */
	jint                                                         __nextFinalized__; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_runtime_OsBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_PhoneSystem_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_PhoneSystem_00024IMEIPropertySource_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_QuotaGroup_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_RomObjects_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         objectCount; /* 12 */
	jint                                                         classCount; /* 16 */
	REFARRAY                                                     objTable; /* 20 */
	INTARRAY                                                     objLabels; /* 24 */
	jint                                                         syncIdx; /* 28 */
	INTARRAY                                                     stringHashtable; /* 32 */
	jint                                                         packageNameTableAdr; /* 36 */
	jint                                                         baseNameTableAdr; /* 40 */
	jint                                                         classRefTableAdr; /* 44 */
	jint                                                         methodNameTableAdr; /* 48 */
	jint                                                         fieldNameTableAdr; /* 52 */
	jint                                                         signatureTableAdr; /* 56 */
	jint                                                         bundleId; /* 60 */
	jint                                                         initFlagsAdr; /* 64 */
	jint                                                         absPrimStaticsSize; /* 68 */
	jint                                                         absPtrStaticsSize; /* 72 */
	jint                                                         absInitFlagsSize; /* 76 */
	BYTEARRAY                                                    primStatics; /* 80 */
	REFARRAY                                                     ptrStatics; /* 84 */
	BYTEARRAY                                                    initFlags; /* 88 */
	INTARRAY                                                     stackMapAdrs; /* 92 */
	jint                                                         stackMapCount; /* 96 */
	struct INSTANCE_com_jbed_tbcc_Writer_s *                     writer; /* 100 */
	struct INSTANCE_com_jbed_reflect_ClassAccess_s *             classes; /* 104 */
	INTARRAY                                                     methodCodeRanges; /* 108 */
	INTARRAY                                                     numCodeRangeElements; /* 112 */
	jboolean                                                     debugInfo; /* 116 */
	char pad117[3]; /* pad to offset 120 */
}; /* 120 bytes */

struct INSTANCE_com_jbed_runtime_RuntimeInfo_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Scheduled_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         stackBase; /* 12 */
	jint                                                         ofm; /* 16 */
	jint                                                         context; /* 20 */
	jint                                                         excpFP; /* 24 */
	jint                                                         excpPC; /* 28 */
	jint                                                         ssp; /* 32 */
	jint                                                         stackLimit; /* 36 */
	BYTEARRAY                                                    stack; /* 40 */
	struct INSTANCE_com_jbed_runtime_NativeCallStateStack_s *    ncss; /* 44 */
	struct INSTANCE_java_lang_Thread_s *                         thread; /* 48 */
	struct INSTANCE_java_lang_Runnable_s *                       handler; /* 52 */
	struct INSTANCE_java_lang_Throwable_s *                      exception; /* 56 */
	struct INSTANCE_com_jbed_runtime_Synchronizer_s *            synchronizer; /* 60 */
	STRING_INSTANCE                                              name; /* 64 */
	jint                                                         givenPrio; /* 68 */
	jint                                                         prio; /* 72 */
	jint                                                         visiblePrio; /* 76 */
	jint                                                         id; /* 80 */
	jint                                                         status; /* 84 */
	jlong                                                        timeout; /* 88 */
	jlong                                                        running; /* 96 */
	jint                                                         suspendCount; /* 104 */
	jboolean                                                     schedF; /* 108 */
	jboolean                                                     timeoutF; /* 109 */
	jboolean                                                     interrupted; /* 110 */
	jboolean                                                     interruptible; /* 111 */
	jboolean                                                     triggerable; /* 112 */
	jboolean                                                     stopped; /* 113 */
	jboolean                                                     daemon; /* 114 */
	jboolean                                                     overrun; /* 115 */
	jboolean                                                     miss; /* 116 */
	char pad117[3]; /* pad to offset 120 */
	jint                                                         fairness; /* 120 */
	jint                                                         posPS; /* 124 */
	struct INSTANCE_com_jbed_runtime_Scheduled_s *               parent; /* 128 */
	struct INSTANCE_com_jbed_runtime_Scheduled_s *               nextTimeout; /* 132 */
	struct INSTANCE_com_jbed_runtime_Scheduled_s *               prevTimeout; /* 136 */
	struct INSTANCE_com_jbed_runtime_Scheduled_s *               nextScheduled; /* 140 */
	struct INSTANCE_com_jbed_runtime_Scheduled_s *               prevScheduled; /* 144 */
	struct INSTANCE_com_jbed_runtime_Scheduled_s *               nextjinsert; /* 148 */
	struct INSTANCE_com_jbed_runtime_Scheduled_s *               waitingQ; /* 152 */
	struct INSTANCE_com_jbed_runtime_Scheduled_s *               blockingQ; /* 156 */
	struct INSTANCE_com_jbed_runtime_Synchronizer_s *            blockedBy; /* 160 */
	struct INSTANCE_com_jbed_runtime_Synchronizer_s *            waitingFor; /* 164 */
	struct INSTANCE_com_jbed_runtime_Synchronizer_s *            owned; /* 168 */
	jint                                                         statusS; /* 172 */
	jboolean                                                     timeoutFS; /* 176 */
	jboolean                                                     schedFS; /* 177 */
	char pad178[2]; /* pad to offset 180 */
	struct INSTANCE_com_jbed_runtime_Synchronizer_s *            waitingForS; /* 180 */
	struct INSTANCE_com_jbed_runtime_Synchronizer_s *            blockedByS; /* 184 */
	jint                                                         runtimeReservedStackNesting; /* 188 */
	jint                                                         noExceptionNesting; /* 192 */
	jint                                                         assertingStackLimit; /* 196 */
	jint                                                         lower; /* 200 */
	jint                                                         upper; /* 204 */
	jint                                                         pendingExitEvents; /* 208 */
	struct INSTANCE_java_lang_Object_s *                         groupID; /* 212 */
	jbyte                                                        changes; /* 216 */
	char pad217[3]; /* pad to offset 220 */
	jint                                                         paramPtr; /* 220 */
	struct INSTANCE_com_jbed_runtime_Signal_s *                  signal; /* 224 */
}; /* 228 bytes */

struct INSTANCE_com_jbed_runtime_Scheduler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_SchedulerInlines_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Scheduling_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_StackMapBlock_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         pcBase; /* 12 */
	jint                                                         pcLimit; /* 16 */
	jint                                                         numMaps; /* 20 */
	jint                                                         shortMapAddr; /* 24 */
	jint                                                         longMapAddr; /* 28 */
	struct INSTANCE_com_jbed_runtime_StackMapBlock_s *           next; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_runtime_SuperScheduler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Synchronizer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jbyte                                                        bitset; /* 12 */
	char pad13[1]; /* pad to offset 14 */
	jshort                                                       recursions; /* 14 */
	struct INSTANCE_com_jbed_runtime_Scheduled_s *               owner; /* 16 */
	struct INSTANCE_com_jbed_runtime_Scheduled_s *               waitedQ; /* 20 */
	struct INSTANCE_com_jbed_runtime_Scheduled_s *               blockedQ; /* 24 */
	struct INSTANCE_com_jbed_runtime_Synchronizer_s *            nextOwned; /* 28 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_runtime_SysInfo_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_System_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_SystemTimer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Trace_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_runtime_Trace_s *                   next; /* 12 */
	jint                                                         p0; /* 16 */
	jint                                                         p1; /* 20 */
	jint                                                         p2; /* 24 */
	jint                                                         p3; /* 28 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_runtime_Tracing_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_VmConfigBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_kdwp_Agent_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_kdwp_Event_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_kdwp_Reader_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_security_CertGeneralName_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jbyte                                                        type; /* 12 */
	char pad13[3]; /* pad to offset 16 */
	struct INSTANCE_java_lang_Object_s *                         name; /* 16 */
	struct INSTANCE_com_jbed_security_CertGeneralName_s *        next; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_security_CertInfo_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_iaik_me_x509_X509Certificate_s *             cert; /* 12 */
	STRING_INSTANCE                                              domain; /* 16 */
	STRING_INSTANCE                                              rootKeyHash; /* 20 */
	STRING_INSTANCE                                              rootCertHash; /* 24 */
	BYTEARRAY                                                    derEncoding; /* 28 */
	jint                                                         source; /* 32 */
	BYTEARRAY                                                    cca; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_security_Domain_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_security_GenData_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_security_PublicKeyStore_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	REFARRAY                                                     trustedCerts; /* 12 */
	struct INSTANCE_java_util_Hashtable_s *                      currRootKeyHashes; /* 16 */
	struct INSTANCE_java_util_Hashtable_s *                      disabledCertHash; /* 20 */
	struct INSTANCE_com_jbed_security_CertInfo_s *               mfgCert; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_security_SecureStore_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_security_SecurityConfigBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_tbcc_CodeBlock_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     registered; /* 12 */
	char pad13[3]; /* pad to offset 16 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_tbcc_Coder_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_tbcc_Writer_s *                     writer; /* 12 */
	INTARRAY                                                     stackMode; /* 16 */
	INTARRAY                                                     stackValue; /* 20 */
	INTARRAY                                                     stackInfo; /* 24 */
	jint                                                         topIdx0; /* 28 */
	jint                                                         topIdx; /* 32 */
	jint                                                         destVar; /* 36 */
	struct INSTANCE_com_jbed_reflect_DynamicMethod_s *           method; /* 40 */
	jint                                                         owner; /* 44 */
	INTARRAY                                                     label; /* 48 */
	INTARRAY                                                     labelId; /* 52 */
	jint                                                         numLabels; /* 56 */
	jint                                                         currentFixups; /* 60 */
	jint                                                         numTempLabels; /* 64 */
	INTARRAY                                                     tempLabel; /* 68 */
	jint                                                         truncateLabel; /* 72 */
	jboolean                                                     modeLongJumps; /* 76 */
	char pad77[3]; /* pad to offset 80 */
	INTARRAY                                                     handlerInfo; /* 80 */
	INTARRAY                                                     handlerRanges; /* 84 */
	jint                                                         handlerRangePos; /* 88 */
	jint                                                         controlWordOffset; /* 92 */
	jint                                                         controlWordRef; /* 96 */
	jint                                                         controlWordLabel; /* 100 */
	jint                                                         returnTyp; /* 104 */
	struct INSTANCE_com_jbed_tbcc_Pool_s *                       pool; /* 108 */
	BYTEARRAY                                                    code; /* 112 */
	jint                                                         bcPos; /* 116 */
	jint                                                         bcStart; /* 120 */
	jboolean                                                     nativeCall; /* 124 */
	char pad125[3]; /* pad to offset 128 */
	jint                                                         debugMode; /* 128 */
	jboolean                                                     openAlloc; /* 132 */
	jboolean                                                     maySplit; /* 133 */
	char pad134[2]; /* pad to offset 136 */
	jint                                                         allocStart; /* 136 */
	jint                                                         allocLimit; /* 140 */
	INTARRAY                                                     stackExp; /* 144 */
	struct INSTANCE_JBedFastCoder_OptList_s *                    safePointer; /* 148 */
	struct INSTANCE_JBedFastCoder_OptList_s *                    safeIndex; /* 152 */
	BYTEARRAY                                                    localPtr; /* 156 */
	INTARRAY                                                     map; /* 160 */
	jint                                                         numMapWords; /* 164 */
	INTARRAY                                                     treeConst; /* 168 */
	INTARRAY                                                     treeDist; /* 172 */
	jint                                                         defaultDist; /* 176 */
	jint                                                         treeSize; /* 180 */
	jint                                                         nonLeafCalls; /* 184 */
	jint                                                         methodCodeRangeIndex; /* 188 */
	jint                                                         methodCodeLength; /* 192 */
}; /* 196 bytes */

struct INSTANCE_com_jbed_tbcc_Compiler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_tbcc_Emitter_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_tbcc_FileBlockStreamLoader_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_tbcc_CodeBlock_s *                  cb; /* 12 */
	jint                                                         blockCount; /* 16 */
	jint                                                         largeBlockCount; /* 20 */
	jint                                                         largeBlockSpace; /* 24 */
	jint                                                         objFlags; /* 28 */
	INTARRAY                                                     labelAdrs; /* 32 */
	INTARRAY                                                     blockAdrs; /* 36 */
	INTARRAY                                                     largeBlockAdrs; /* 40 */
	INTARRAY                                                     largeBlockVBase; /* 44 */
	jint                                                         primStatics; /* 48 */
	jint                                                         ptrStatics; /* 52 */
	jint                                                         initFlags; /* 56 */
	jint                                                         numDynCodeChains; /* 60 */
	INTARRAY                                                     dynCodeChains; /* 64 */
	jint                                                         numLargeBlockChains; /* 68 */
	INTARRAY                                                     largeBlockChains; /* 72 */
	jint                                                         numLabelChains; /* 76 */
	INTARRAY                                                     labelChains; /* 80 */
	jint                                                         numStaticCodeChains; /* 84 */
	INTARRAY                                                     staticCodeChains; /* 88 */
	INTARRAY                                                     staticCodeChainAdrs; /* 92 */
	jint                                                         numStaticChains; /* 96 */
	INTARRAY                                                     staticChains; /* 100 */
	INTARRAY                                                     staticChainAdrs; /* 104 */
	BYTEARRAY                                                    blockBuffer; /* 108 */
}; /* 112 bytes */

struct INSTANCE_com_jbed_tbcc_Pool_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Class_s *                          poolClass; /* 12 */
	jint                                                         count; /* 16 */
	BYTEARRAY                                                    tags; /* 20 */
	INTARRAY                                                     vals; /* 24 */
	INTARRAY                                                     typeIds; /* 28 */
	jint                                                         objectTablePos; /* 32 */
	REFARRAY                                                     objectTable; /* 36 */
	jint                                                         charPos; /* 40 */
	CHARARRAY                                                    characters; /* 44 */
	BYTEARRAY                                                    resolveFlags; /* 48 */
	REFARRAY                                                     utf8Data; /* 52 */
	INTARRAY                                                     utf8Info; /* 56 */
	jint                                                         typeId; /* 60 */
	jint                                                         arrayLevel; /* 64 */
	jint                                                         typeStart; /* 68 */
	jint                                                         lastSlash; /* 72 */
	jint                                                         typeEnd; /* 76 */
}; /* 80 bytes */

struct INSTANCE_com_jbed_tbcc_Reader_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	BYTEARRAY                                                    data; /* 12 */
	jint                                                         offset; /* 16 */
	jint                                                         bytesLeft; /* 20 */
	CHARARRAY                                                    map; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_tbcc_VerifierUtil_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_reflect_DynamicMethod_s *           actMethod; /* 12 */
	BYTEARRAY                                                    actBC; /* 16 */
	struct INSTANCE_com_jbed_tbcc_Pool_s *                       actPool; /* 20 */
	jint                                                         actRetType; /* 24 */
	INTARRAY                                                     stack; /* 28 */
	jint                                                         sp; /* 32 */
	INTARRAY                                                     locals; /* 36 */
	jint                                                         frameSize; /* 40 */
	INTARRAY                                                     newInstr; /* 44 */
	jboolean                                                     vNeedInitialization; /* 48 */
	jboolean                                                     setsSlot0; /* 49 */
	char pad50[2]; /* pad to offset 52 */
	jint                                                         actType; /* 52 */
	jint                                                         calleeContext; /* 56 */
	jint                                                         calleeRetTyp; /* 60 */
	jboolean                                                     initPresent; /* 64 */
	char pad65[3]; /* pad to offset 68 */
	INTARRAY                                                     localCount; /* 68 */
	BOOLEANARRAY                                                 targetUsed; /* 72 */
	jint                                                         inc; /* 76 */
	struct INSTANCE_com_jbed_reflect_ClassAccess_s *             classes; /* 80 */
	struct INSTANCE_com_jbed_reflect_SignatureEncoder_s *        sigEnc; /* 84 */
}; /* 88 bytes */

struct INSTANCE_com_jbed_tbcc_Writer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         addr; /* 12 */
	BYTEARRAY                                                    data; /* 16 */
	jint                                                         limit; /* 20 */
	struct INSTANCE_java_lang_Object_s *                         obj; /* 24 */
	INTARRAY                                                     labels; /* 28 */
	jint                                                         numLabels; /* 32 */
	struct INSTANCE_com_jbed_tbcc_Writer_00024StackMapArray_s *  sma; /* 36 */
	jboolean                                                     writingMaps; /* 40 */
	char pad41[3]; /* pad to offset 44 */
}; /* 44 bytes */

struct INSTANCE_com_jbed_tbcc_Writer_00024StackMapArray_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	INTARRAY                                                     maps; /* 12 */
	INTARRAY                                                     emaps; /* 16 */
	jint                                                         mapIndex; /* 20 */
	jint                                                         emapIndex; /* 24 */
	jint                                                         pcBase; /* 28 */
	jint                                                         pcEnd; /* 32 */
	jint                                                         addr; /* 36 */
	jint                                                         maxMapLength; /* 40 */
	jboolean                                                     endSet; /* 44 */
	char pad45[3]; /* pad to offset 48 */
	jint                                                         maxSize; /* 48 */
	struct INSTANCE_com_jbed_tbcc_Writer_00024StackMapArray_s *  next; /* 52 */
}; /* 56 bytes */

struct INSTANCE_com_jbed_tina_DeviceToolkit_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_tina_Tina_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_tina_DeviceToolkit_s *              dtk; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_tina_event_EventAction_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_tina_event_EventAction_s *          next; /* 12 */
	jint                                                         timeOutAt; /* 16 */
	struct INSTANCE_java_lang_Runnable_s *                       todo; /* 20 */
	jint                                                         period; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_tina_event_EventConsumer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     doPulse; /* 12 */
	char pad13[3]; /* pad to offset 16 */
	struct INSTANCE_com_jbed_runtime_SignalQueue_s *             queue; /* 16 */
	jint                                                         eventQueueId; /* 20 */
	struct INSTANCE_com_jbed_tina_event_EventAction_s *          head; /* 24 */
	jboolean                                                     current; /* 28 */
	jboolean                                                     exit; /* 29 */
	char pad30[2]; /* pad to offset 32 */
	jint                                                         sleepFor; /* 32 */
	jint                                                         nextAction; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_tina_event_EventSystem_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_runtime_Isolate_s *                 currentConsumer; /* 12 */
	jint                                                         currentConsumerQueueId; /* 16 */
	struct INSTANCE_com_jbed_runtime_SignalQueue_s *             queue; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_tina_media_MediaSpecificObject_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              _mimeType; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_tina_media_MediaSystem_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_tina_media_MediaSystem_00024MediaCallHandlerListener_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_tina_media_MediaSystem_00024SingleToneListener_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_tina_media_clip_ClipMetaDataItem_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         _key; /* 12 */
	STRING_INSTANCE                                              _otherKey; /* 16 */
	STRING_INSTANCE                                              _value; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_tina_media_clip_CoreToneSeqClip_00024SeqMacro_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         start; /* 12 */
	jint                                                         dur; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_tina_media_clip_LocatorClipHelper_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              _locator; /* 12 */
	struct INSTANCE_java_io_InputStream_s *                      _stream; /* 16 */
	jint                                                         _length; /* 20 */
	jlong                                                        _currentPos; /* 24 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_tina_media_clip_MidiTrack_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         _curEvtTick; /* 12 */
	jint                                                         _curEvt; /* 16 */
	jint                                                         _curRunningState; /* 20 */
	jboolean                                                     _gotSequenceName; /* 24 */
	char pad25[3]; /* pad to offset 28 */
	jint                                                         _durationMs; /* 28 */
	jint                                                         _trackLen; /* 32 */
	jint                                                         _trackNum; /* 36 */
	BYTEARRAY                                                    _trackBytes; /* 40 */
	jint                                                         _trackOffs; /* 44 */
	struct INSTANCE_com_jbed_tina_media_clip_ParsingMidiClip_s *  _clip; /* 48 */
}; /* 52 bytes */

struct INSTANCE_com_jbed_tina_media_clip_ToneSeqNote_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         note; /* 12 */
	jint                                                         dur; /* 16 */
	jint                                                         vol; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_tina_media_player_CoreStreamPlayer_00024DataSender_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     stopThread; /* 12 */
	jboolean                                                     sendingData; /* 13 */
	jboolean                                                     errOnDataSending; /* 14 */
	jboolean                                                     errOnDataRead; /* 15 */
	struct INSTANCE_java_lang_Thread_s *                         transferThread; /* 16 */
	jboolean                                                     inputReset; /* 20 */
	char pad21[3]; /* pad to offset 24 */
	BYTEARRAY                                                    dataBuffer; /* 24 */
	jint                                                         bytesInBuffer; /* 28 */
	jboolean                                                     allDataHasBeenSent; /* 32 */
	char pad33[3]; /* pad to offset 36 */
	struct INSTANCE_com_jbed_tina_media_player_CoreStreamPlayer_00024DrainWaiter_s *  waiter; /* 36 */
	struct INSTANCE_com_jbed_tina_media_player_CoreStreamPlayer_s *  this_000240; /* 40 */
}; /* 44 bytes */

struct INSTANCE_com_jbed_tina_media_player_CoreStreamPlayer_00024DrainWaiter_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     awaitingDrain; /* 12 */
	char pad13[3]; /* pad to offset 16 */
	struct INSTANCE_java_lang_Thread_s *                         awaitingDrainThread; /* 16 */
	jboolean                                                     endAwaitingDrain; /* 20 */
	char pad21[3]; /* pad to offset 24 */
	struct INSTANCE_com_jbed_tina_media_player_CoreStreamPlayer_s *  this_000240; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_tina_media_player_NativePlayer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         _nativeTypeId; /* 12 */
	struct INSTANCE_com_jbed_tina_media_MediaPlayer_s *          _parent; /* 16 */
	jint                                                         _nativeInstance; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_tina_media_player_NativeRecordingSupport_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_tina_media_player_NativeVideoMpegSupport_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_tina_media_player_ProxyMediaPlayer_00024ProxyListener_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_tina_media_player_ProxyMediaPlayer_s *  _parent; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_tina_misc_OplPhoneSystem_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_util_ArrayOps_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_util_CallContext_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_runtime_Isolate_s *                 caller; /* 12 */
	jint                                                         payload; /* 16 */
	struct INSTANCE_java_lang_Object_s *                         objPayload; /* 20 */
	jboolean                                                     isCall; /* 24 */
	char pad25[3]; /* pad to offset 28 */
	struct INSTANCE_com_jbed_runtime_GlobalCallHandler_s *       handler; /* 28 */
	jint                                                         callerIdx; /* 32 */
}; /* 36 bytes */

#ifndef _JBED_INSTANCE_com_jbed_util_CallHandler_s_H_
#define _JBED_INSTANCE_com_jbed_util_CallHandler_s_H_
struct INSTANCE_com_jbed_util_CallHandler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	REFARRAY                                                     listeners; /* 12 */
	REFARRAY                                                     handlers; /* 16 */
	jint                                                         listenerCount; /* 20 */
	REFARRAY                                                     queue; /* 24 */
	jint                                                         queueIn; /* 28 */
	jint                                                         queueOut; /* 32 */
	struct INSTANCE_com_jbed_runtime_Signal_s *                  sig; /* 36 */
	jboolean                                                     waiting; /* 40 */
	char pad41[3]; /* pad to offset 44 */
	struct INSTANCE_java_lang_Thread_s *                         myThread; /* 44 */
	jboolean                                                     keepRunning; /* 48 */
	char pad49[3]; /* pad to offset 52 */
}; /* 52 bytes */
#endif /* _JBED_INSTANCE_com_jbed_util_CallHandler_s_H_ */

struct INSTANCE_com_jbed_util_CallHandlerIds_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_util_CharacterUtil_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_util_FastHashtable_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	REFARRAY                                                     table; /* 12 */
	jint                                                         count; /* 16 */
	jint                                                         threshold; /* 20 */
	jint                                                         hashshift; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_util_FastHashtable_00024ValueEnumerator_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         index; /* 12 */
	REFARRAY                                                     table; /* 16 */
	struct INSTANCE_com_jbed_util_IntHashtableEntry_s *          entry; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_util_FastVector_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         increment; /* 12 */
	jint                                                         count; /* 16 */
	REFARRAY                                                     elements; /* 20 */
	jint                                                         enumpos; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_util_I18N_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_util_IntHashtableEntry_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         key; /* 12 */
	struct INSTANCE_java_lang_Object_s *                         value; /* 16 */
	struct INSTANCE_com_jbed_util_IntHashtableEntry_s *          next; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_util_MidiGenerator_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         _numTracks; /* 12 */
	REFARRAY                                                     _trackData; /* 16 */
	INTARRAY                                                     _count; /* 20 */
	INTARRAY                                                     _deltaTime; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_util_Properties_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_util_Vector_s *                         keys; /* 12 */
	struct INSTANCE_java_util_Vector_s *                         vals; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_util_Sort_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_util_StopWatch_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_util_StringOps_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_util_URIUtil_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_util_UpcallHandler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_util_WeakReferenceVector_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_util_Vector_s *                         refVector; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_util_ZipEntry_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              name; /* 12 */
	jint                                                         length; /* 16 */
	jint                                                         addr; /* 20 */
	jboolean                                                     discard; /* 24 */
	char pad25[3]; /* pad to offset 28 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_util_ZipFile_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_wma_config_ConfigBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_ms_fs_ThumbnailManager_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_ms_ime_InlineEditorDictionaryImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_ms_ime_InlineEditorImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         ctrlId; /* 12 */
	jboolean                                                     bVisible; /* 16 */
	char pad17[3]; /* pad to offset 20 */
	struct INSTANCE_com_ms_ime_InlineEditorEventListener_s *     listener; /* 20 */
	STRING_INSTANCE                                              textContent; /* 24 */
	jboolean                                                     textChanged; /* 28 */
	char pad29[3]; /* pad to offset 32 */
	struct INSTANCE_javax_microedition_lcdui_Font_s *            font; /* 32 */
	jint                                                         inputCapability; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_ms_ime_InlineEditorManager_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_ms_ime_InlineEditorManager_00024InlineEditorCallHandlerListener_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_ms_service_msa_MSAManager_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_ms_service_msa_MSAManagerImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_ms_service_msa_MSAManagerImpl_00024MSACallHandlerListener_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_ms_service_msa_MSAUserInfo_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              id; /* 12 */
	STRING_INSTANCE                                              name; /* 16 */
	STRING_INSTANCE                                              email; /* 20 */
}; /* 40 bytes */

struct INSTANCE_com_ms_service_wns_WNSChannelImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              channelUri; /* 12 */
	STRING_INSTANCE                                              channelExpireTime; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_ms_service_wns_WNSManager_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_ms_service_wns_WNSNotificationMessageImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              time; /* 12 */
	jint                                                         notificationType; /* 16 */
	BYTEARRAY                                                    contents; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_ms_text_Text_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_nokia_mid_sound_Sound_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	BYTEARRAY                                                    _audioData; /* 12 */
	jboolean                                                     _audioInit; /* 16 */
	char pad17[3]; /* pad to offset 20 */
	STRING_INSTANCE                                              _currentType; /* 20 */
	jboolean                                                     _hasFrequencyOff; /* 24 */
	char pad25[3]; /* pad to offset 28 */
	jint                                                         _originalType; /* 28 */
	jint                                                         _currentLoop; /* 32 */
	struct INSTANCE_javax_microedition_media_Player_s *          _player; /* 36 */
	struct INSTANCE_com_jbed_nokia_NokiaPlayerListener_s *       _nokiaPlayerListener; /* 40 */
	struct INSTANCE_com_jbed_nokia_NokiaToneToMidi_s *           _nokiaToneToMidi; /* 44 */
	jint                                                         _currentGain; /* 48 */
}; /* 52 bytes */

struct INSTANCE_com_nokia_mid_ui_DeviceControl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_nokia_mid_ui_DirectUtils_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_sun_cldc_io_DateParser_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         year; /* 12 */
	jint                                                         month; /* 16 */
	jint                                                         day; /* 20 */
	jint                                                         hour; /* 24 */
	jint                                                         minute; /* 28 */
	jint                                                         second; /* 32 */
	jint                                                         milli; /* 36 */
	jint                                                         tzoffset; /* 40 */
}; /* 44 bytes */

struct INSTANCE_com_sun_cldc_io_GeneralBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_sun_midp_Configuration_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_sun_midp_io_Base64_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_sun_midp_io_HttpUrl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              scheme; /* 12 */
	STRING_INSTANCE                                              authority; /* 16 */
	STRING_INSTANCE                                              path; /* 20 */
	STRING_INSTANCE                                              query; /* 24 */
	STRING_INSTANCE                                              fragment; /* 28 */
	STRING_INSTANCE                                              host; /* 32 */
	jint                                                         port; /* 36 */
	STRING_INSTANCE                                              domain; /* 40 */
}; /* 44 bytes */

struct INSTANCE_com_sun_midp_lcdui_DeviceCaps_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         width; /* 12 */
	jint                                                         height; /* 16 */
	jint                                                         fullscreenWidth; /* 20 */
	jint                                                         fullscreenHeight; /* 24 */
	jint                                                         numAlphaLevels; /* 28 */
	jint                                                         eraseColor; /* 32 */
	jint                                                         displayDepth; /* 36 */
	jboolean                                                     displayIsColor; /* 40 */
	jboolean                                                     pointerSupported; /* 41 */
	jboolean                                                     motionSupported; /* 42 */
	jboolean                                                     repeatSupported; /* 43 */
	jboolean                                                     isDoubleBuffered; /* 44 */
	char pad45[3]; /* pad to offset 48 */
}; /* 48 bytes */

struct INSTANCE_iaik_me_asn1_ASN1_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         type; /* 12 */
	struct INSTANCE_java_lang_Object_s *                         value; /* 16 */
	BYTEARRAY                                                    encoding; /* 20 */
	jboolean                                                     constructed; /* 24 */
	jboolean                                                     expectImplicit; /* 25 */
	char pad26[2]; /* pad to offset 28 */
	jint                                                         saveEncoding; /* 28 */
	jboolean                                                     implicit; /* 32 */
	char pad33[3]; /* pad to offset 36 */
}; /* 36 bytes */

struct INSTANCE_iaik_me_asn1_Name_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_iaik_me_asn1_ASN1_s *                        asn1; /* 12 */
	BYTEARRAY                                                    encoded; /* 16 */
	jint                                                         hashCode; /* 20 */
}; /* 24 bytes */

struct INSTANCE_iaik_me_keymgmt_KeyAndCert_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_iaik_me_security_BigInteger_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	INTARRAY                                                     digits; /* 12 */
	jint                                                         hashCode; /* 16 */
}; /* 20 bytes */

struct INSTANCE_iaik_me_security_Cipher_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              algorithm; /* 12 */
	jint                                                         blockSize; /* 16 */
	jint                                                         mode; /* 20 */
	BYTEARRAY                                                    iv; /* 24 */
	jint                                                         chainingMode; /* 28 */
	jint                                                         pad; /* 32 */
	BYTEARRAY                                                    buffer; /* 36 */
	jint                                                         bufferUsed; /* 40 */
}; /* 44 bytes */

struct INSTANCE_iaik_me_security_CryptoBag_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         type; /* 12 */
	REFARRAY                                                     values; /* 16 */
}; /* 20 bytes */

struct INSTANCE_iaik_me_security_MBigInteger_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	INTARRAY                                                     digits; /* 12 */
	jint                                                         len; /* 16 */
	jint                                                         signum; /* 20 */
}; /* 24 bytes */

struct INSTANCE_iaik_me_security_Mac_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         B; /* 12 */
	BYTEARRAY                                                    K; /* 16 */
	struct INSTANCE_iaik_me_security_MessageDigest_s *           md; /* 20 */
	BYTEARRAY                                                    ipad; /* 24 */
	BYTEARRAY                                                    opad; /* 28 */
	jint                                                         digestLength; /* 32 */
	BYTEARRAY                                                    oneByte; /* 36 */
}; /* 40 bytes */

struct INSTANCE_iaik_me_security_MessageDigest_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              algorithm; /* 12 */
	jint                                                         digestLength; /* 16 */
	jint                                                         blockSize; /* 20 */
	BYTEARRAY                                                    oneByte; /* 24 */
	BYTEARRAY                                                    buffer; /* 28 */
	jlong                                                        count; /* 32 */
}; /* 40 bytes */

struct INSTANCE_iaik_me_security_SecureRandom_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_iaik_me_security_MessageDigest_s *           digest; /* 12 */
	BYTEARRAY                                                    seed; /* 16 */
	BYTEARRAY                                                    count; /* 20 */
	jint                                                         available; /* 24 */
	BYTEARRAY                                                    store; /* 28 */
}; /* 32 bytes */

struct INSTANCE_iaik_me_security_Signature_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              algorithm; /* 12 */
	struct INSTANCE_iaik_me_security_MessageDigest_s *           md; /* 16 */
}; /* 20 bytes */

struct INSTANCE_iaik_me_security_md_sha256_GeneralDigest_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	BYTEARRAY                                                    xBuf; /* 12 */
	jint                                                         xBufOff; /* 16 */
	char pad20[4]; /* pad to offset 24 */
	jlong                                                        byteCount; /* 24 */
}; /* 32 bytes */

struct INSTANCE_iaik_me_security_ssl_ChainVerifier_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_util_Hashtable_s *                      trustedCerts; /* 12 */
	struct INSTANCE_java_util_Hashtable_s *                      cachedCerts; /* 16 */
	jboolean                                                     checkServerName; /* 20 */
	jboolean                                                     mapCrossCertificates; /* 21 */
	char pad22[2]; /* pad to offset 24 */
}; /* 24 bytes */

struct INSTANCE_iaik_me_security_ssl_CipherSuite_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              cipher_suite_name; /* 12 */
	jint                                                         keySizeLimit; /* 16 */
	STRING_INSTANCE                                              key_exchange_algorithm; /* 20 */
	STRING_INSTANCE                                              cipher_algorithm; /* 24 */
	STRING_INSTANCE                                              hash_algorithm; /* 28 */
	jint                                                         id; /* 32 */
	jint                                                         key_material; /* 36 */
	jint                                                         expanded_key_material; /* 40 */
	jint                                                         IV_size; /* 44 */
}; /* 48 bytes */

struct INSTANCE_iaik_me_security_ssl_CipherSuiteList_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_util_Vector_s *                         cipherSuites; /* 12 */
}; /* 16 bytes */

struct INSTANCE_iaik_me_security_ssl_Handshaker_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     resumeSession; /* 12 */
	char pad13[3]; /* pad to offset 16 */
	struct INSTANCE_iaik_me_security_PublicKey_s *               publicKey; /* 16 */
	struct INSTANCE_iaik_me_security_ssl_SSLTransport_s *        transport; /* 20 */
	struct INSTANCE_iaik_me_security_ssl_Session_s *             session; /* 24 */
	struct INSTANCE_iaik_me_security_ssl_InputRecord_s *         inputRecord; /* 28 */
	struct INSTANCE_iaik_me_security_ssl_OutputRecord_s *        outputRecord; /* 32 */
	struct INSTANCE_iaik_me_security_MessageDigest_s *           md5Hash; /* 36 */
	struct INSTANCE_iaik_me_security_MessageDigest_s *           shaHash; /* 40 */
	struct INSTANCE_iaik_me_security_MessageDigest_s *           md5HashTmp; /* 44 */
	struct INSTANCE_iaik_me_security_MessageDigest_s *           shaHashTmp; /* 48 */
	jint                                                         activeVersion; /* 52 */
	struct INSTANCE_iaik_me_security_ssl_CipherSuite_s *         cipher_suite; /* 56 */
	STRING_INSTANCE                                              key_exchange_algorithm; /* 60 */
	struct INSTANCE_iaik_me_security_ssl_SSLContext_s *          context; /* 64 */
	struct INSTANCE_iaik_me_security_Cipher_s *                  read_cipher; /* 68 */
	struct INSTANCE_iaik_me_security_Cipher_s *                  write_cipher; /* 72 */
	struct INSTANCE_iaik_me_security_ssl_MAC_s *                 read_MAC; /* 76 */
	struct INSTANCE_iaik_me_security_ssl_MAC_s *                 write_MAC; /* 80 */
	BYTEARRAY                                                    client; /* 84 */
	BYTEARRAY                                                    server; /* 88 */
	BYTEARRAY                                                    client_hello_random; /* 92 */
	BYTEARRAY                                                    server_hello_random; /* 96 */
	BYTEARRAY                                                    master_secret; /* 100 */
	jint                                                         receivedCertificate; /* 104 */
	jint                                                         receivedServerKeyExchange; /* 108 */
	jint                                                         receivedCertificateRequest; /* 112 */
	jint                                                         algKeyEx; /* 116 */
	jint                                                         algAuth; /* 120 */
	REFARRAY                                                     serverAcceptedCAs; /* 124 */
	BYTEARRAY                                                    serverAcceptedCertificateTypes; /* 128 */
}; /* 132 bytes */

struct INSTANCE_iaik_me_security_ssl_MAC_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         activeVersion; /* 12 */
	BYTEARRAY                                                    write_MAC_secret; /* 16 */
	BYTEARRAY                                                    sequenceNumber; /* 20 */
	BYTEARRAY                                                    pad_1; /* 24 */
	BYTEARRAY                                                    pad_2; /* 28 */
	jint                                                         hash_size; /* 32 */
	struct INSTANCE_iaik_me_security_MessageDigest_s *           md; /* 36 */
	struct INSTANCE_iaik_me_security_Mac_s *                     hmac; /* 40 */
}; /* 44 bytes */

struct INSTANCE_iaik_me_security_ssl_SSLContext_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_iaik_me_security_ssl_CipherSuiteList_s *     enabled_cipher_suites; /* 12 */
	struct INSTANCE_iaik_me_security_ssl_SessionManager_s *      session_manager; /* 16 */
	struct INSTANCE_iaik_me_security_SecureRandom_s *            random_generator; /* 20 */
	jboolean                                                     cacheTerminatedSessions; /* 24 */
	char pad25[3]; /* pad to offset 28 */
	INTARRAY                                                     allowedVersions; /* 28 */
	struct INSTANCE_iaik_me_security_ssl_ChainVerifier_s *       chainVerifier; /* 32 */
	struct INSTANCE_java_util_Vector_s *                         credentials; /* 36 */
}; /* 40 bytes */

struct INSTANCE_iaik_me_security_ssl_SSLMessage_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_iaik_me_security_ssl_SSLTransport_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         state; /* 12 */
	struct INSTANCE_java_io_Writer_s *                           debug_writer; /* 16 */
	jboolean                                                     auto_handshake; /* 20 */
	char pad21[3]; /* pad to offset 24 */
	struct INSTANCE_iaik_me_security_ssl_SSLContext_s *          ssl_context; /* 24 */
	struct INSTANCE_iaik_me_security_ssl_SSLTransportSpi_s *     transportSpi; /* 28 */
	struct INSTANCE_iaik_me_security_ssl_Handshaker_s *          handshaker; /* 32 */
	struct INSTANCE_iaik_me_security_ssl_OutputRecord_s *        output_record; /* 36 */
	struct INSTANCE_iaik_me_security_ssl_InputRecord_s *         input_record; /* 40 */
	struct INSTANCE_iaik_me_security_ssl_SSLOutputStream_s *     output_stream; /* 44 */
	struct INSTANCE_iaik_me_security_ssl_SSLInputStream_s *      input_stream; /* 48 */
	struct INSTANCE_iaik_me_security_ssl_Session_s *             session; /* 52 */
	REFARRAY                                                     peer_certificate; /* 56 */
	STRING_INSTANCE                                              UID; /* 60 */
	jboolean                                                     copen; /* 64 */
	char pad65[3]; /* pad to offset 68 */
	jint                                                         inputStreamState; /* 68 */
	jint                                                         outputStreamState; /* 72 */
}; /* 76 bytes */

struct INSTANCE_iaik_me_security_ssl_SSLTransportSpi_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_iaik_me_security_ssl_SSLContext_s *          context; /* 12 */
}; /* 16 bytes */

struct INSTANCE_iaik_me_security_ssl_SecurityProvider_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_iaik_me_security_ssl_Session_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_iaik_me_security_ssl_CipherSuite_s *         cipher_suite; /* 12 */
	struct INSTANCE_iaik_me_security_ssl_SessionID_s *           session_id; /* 16 */
	REFARRAY                                                     peer_certificate; /* 20 */
	BYTEARRAY                                                    master_secret; /* 24 */
	jint                                                         version; /* 28 */
	jboolean                                                     is_resumable; /* 32 */
	char pad33[7]; /* pad to offset 40 */
	jlong                                                        creation_time; /* 40 */
}; /* 48 bytes */

struct INSTANCE_iaik_me_security_ssl_SessionID_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	BYTEARRAY                                                    sessionId; /* 12 */
}; /* 16 bytes */

struct INSTANCE_iaik_me_security_ssl_SessionManager_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	char pad12[4]; /* pad to offset 16 */
	jlong                                                        lastExpunge; /* 16 */
	struct INSTANCE_java_util_Hashtable_s *                      activeSessions; /* 24 */
	char pad28[4]; /* pad to offset 32 */
	jlong                                                        resumePeriod; /* 32 */
}; /* 40 bytes */

struct INSTANCE_iaik_me_security_ssl_Utils_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_iaik_me_utils_Base64_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_iaik_me_utils_CryptoUtils_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_iaik_me_utils_SimpleStringTokenizer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              s; /* 12 */
	struct INSTANCE_java_lang_StringBuffer_s *                   sb; /* 16 */
	jchar                                                        delimiter; /* 20 */
	char pad22[2]; /* pad to offset 24 */
	jint                                                         pos; /* 24 */
	jint                                                         n; /* 28 */
}; /* 32 bytes */

struct INSTANCE_iaik_me_utils_SysUtil_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_iaik_me_utils_Util_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_iaik_me_x509_X509Certificate_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         version; /* 12 */
	struct INSTANCE_iaik_me_security_BigInteger_s *              serialNumber; /* 16 */
	STRING_INSTANCE                                              algorithmId; /* 20 */
	struct INSTANCE_iaik_me_security_PublicKey_s *               publicKey; /* 24 */
	struct INSTANCE_iaik_me_asn1_Name_s *                        subject; /* 28 */
	struct INSTANCE_iaik_me_asn1_Name_s *                        issuer; /* 32 */
	jint                                                         hashCode; /* 36 */
	struct INSTANCE_java_util_Date_s *                           notBefore; /* 40 */
	struct INSTANCE_java_util_Date_s *                           notAfter; /* 44 */
	struct INSTANCE_java_util_Vector_s *                         extensions; /* 48 */
	BYTEARRAY                                                    encoded; /* 52 */
	jint                                                         tbsStart; /* 56 */
	jint                                                         tbsLength; /* 60 */
	STRING_INSTANCE                                              signatureAlgorithm; /* 64 */
	BYTEARRAY                                                    signature; /* 68 */
	struct INSTANCE_iaik_me_asn1_ASN1_s *                        asn1Key; /* 72 */
}; /* 76 bytes */

struct INSTANCE_iaik_me_x509_X509Extension_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              oid; /* 12 */
	jint                                                         id; /* 16 */
	jboolean                                                     critical; /* 20 */
	char pad21[3]; /* pad to offset 24 */
	REFARRAY                                                     values; /* 24 */
	struct INSTANCE_com_jbed_security_CertGeneralName_s *        subAltNames; /* 28 */
}; /* 32 bytes */

struct INSTANCE_java_io_InputStream_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_java_io_OutputStream_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_java_io_Reader_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         lock; /* 12 */
	CHARARRAY                                                    skipBuffer; /* 16 */
}; /* 20 bytes */

struct INSTANCE_java_io_Writer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	CHARARRAY                                                    writeBuffer; /* 12 */
	struct INSTANCE_java_lang_Object_s *                         lock; /* 16 */
}; /* 20 bytes */

struct INSTANCE_java_lang_Boolean_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     value; /* 12 */
	char pad13[3]; /* pad to offset 16 */
}; /* 16 bytes */

struct INSTANCE_java_lang_Byte_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jbyte                                                        value; /* 12 */
	char pad13[3]; /* pad to offset 16 */
}; /* 16 bytes */

struct INSTANCE_java_lang_Character_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jchar                                                        value; /* 12 */
	char pad14[2]; /* pad to offset 16 */
}; /* 16 bytes */

struct INSTANCE_java_lang_Double_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	char pad12[4]; /* pad to offset 16 */
	jdouble                                                      value; /* 16 */
}; /* 24 bytes */

struct INSTANCE_java_lang_Float_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jfloat                                                       value; /* 12 */
}; /* 16 bytes */

struct INSTANCE_java_lang_Integer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         value; /* 12 */
}; /* 16 bytes */

struct INSTANCE_java_lang_Long_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	char pad12[4]; /* pad to offset 16 */
	jlong                                                        value; /* 16 */
}; /* 24 bytes */

struct INSTANCE_java_lang_Math_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_java_lang_Runtime_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_java_lang_Short_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jshort                                                       value; /* 12 */
	char pad14[2]; /* pad to offset 16 */
}; /* 16 bytes */

struct INSTANCE_java_lang_StringBuffer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	CHARARRAY                                                    value; /* 12 */
	jint                                                         count; /* 16 */
	jint                                                         sharedSize; /* 20 */
}; /* 24 bytes */

struct INSTANCE_java_lang_System_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_java_lang_Thread_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_runtime_Scheduled_s *               sched; /* 12 */
	struct INSTANCE_java_lang_Runnable_s *                       target; /* 16 */
}; /* 20 bytes */

struct INSTANCE_java_lang_ref_Reference_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         referent; /* 12 */
	struct INSTANCE_java_lang_ref_Reference_s *                  next; /* 16 */
	jint                                                         refPointer; /* 20 */
	jint                                                         nextPointer; /* 24 */
	jint                                                         ttl; /* 28 */
}; /* 32 bytes */

struct INSTANCE_java_util_Calendar_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	char pad12[4]; /* pad to offset 16 */
	jlong                                                        time; /* 16 */
	INTARRAY                                                     fields; /* 24 */
	BOOLEANARRAY                                                 isSet; /* 28 */
	jboolean                                                     timeValid; /* 32 */
	jboolean                                                     fieldsValid; /* 33 */
	char pad34[2]; /* pad to offset 36 */
	struct INSTANCE_java_util_TimeZone_s *                       zone; /* 36 */
}; /* 40 bytes */

struct INSTANCE_java_util_Date_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	char pad12[4]; /* pad to offset 16 */
	jlong                                                        millis; /* 16 */
}; /* 24 bytes */

struct INSTANCE_java_util_Hashtable_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	REFARRAY                                                     table; /* 12 */
	jint                                                         count; /* 16 */
	jint                                                         threshold; /* 20 */
	jint                                                         hashshift; /* 24 */
}; /* 28 bytes */

struct INSTANCE_java_util_Hashtable_00024Enumerator_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     keys; /* 12 */
	char pad13[3]; /* pad to offset 16 */
	jint                                                         index; /* 16 */
	REFARRAY                                                     table; /* 20 */
	struct INSTANCE_java_util_HashtableEntry_s *                 entry; /* 24 */
}; /* 28 bytes */

struct INSTANCE_java_util_HashtableEntry_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         hash; /* 12 */
	struct INSTANCE_java_lang_Object_s *                         key; /* 16 */
	struct INSTANCE_java_lang_Object_s *                         value; /* 20 */
	struct INSTANCE_java_util_HashtableEntry_s *                 next; /* 24 */
}; /* 28 bytes */

struct INSTANCE_java_util_Random_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	char pad12[4]; /* pad to offset 16 */
	jlong                                                        seed; /* 16 */
}; /* 24 bytes */

struct INSTANCE_java_util_TimeZone_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_java_util_Timer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_util_Timer_00024TimerWorker_s *         worker; /* 12 */
}; /* 16 bytes */

struct INSTANCE_java_util_TimerTask_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         mutex; /* 12 */
	jboolean                                                     scheduled; /* 16 */
	jboolean                                                     stopped; /* 17 */
	char pad18[6]; /* pad to offset 24 */
	jlong                                                        sched_time; /* 24 */
	jlong                                                        repeat_time; /* 32 */
	jlong                                                        last_sched_time; /* 40 */
	jboolean                                                     fixed_rate; /* 48 */
	char pad49[3]; /* pad to offset 52 */
	struct INSTANCE_java_util_TimerTask_s *                      next; /* 52 */
}; /* 56 bytes */

struct INSTANCE_java_util_Vector_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	REFARRAY                                                     elementData; /* 12 */
	jint                                                         elementCount; /* 16 */
	jint                                                         capacityIncrement; /* 20 */
}; /* 24 bytes */

struct INSTANCE_java_util_VectorEnumerator_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_util_Vector_s *                         vector; /* 12 */
	jint                                                         count; /* 16 */
}; /* 20 bytes */

struct INSTANCE_javax_microedition_io_Connector_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_io_HttpProtocolBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              http_proxy; /* 12 */
	STRING_INSTANCE                                              http_proxy_login; /* 16 */
	STRING_INSTANCE                                              http_proxy_password; /* 20 */
	jboolean                                                     isHttpTunneling; /* 24 */
	jboolean                                                     connectionOpen; /* 25 */
	char pad26[2]; /* pad to offset 28 */
	struct INSTANCE_javax_microedition_io_HttpProtocolBase_00024BaseInputStream_s *  iStream; /* 28 */
	struct INSTANCE_javax_microedition_io_HttpProtocolBase_00024BaseOutputStream_s *  oStream; /* 32 */
	jboolean                                                     isOpened; /* 36 */
	jboolean                                                     osOpened; /* 37 */
	char pad38[2]; /* pad to offset 40 */
	STRING_INSTANCE                                              protocol; /* 40 */
	STRING_INSTANCE                                              saved_url; /* 44 */
	jint                                                         default_port; /* 48 */
	struct INSTANCE_com_sun_midp_io_HttpUrl_s *                  url; /* 52 */
	STRING_INSTANCE                                              hostAndPort; /* 56 */
	jint                                                         responseCode; /* 60 */
	STRING_INSTANCE                                              responseMsg; /* 64 */
	struct INSTANCE_com_jbed_util_Properties_s *                 reqProperties; /* 68 */
	struct INSTANCE_com_jbed_util_Properties_s *                 headerFields; /* 72 */
	struct INSTANCE_com_jbed_util_Properties_s *                 proxyHeaders; /* 76 */
	STRING_INSTANCE                                              method; /* 80 */
	struct INSTANCE_javax_microedition_io_StreamConnection_s *   streamConnection; /* 84 */
	struct INSTANCE_java_io_DataOutputStream_s *                 streamOutput; /* 88 */
	struct INSTANCE_java_io_DataInputStream_s *                  streamInput; /* 92 */
	struct INSTANCE_java_lang_StringBuffer_s *                   stringbuffer; /* 96 */
	STRING_INSTANCE                                              httpVer; /* 100 */
	jboolean                                                     ConnectionCloseFlag; /* 104 */
	char pad105[3]; /* pad to offset 108 */
	jint                                                         contentLength; /* 108 */
	jint                                                         chunksize; /* 112 */
	jint                                                         totalbytesread; /* 116 */
	jboolean                                                     chunkedIn; /* 120 */
	jboolean                                                     chunkedOut; /* 121 */
	jboolean                                                     firstChunkSent; /* 122 */
	jboolean                                                     sendingRequest; /* 123 */
	jboolean                                                     requestFinished; /* 124 */
	jboolean                                                     eof; /* 125 */
	char pad126[2]; /* pad to offset 128 */
	BYTEARRAY                                                    readbuf; /* 128 */
	jint                                                         bytesleft; /* 132 */
	jint                                                         bytesread; /* 136 */
	BYTEARRAY                                                    writebuf; /* 140 */
	jint                                                         bytesToWrite; /* 144 */
	jboolean                                                     readInProgress; /* 148 */
	char pad149[3]; /* pad to offset 152 */
}; /* 152 bytes */

struct INSTANCE_javax_microedition_io_PackageAccess_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_io_ProtocolRegistry_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_io_PushRegistry_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_io_SmsMessage_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              address; /* 12 */
	STRING_INSTANCE                                              msisdn; /* 16 */
	jint                                                         port; /* 20 */
	jlong                                                        timestamp; /* 24 */
}; /* 32 bytes */

struct INSTANCE_javax_microedition_io_StreamConnectionElement_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              m_protocol; /* 12 */
	STRING_INSTANCE                                              m_host; /* 16 */
	jint                                                         m_port; /* 20 */
	struct INSTANCE_javax_microedition_io_StreamConnection_s *   m_stream; /* 24 */
	struct INSTANCE_java_io_DataInputStream_s *                  m_data_input_stream; /* 28 */
	struct INSTANCE_java_io_DataOutputStream_s *                 m_data_output_stream; /* 32 */
	jboolean                                                     m_in_use; /* 36 */
	char pad37[3]; /* pad to offset 40 */
	jlong                                                        m_time; /* 40 */
	jboolean                                                     m_removed; /* 48 */
	char pad49[3]; /* pad to offset 52 */
}; /* 52 bytes */

struct INSTANCE_javax_microedition_io_StreamConnectionPool_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	char pad12[4]; /* pad to offset 16 */
	jlong                                                        m_connectionLingerTime; /* 16 */
	struct INSTANCE_java_util_Vector_s *                         m_connections; /* 24 */
	jint                                                         m_max_connections; /* 28 */
}; /* 32 bytes */

struct INSTANCE_javax_microedition_io_file_FileSystemRegistry_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_io_httpsConnectBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_lcdui_Alert_00024AlertCommandListener_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Alert_s *           this_000240; /* 12 */
}; /* 16 bytes */

struct INSTANCE_javax_microedition_lcdui_Alert_00024AlertTimer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Alert_s *           this_000240; /* 12 */
}; /* 16 bytes */

struct INSTANCE_javax_microedition_lcdui_AlertType_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_lcdui_ChoiceModel_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         fType; /* 12 */
	jint                                                         fFitPolicy; /* 16 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fStrings; /* 20 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fImages; /* 24 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fImmutableImages; /* 28 */
	REFARRAY                                                     fFonts; /* 32 */
}; /* 36 bytes */

struct INSTANCE_javax_microedition_lcdui_Command_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              fLabel; /* 12 */
	STRING_INSTANCE                                              fLongLabel; /* 16 */
	jint                                                         fType; /* 20 */
	jint                                                         fPriority; /* 24 */
	struct INSTANCE_java_lang_Object_s *                         fData; /* 28 */
}; /* 32 bytes */

struct INSTANCE_javax_microedition_lcdui_DefaultFormLayoutPolicy_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Form_s *            fForm; /* 12 */
	jint                                                         fLastWidthHint; /* 16 */
	jint                                                         fLastHeightHint; /* 20 */
	jint                                                         fHorizontalSpacing; /* 24 */
	jint                                                         fVerticalSpacing; /* 28 */
	jint                                                         fPaddingTop; /* 32 */
	jint                                                         fPaddingRight; /* 36 */
	jint                                                         fPaddingBottom; /* 40 */
	jint                                                         fPaddingLeft; /* 44 */
}; /* 48 bytes */

struct INSTANCE_javax_microedition_lcdui_DefaultFormLayoutPolicy_00024Row_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         firstIndex; /* 12 */
	jint                                                         firstAlignment; /* 16 */
	jint                                                         expandables; /* 20 */
	jint                                                         reqWidth; /* 24 */
	jint                                                         prfWidth; /* 28 */
	jint                                                         reqHeight; /* 32 */
	jint                                                         prfHeight; /* 36 */
}; /* 40 bytes */

struct INSTANCE_javax_microedition_lcdui_Display_s
{
	/* Type of field "fDeviceCapabilities" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.lookandfeel.DeviceCapabilities;" */
	/* Type of field "fEventLoop" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.lookandfeel.EventLoop;" */
	/* Type of field "fLookAndFeel" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.lookandfeel.LookAndFeel;" */
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         fLookAndFeel; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Graphics_s *        fGraphics; /* 16 */
	struct INSTANCE_java_lang_Object_s *                         fEventLoop; /* 20 */
	struct INSTANCE_com_jbed_midp_midlet_MIDletMap_s *           fMIDletMap; /* 24 */
	struct INSTANCE_java_lang_Object_s *                         fDeviceCapabilities; /* 28 */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_ModelStrategies_s *  fModelStrategies; /* 32 */
	struct INSTANCE_com_jbed_midp_lcdui_model_DisplayListener_s *  fDisplayListener; /* 36 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     fDisplayable; /* 40 */
	struct INSTANCE_com_jbed_midp_lcdui_model_SystemScreen_s *   fForegroundSystemScreen; /* 44 */
	jboolean                                                     fNeedValidation; /* 48 */
	jboolean                                                     fObscured; /* 49 */
	char pad50[2]; /* pad to offset 52 */
	REFARRAY                                                     fBackRunnables; /* 52 */
	jint                                                         fBackLength; /* 56 */
	REFARRAY                                                     fFrontRunnables; /* 60 */
	jint                                                         fFrontLength; /* 64 */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_IndicatorListener_s *  fIndicatorListener; /* 68 */
	struct INSTANCE_com_jbed_microedition_protocol_ProtocolMonitor_s *  fProtocolMonitor; /* 72 */
	struct INSTANCE_javax_microedition_lcdui_Display_00024DisplayRequestHandler_s *  fEventHandler; /* 76 */
	jboolean                                                     fValidateAll; /* 80 */
	char pad81[3]; /* pad to offset 84 */
	struct INSTANCE_javax_microedition_lcdui_Item_s *            fItem; /* 84 */
	struct INSTANCE_java_lang_Object_s *                         fGraphicsLock; /* 88 */
	jint                                                         fWidth; /* 92 */
	jint                                                         fHeight; /* 96 */
	struct INSTANCE_javax_microedition_lcdui_Display_00024ScreenUpdateTask_s *  fRefreshTask; /* 100 */
}; /* 104 bytes */

struct INSTANCE_javax_microedition_lcdui_Display_000241_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         this_000240; /* 12 */
}; /* 16 bytes */

struct INSTANCE_javax_microedition_lcdui_Display_00024DisplayRequestHandler_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     fDisplayableToHide; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     fDisplayableToShow; /* 16 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         fDisplayToShow; /* 20 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     fNextDisplayable; /* 24 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     fNextDisplayableBackup; /* 28 */
	struct INSTANCE_javax_microedition_lcdui_Item_s *            fNextItem; /* 32 */
	struct INSTANCE_com_jbed_midp_lcdui_model_SystemScreen_s *   fNextSystemScreen; /* 36 */
	jboolean                                                     fHasSystemScreenRequest; /* 40 */
	char pad41[3]; /* pad to offset 44 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         this_000240; /* 44 */
}; /* 48 bytes */

struct INSTANCE_javax_microedition_lcdui_Displayable_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         fForegroundDisplay; /* 12 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fCommands; /* 16 */
	struct INSTANCE_javax_microedition_lcdui_CommandListener_s *  fCommandListener; /* 20 */
	struct INSTANCE_javax_microedition_lcdui_Ticker_s *          fTicker; /* 24 */
	STRING_INSTANCE                                              fTitle; /* 28 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_00024DisplayableCommandExListener_s *  fCommandExListener; /* 32 */
	struct INSTANCE_java_lang_Object_s *                         fData; /* 36 */
	jboolean                                                     wasSetCurrent; /* 40 */
	char pad41[3]; /* pad to offset 44 */
	jint                                                         fReportedWidth; /* 44 */
	jint                                                         fReportedHeight; /* 48 */
}; /* 52 bytes */

struct INSTANCE_javax_microedition_lcdui_Displayable_000241_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         val_00024command; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     this_000240; /* 16 */
}; /* 20 bytes */

struct INSTANCE_javax_microedition_lcdui_Displayable_00024DisplayableCommandExListener_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     fDisplayable; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     this_000240; /* 16 */
}; /* 20 bytes */

struct INSTANCE_javax_microedition_lcdui_Font_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         face; /* 12 */
	jint                                                         style; /* 16 */
	jint                                                         size; /* 20 */
	jint                                                         baseline; /* 24 */
	jint                                                         height; /* 28 */
}; /* 32 bytes */

struct INSTANCE_javax_microedition_lcdui_Form_000241_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Item_s *            val_00024item; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Form_s *            this_000240; /* 16 */
}; /* 20 bytes */

struct INSTANCE_javax_microedition_lcdui_Graphics_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jboolean                                                     hardClipModifiable; /* 12 */
	char pad13[3]; /* pad to offset 16 */
	jint                                                         transX; /* 16 */
	jint                                                         transY; /* 20 */
	jint                                                         clipX1; /* 24 */
	jint                                                         clipY1; /* 28 */
	jint                                                         clipX2; /* 32 */
	jint                                                         clipY2; /* 36 */
	jint                                                         prevClipX1; /* 40 */
	jint                                                         prevClipY1; /* 44 */
	jint                                                         prevClipX2; /* 48 */
	jint                                                         prevClipY2; /* 52 */
	jint                                                         hardClipX1; /* 56 */
	jint                                                         hardClipY1; /* 60 */
	jint                                                         hardClipX2; /* 64 */
	jint                                                         hardClipY2; /* 68 */
	jint                                                         argbColor; /* 72 */
	jint                                                         grayRgb; /* 76 */
	jint                                                         gray; /* 80 */
	jint                                                         pixel; /* 84 */
	jint                                                         style; /* 88 */
	struct INSTANCE_javax_microedition_lcdui_Font_s *            currentFont; /* 92 */
	jint                                                         maxWidth; /* 96 */
	jint                                                         maxHeight; /* 100 */
	jint                                                         bitmapAdr; /* 104 */
	struct INSTANCE_javax_microedition_lcdui_Image_s *           destination; /* 108 */
	struct INSTANCE_javax_microedition_lcdui_Graphics_00024Context_s *  contextStack; /* 112 */
	struct INSTANCE_javax_microedition_lcdui_Graphics_00024Context_s *  savedContext; /* 116 */
	jboolean                                                     screenGraphicsBehavior; /* 120 */
	char pad121[3]; /* pad to offset 124 */
}; /* 124 bytes */

struct INSTANCE_javax_microedition_lcdui_Graphics_00024Context_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         transX; /* 12 */
	jint                                                         transY; /* 16 */
	jint                                                         clipX1; /* 20 */
	jint                                                         clipY1; /* 24 */
	jint                                                         clipX2; /* 28 */
	jint                                                         clipY2; /* 32 */
	jint                                                         argbColor; /* 36 */
	jint                                                         grayRgb; /* 40 */
	jint                                                         gray; /* 44 */
	jint                                                         pixel; /* 48 */
	jint                                                         style; /* 52 */
	struct INSTANCE_javax_microedition_lcdui_Font_s *            currentFont; /* 56 */
	struct INSTANCE_javax_microedition_lcdui_Graphics_00024Context_s *  next; /* 60 */
	struct INSTANCE_javax_microedition_lcdui_Graphics_00024Context_s *  previous; /* 64 */
}; /* 68 bytes */

struct INSTANCE_javax_microedition_lcdui_Image_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         width; /* 12 */
	jint                                                         height; /* 16 */
	BYTEARRAY                                                    imgData; /* 20 */
	BYTEARRAY                                                    alphaData; /* 24 */
	jint                                                         __nextFinalized__; /* 28 */
}; /* 32 bytes */

struct INSTANCE_javax_microedition_lcdui_Item_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fCommands; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Item_00024ItemCommandExListener_s *  fCommandExListener; /* 16 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         fDefaultCommand; /* 20 */
	struct INSTANCE_javax_microedition_lcdui_ItemCommandListener_s *  fItemCommandListener; /* 24 */
	STRING_INSTANCE                                              fLabel; /* 28 */
	jint                                                         fLayout; /* 32 */
	jint                                                         fCurrentAlignment; /* 36 */
	jint                                                         fPreferredWidth; /* 40 */
	jint                                                         fPreferredHeight; /* 44 */
	struct INSTANCE_javax_microedition_lcdui_Form_s *            fParent; /* 48 */
	struct INSTANCE_java_lang_Object_s *                         fData; /* 52 */
	struct INSTANCE_javax_microedition_lcdui_ItemLayoutInfo_s *  fLayoutInfo; /* 56 */
}; /* 60 bytes */

struct INSTANCE_javax_microedition_lcdui_Item_00024ItemCommandExListener_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Item_s *            fItem; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Item_s *            this_000240; /* 16 */
}; /* 20 bytes */

struct INSTANCE_javax_microedition_lcdui_LayoutInfo_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         fMinimumWidth; /* 12 */
	jint                                                         fMinimumHeight; /* 16 */
	jint                                                         fPreferredWidth; /* 20 */
	jint                                                         fPreferredHeight; /* 24 */
}; /* 28 bytes */

struct INSTANCE_javax_microedition_lcdui_PackageAccess_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_lcdui_PackageAccess_000241_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Runnable_s *                       val_00024runnable; /* 12 */
}; /* 16 bytes */

struct INSTANCE_javax_microedition_lcdui_TextModel_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	CHARARRAY                                                    fBuffer; /* 12 */
	jint                                                         fLength; /* 16 */
}; /* 20 bytes */

struct INSTANCE_javax_microedition_lcdui_Ticker_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              fText; /* 12 */
}; /* 16 bytes */

struct INSTANCE_javax_microedition_lcdui_game_GameCanvasBuffer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Image_s *           fCurrentBuffer; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Image_s *           fBuffer1; /* 16 */
	struct INSTANCE_javax_microedition_lcdui_Image_s *           fBuffer2; /* 20 */
	jint                                                         fVisibleWidth; /* 24 */
	jint                                                         fVisibleHeight; /* 28 */
	struct INSTANCE_javax_microedition_lcdui_GameCanvasGraphics_s *  fGraphics; /* 32 */
	jboolean                                                     fNeedBufferSwap; /* 36 */
	char pad37[3]; /* pad to offset 40 */
	jint                                                         fThresholdSize; /* 40 */
	struct INSTANCE_com_jbed_util_WeakReferenceVector_s *        fGraphicsWeakRefVector; /* 44 */
	jboolean                                                     isBindToEGLSurface; /* 48 */
	char pad49[3]; /* pad to offset 52 */
}; /* 52 bytes */

struct INSTANCE_javax_microedition_lcdui_game_Layer_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         x; /* 12 */
	jint                                                         y; /* 16 */
	jint                                                         width; /* 20 */
	jint                                                         height; /* 24 */
	jboolean                                                     visible; /* 28 */
	char pad29[3]; /* pad to offset 32 */
}; /* 32 bytes */

struct INSTANCE_javax_microedition_lcdui_game_LayerManager_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         nlayers; /* 12 */
	REFARRAY                                                     component; /* 16 */
	jint                                                         viewX; /* 20 */
	jint                                                         viewY; /* 24 */
	jint                                                         viewWidth; /* 28 */
	jint                                                         viewHeight; /* 32 */
}; /* 36 bytes */

struct INSTANCE_javax_microedition_lcdui_game_PackageAccess_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_media_Manager_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_media_protocol_ContentDescriptor_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              encoding; /* 12 */
}; /* 16 bytes */

struct INSTANCE_javax_microedition_media_protocol_DataSource_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	STRING_INSTANCE                                              sourceLocator; /* 12 */
}; /* 16 bytes */

struct INSTANCE_javax_microedition_midlet_MIDlet_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_ams_MIDletState_s *                 stateProxy; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         da; /* 16 */
}; /* 20 bytes */

struct INSTANCE_javax_microedition_midlet_MIDletRuntime_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_midlet_PackageAccess_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_pim_PIM_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_pim_PackageAccess_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_pim_RepeatRule_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_util_Vector_s *                         exceptedDays; /* 12 */
	struct INSTANCE_java_util_Vector_s *                         resDates; /* 16 */
	jint                                                         frequency; /* 20 */
	jint                                                         count; /* 24 */
	jint                                                         interval; /* 28 */
	jint                                                         monthInYear; /* 32 */
	jint                                                         dayInWeek; /* 36 */
	jint                                                         weekInMonth; /* 40 */
	jint                                                         dayInMonth; /* 44 */
	jint                                                         dayInYear; /* 48 */
	char pad52[4]; /* pad to offset 56 */
	jlong                                                        end; /* 56 */
	jint                                                         initFactor; /* 64 */
	char pad68[4]; /* pad to offset 72 */
	jlong                                                        fromDate; /* 72 */
	jlong                                                        toDate; /* 80 */
	jlong                                                        initialDate; /* 88 */
}; /* 96 bytes */

struct INSTANCE_javax_microedition_rms_RecordEnumerationImpl_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_rms_RecordStore_s *       recordStore; /* 12 */
	struct INSTANCE_javax_microedition_rms_RecordFilter_s *      filter; /* 16 */
	struct INSTANCE_javax_microedition_rms_RecordComparator_s *  comparator; /* 20 */
	jboolean                                                     beObserver; /* 24 */
	char pad25[3]; /* pad to offset 28 */
	jint                                                         nextIndex; /* 28 */
	jint                                                         prevIndex; /* 32 */
	INTARRAY                                                     records; /* 36 */
}; /* 40 bytes */

struct INSTANCE_javax_microedition_rms_RecordStore_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_rms_RecordStorePeerBase_s *  peerObj; /* 12 */
	struct INSTANCE_java_lang_Object_s *                         rsLock; /* 16 */
	STRING_INSTANCE                                              caller; /* 20 */
	STRING_INSTANCE                                              owner; /* 24 */
	STRING_INSTANCE                                              name; /* 28 */
	jint                                                         openCount; /* 32 */
	jint                                                         authmode; /* 36 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 recordListeners; /* 40 */
}; /* 44 bytes */

struct INSTANCE_javax_microedition_rms_RecordStorePeer_00024RecordHeader_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         offset; /* 12 */
	jint                                                         id; /* 16 */
	jint                                                         nextOffset; /* 20 */
	jint                                                         blockSize; /* 24 */
	jint                                                         dataLenOrNextFree; /* 28 */
	BYTEARRAY                                                    recHeadBuf; /* 32 */
	struct INSTANCE_javax_microedition_rms_RecordStorePeer_s *   this_000240; /* 36 */
}; /* 40 bytes */

struct INSTANCE_javax_microedition_rms_RecordStorePeer_00024RecordHeaderCache_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	REFARRAY                                                     mCache; /* 12 */
}; /* 16 bytes */

struct INSTANCE_javax_microedition_rms_RecordStorePeerBase_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_rms_RmsToolkit_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_AmsThread_s
{
	struct INSTANCE_java_lang_Thread_s                           super; /* 0 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_ams_AmsToolkit_s
{
	struct INSTANCE_com_jbed_ams_AmsToolkitBase_s                super; /* 0 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_ams_BackgroundInstaller_s
{
	struct INSTANCE_com_jbed_ams_InstallListener_s               super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cancelInstallCmd; /* 12 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cancelBusyCmd; /* 16 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         okCmd; /* 20 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         nextCmd; /* 24 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         okExitCmd; /* 28 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         noLaunchCmd; /* 32 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         yesLaunchCmd; /* 36 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         launchCmd; /* 40 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         dismissCmd; /* 44 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         installCmd; /* 48 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         continueCmd; /* 52 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cancelPreviewCmd; /* 56 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         noUntrustCmd; /* 60 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         yesUntrustCmd; /* 64 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         okSignedCmd; /* 68 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         confirmCmd; /* 72 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         noCmd; /* 76 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         yesRetainRmsCmd; /* 80 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         noRetainRmsCmd; /* 84 */
	jboolean                                                     continueInstall; /* 88 */
	char pad89[3]; /* pad to offset 92 */
	struct INSTANCE_com_jbed_ams_Manager_s *                     parent; /* 92 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         display; /* 96 */
	struct INSTANCE_com_jbed_ams_Installer_s *                   installer; /* 100 */
	STRING_INSTANCE                                              cancelledMessage; /* 104 */
	STRING_INSTANCE                                              finishingMessage; /* 108 */
	struct INSTANCE_javax_microedition_lcdui_Form_s *            passwordForm; /* 112 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         alertCancelCmd; /* 116 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         displayableCancelCmd; /* 120 */
	struct INSTANCE_javax_microedition_lcdui_TextField_s *       usernameField; /* 124 */
	struct INSTANCE_javax_microedition_lcdui_TextField_s *       passwordField; /* 128 */
	struct INSTANCE_javax_microedition_lcdui_Gauge_s *           gauge; /* 132 */
	struct INSTANCE_javax_microedition_lcdui_Image_s *           compilingIcon; /* 136 */
	struct INSTANCE_javax_microedition_lcdui_Image_s *           finishingIcon; /* 140 */
	struct INSTANCE_javax_microedition_lcdui_Alert_s *           exitAlert; /* 144 */
	struct INSTANCE_javax_microedition_lcdui_StringItem_s *      jarSizeItem; /* 148 */
	struct INSTANCE_javax_microedition_lcdui_List_s *            storageList; /* 152 */
	struct INSTANCE_javax_microedition_lcdui_Form_s *            conForm; /* 156 */
	struct INSTANCE_javax_microedition_lcdui_Form_s *            busyForm; /* 160 */
	STRING_INSTANCE                                              successMessage; /* 164 */
	struct INSTANCE_com_jbed_ams_InstallState_s *                installState; /* 168 */
	struct INSTANCE_javax_microedition_lcdui_List_s *            mlist; /* 172 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                suiteToLaunch; /* 176 */
	jboolean                                                     waiting; /* 180 */
	jboolean                                                     shouldRetainRms; /* 181 */
	char pad182[2]; /* pad to offset 184 */
	STRING_INSTANCE                                              targetStorage; /* 184 */
}; /* 188 bytes */

struct INSTANCE_com_jbed_ams_BaseProperties_s
{
	struct INSTANCE_com_jbed_util_Properties_s                   super; /* 0 */
	CHARARRAY                                                    lineBuffer; /* 20 */
	jint                                                         remainder; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_ams_BrowseFiles_000241_s
{
	struct INSTANCE_java_lang_Thread_s                           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Gauge_s *           val_00024searchGauge; /* 20 */
	struct INSTANCE_com_jbed_ams_BrowseFiles_s *                 this_000240; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_ams_BrowseFiles_000242_s
{
	struct INSTANCE_java_lang_Thread_s                           super; /* 0 */
	STRINGARRAY                                                  val_00024folders; /* 20 */
	struct INSTANCE_com_jbed_ams_BrowseFiles_s *                 this_000240; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_ams_CommandInstallListener_s
{
	struct INSTANCE_com_jbed_ams_InstallListener_s               super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_DefaultPreinstallConfigurationParser_s
{
	struct INSTANCE_com_jbed_ams_PreinstallConfigurationParser_s super; /* 0 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_ams_Dialogue_s
{
	struct INSTANCE_javax_microedition_midlet_MIDlet_s           super; /* 0 */
	STRING_INSTANCE                                              title; /* 20 */
	STRING_INSTANCE                                              message; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_ams_FileInstallState_s
{
	struct INSTANCE_com_jbed_ams_InstallState_s                  super; /* 0 */
	STRING_INSTANCE                                              dir; /* 216 */
	STRING_INSTANCE                                              localJar; /* 220 */
}; /* 224 bytes */

struct INSTANCE_com_jbed_ams_ImageStorageFS_s
{
	struct INSTANCE_com_jbed_ams_ImageStorage_s                  super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_ams_InstalledMIDletSuite_s
{
	struct INSTANCE_com_jbed_ams_MIDletSuite_s                   super; /* 0 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                suiteData; /* 32 */
	struct INSTANCE_com_jbed_util_ZipFile_s *                    jarFile; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_ams_JbedChainVerifier_s
{
	struct INSTANCE_iaik_me_security_ssl_ChainVerifier_s         super; /* 0 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_ams_MIDletStateProxy_s
{
	struct INSTANCE_com_jbed_ams_MIDletState_s                   super; /* 0 */
}; /* 64 bytes */

struct INSTANCE_com_jbed_ams_Manager_s
{
	struct INSTANCE_javax_microedition_midlet_MIDlet_s           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            manageCertificates; /* 20 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            openCmd; /* 24 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            launchCmd; /* 28 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            debugCmd; /* 32 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            profileCmd; /* 36 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            infoCmd; /* 40 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            removeCmd; /* 44 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            removeAllCmd; /* 48 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            updateCmd; /* 52 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            backgroundRunningCmd; /* 56 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            optionsCmd; /* 60 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            upFolderCmd; /* 64 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            moveCmd; /* 68 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            moveStorageCmd; /* 72 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            newFolderCmd; /* 76 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            installCmd; /* 80 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            browserCmd; /* 84 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            localFilesCmd; /* 88 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            aboutCmd; /* 92 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            exitCmd; /* 96 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s *            displaySizeCmd; /* 100 */
	jboolean                                                     blockAppRequestsHack; /* 104 */
	char pad105[3]; /* pad to offset 108 */
	struct INSTANCE_com_jbed_ams_Installer_s *                   installer; /* 108 */
	struct INSTANCE_com_jbed_midp_lcdui_ItemCommandsList_s *     mlist; /* 112 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 commonCommands; /* 116 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         display; /* 120 */
	jint                                                         mcount; /* 124 */
	jboolean                                                     iconToBeLoaded; /* 128 */
	jboolean                                                     paused; /* 129 */
	jboolean                                                     notificationsToBeSent; /* 130 */
	char pad131[1]; /* pad to offset 132 */
	struct INSTANCE_com_jbed_ams_Folder_s *                      currentFolder; /* 132 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                currentSuite; /* 136 */
	REFARRAY                                                     minfo; /* 140 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                selected; /* 144 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         selectFolderNewFolderDone; /* 148 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                toBeMoved; /* 152 */
	struct INSTANCE_javax_microedition_lcdui_List_s *            moveStorageList; /* 156 */
	struct INSTANCE_com_jbed_ams_Manager_00024FolderSelectList_s *  moveFolderList; /* 160 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         prevRemoveCommand; /* 164 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         okCmd; /* 168 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cancelCmd; /* 172 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         removeOkCmd; /* 176 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         removeAllOkCmd; /* 180 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         backToMainScreen; /* 184 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         exitAppCmd; /* 188 */
	struct INSTANCE_javax_microedition_lcdui_Form_s *            selectDisplaySizeForm; /* 192 */
	struct INSTANCE_javax_microedition_lcdui_ChoiceGroup_s *     selectDisplaySizeChoice; /* 196 */
	REFARRAY                                                     displaySizeInfos; /* 200 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                midletToSelectDisplaySize; /* 204 */
	struct INSTANCE_com_jbed_ams_SelectorData_s *                rememberedSelection; /* 208 */
}; /* 212 bytes */

struct INSTANCE_com_jbed_ams_NativeAms_s
{
	struct INSTANCE_javax_microedition_midlet_MIDlet_s           super; /* 0 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_ams_NativeAmsInstaller_s
{
	struct INSTANCE_com_jbed_ams_InstallListener_s               super; /* 0 */
	jboolean                                                     cancel; /* 12 */
	char pad13[3]; /* pad to offset 16 */
	struct INSTANCE_com_jbed_ams_InstallState_s *                installState; /* 16 */
	struct INSTANCE_com_jbed_ams_Installer_s *                   installer; /* 20 */
	jboolean                                                     update; /* 24 */
	jboolean                                                     waiting; /* 25 */
	jboolean                                                     running; /* 26 */
	char pad27[1]; /* pad to offset 28 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cancelCmd; /* 28 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         okCmd; /* 32 */
	struct INSTANCE_javax_microedition_lcdui_Form_s *            infoForm; /* 36 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         display; /* 40 */
	jboolean                                                     javaHandle; /* 44 */
	char pad45[3]; /* pad to offset 48 */
	jint                                                         currentTask; /* 48 */
	jint                                                         queryResult; /* 52 */
	STRING_INSTANCE                                              removeSuiteId; /* 56 */
	jboolean                                                     resetPreinstalled; /* 60 */
	jboolean                                                     resetProtected; /* 61 */
	jboolean                                                     removePreinstalled; /* 62 */
	char pad63[1]; /* pad to offset 64 */
	STRING_INSTANCE                                              targetStorage; /* 64 */
	STRING_INSTANCE                                              targetFolder; /* 68 */
}; /* 72 bytes */

struct INSTANCE_com_jbed_ams_PermissionOption_s
{
	struct INSTANCE_com_jbed_ams_Option_s                        super; /* 0 */
	REFARRAY                                                     choiceGroups; /* 16 */
	CHARARRAY                                                    answers; /* 20 */
	struct INSTANCE_com_jbed_ams_SecurityPermissions_s *         permissions; /* 24 */
	INTARRAY                                                     selections; /* 28 */
	struct INSTANCE_java_lang_StringBuffer_s *                   amsg; /* 32 */
	jint                                                         domainGroup; /* 36 */
	struct INSTANCE_javax_microedition_lcdui_Form_s *            form; /* 40 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         command; /* 44 */
	jboolean                                                     showSaveCmd; /* 48 */
	jboolean                                                     showAllInfos; /* 49 */
	char pad50[2]; /* pad to offset 52 */
}; /* 52 bytes */

struct INSTANCE_com_jbed_ams_SecurityPermissions_s
{
	struct INSTANCE_com_jbed_security_GenData_s                  super; /* 0 */
	SHORTARRAY                                                   permissions; /* 12 */
	SHORTARRAY                                                   fg_permissions; /* 16 */
	STRING_INSTANCE                                              domain; /* 20 */
	jboolean                                                     policyLoaded; /* 24 */
	jboolean                                                     answersSet; /* 25 */
	char pad26[2]; /* pad to offset 28 */
	CHARARRAY                                                    answerArray; /* 28 */
	CHARARRAY                                                    fg_answerArray; /* 32 */
	BOOLEANARRAY                                                 requestedPermissions; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_ams_TaskManager_s
{
	struct INSTANCE_javax_microedition_midlet_MIDlet_s           super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         dpy; /* 20 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         kill; /* 24 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         pause; /* 28 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         okay; /* 32 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         cancel; /* 36 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         exit; /* 40 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         resume; /* 44 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         install; /* 48 */
	struct INSTANCE_javax_microedition_lcdui_List_s *            endKeyMenu; /* 52 */
	jint                                                         state; /* 56 */
	struct INSTANCE_java_lang_Object_s *                         installRequestNotify; /* 60 */
	STRING_INSTANCE                                              installRequestUrl; /* 64 */
	STRING_INSTANCE                                              installRequestOriginalUrl; /* 68 */
	STRING_INSTANCE                                              installUsername; /* 72 */
	STRING_INSTANCE                                              installPassword; /* 76 */
	jboolean                                                     endKeyPressed; /* 80 */
	char pad81[3]; /* pad to offset 84 */
	struct INSTANCE_com_jbed_ams_MIDletState_s *                 endPressedMIDlet; /* 84 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     killMidletGui; /* 88 */
	struct INSTANCE_com_jbed_ams_MIDletState_s *                 midletToKill; /* 92 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 midletsToKill; /* 96 */
	struct INSTANCE_com_jbed_ams_MIDletState_s *                 permissionGUI; /* 100 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     alertMessageGui; /* 104 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 alertMessageGuis; /* 108 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     platformRequestAlertGui; /* 112 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 platformRequestAlertGuis; /* 116 */
	struct INSTANCE_java_util_Vector_s *                         pushGUIs; /* 120 */
	struct INSTANCE_com_jbed_ams_PermissionGUI_s *               pushGUI; /* 124 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 chapiMidletIds; /* 128 */
	struct INSTANCE_javax_microedition_lcdui_Gauge_s *           gauge; /* 132 */
	struct INSTANCE_com_jbed_ams_BlankScreenCanvas_s *           blankScreen; /* 136 */
}; /* 140 bytes */

struct INSTANCE_com_jbed_cldc_CldcConfig_s
{
	struct INSTANCE_com_jbed_cldc_CldcConfigBase_s               super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_install_InstallException_s
{
	struct INSTANCE_java_lang_Throwable_s                        super; /* 0 */
	jint                                                         reason; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_io_CharConvISO88591_s
{
	struct INSTANCE_com_jbed_io_CharConverter_s                  super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_io_CharConvUTF16_s
{
	struct INSTANCE_com_jbed_io_CharConverter_s                  super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_io_CharConvUTF8_s
{
	struct INSTANCE_com_jbed_io_CharConverter_s                  super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_io_IoToolkit_s
{
	struct INSTANCE_com_jbed_io_IoToolkitBase_s                  super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_io_RawInputStream_s
{
	struct INSTANCE_java_io_InputStream_s                        super; /* 0 */
	jint                                                         markPos; /* 12 */
	BYTEARRAY                                                    tmpBuf; /* 16 */
	BYTEARRAY                                                    fBuffer; /* 20 */
	jint                                                         fReadPos; /* 24 */
	jint                                                         fLimitPos; /* 28 */
	jint                                                         fFilledPos; /* 32 */
	jboolean                                                     fOutOfReadLimit; /* 36 */
	char pad37[3]; /* pad to offset 40 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_io_RawOutputStream_s
{
	struct INSTANCE_java_io_OutputStream_s                       super; /* 0 */
	BYTEARRAY                                                    tmpBuf; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_io_StringDataInputStream_s
{
	struct INSTANCE_java_io_InputStream_s                        super; /* 0 */
	jint                                                         pos; /* 12 */
	jint                                                         ch; /* 16 */
	jboolean                                                     low; /* 20 */
	char pad21[3]; /* pad to offset 24 */
	STRING_INSTANCE                                              dat; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_microedition_media_FullManager_s
{
	struct INSTANCE_com_jbed_microedition_media_CoreManager_s    super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_microedition_media_player_ExpandedRecorder_s
{
	struct INSTANCE_com_jbed_microedition_media_player_CoreBasicPlayer_s super; /* 0 */
	STRING_INSTANCE                                              locator; /* 88 */
}; /* 92 bytes */

struct INSTANCE_com_jbed_midp_MIDPToolkit_s
{
	struct INSTANCE_com_jbed_tina_Tina_s                         super; /* 0 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_CommandEx_s
{
	struct INSTANCE_javax_microedition_lcdui_Command_s           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_CommandExListener_s *    fListener; /* 32 */
	jboolean                                                     fIsEnabled; /* 36 */
	char pad37[3]; /* pad to offset 40 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_midp_lcdui_Config_s
{
	struct INSTANCE_com_jbed_midp_lcdui_ConfigBase_s             super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_DefaultPhoneSystem_00024VibrateTimerTaskAction_s
{
	struct INSTANCE_java_util_TimerTask_s                        super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_DefaultPhoneSystem_s *   this_000240; /* 56 */
}; /* 60 bytes */

struct INSTANCE_com_jbed_midp_lcdui_ewt_Composite_s
{
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s          super; /* 0 */
	REFARRAY                                                     fChildren; /* 76 */
	jint                                                         fChildCount; /* 80 */
	jint                                                         fFocusedChildIndex; /* 84 */
}; /* 88 bytes */

struct INSTANCE_com_jbed_midp_lcdui_ewt_ContentComponent_s
{
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s          super; /* 0 */
	jint                                                         fAlignment; /* 76 */
	jint                                                         fPaddingTop; /* 80 */
	jint                                                         fPaddingRight; /* 84 */
	jint                                                         fPaddingBottom; /* 88 */
	jint                                                         fPaddingLeft; /* 92 */
	jint                                                         fMaxWidth; /* 96 */
	jint                                                         fMaxHeight; /* 100 */
	jint                                                         fMinWidth; /* 104 */
	jint                                                         fMinHeight; /* 108 */
}; /* 112 bytes */

struct INSTANCE_com_jbed_midp_lcdui_ewt_DecoratorComponent_s
{
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s          super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s *        fComponent; /* 76 */
}; /* 80 bytes */

struct INSTANCE_com_jbed_midp_lcdui_javaui_FBCCEventLoop_s
{
	struct INSTANCE_com_jbed_tina_event_EventConsumer_s          super; /* 0 */
	struct INSTANCE_com_jbed_midp_MIDPToolkit_s *                fToolkit; /* 40 */
	struct INSTANCE_com_jbed_midp_lcdui_KeyListener_s *          fKeyListener; /* 44 */
	struct INSTANCE_com_jbed_midp_lcdui_PointerListener_s *      fPointerListener; /* 48 */
	struct INSTANCE_java_lang_Runnable_s *                       fPulseRunnable; /* 52 */
	jboolean                                                     fPressedPointer; /* 56 */
	jboolean                                                     fIsRootIsolate; /* 57 */
	char pad58[2]; /* pad to offset 60 */
	struct INSTANCE_com_jbed_midp_lcdui_javaui_PressedKeyCache_s *  fPressedKeyCache; /* 60 */
}; /* 64 bytes */

struct INSTANCE_com_jbed_midp_lcdui_javaui_UpcallDispatcher_s
{
	struct INSTANCE_com_jbed_midp_lcdui_UpcallBase_s             super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_PeerLookAndFeel_s
{
	/* Type of field "fPeerFactory" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.lookandfeel.peer.PeerFactory;" */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_peer_DefaultLookAndFeel_s super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         fPeerFactory; /* 36 */
	struct INSTANCE_com_jbed_midp_lcdui_model_SystemScreen_s *   fSystemScreen; /* 40 */
}; /* 44 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_AbstractEditTextInputHandler_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardInputHandler_s super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_EditTextComponent_s *  fEditTextComponent; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_AbstractEditTextInputHandler_000241_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandContext_s super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_AbstractEditTextInputHandler_s *  this_000240; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_AbstractScrollBarInputHandler_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_InputHandlerAdapter_s super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_ScrollDecorator_s *  fScrollDecorator; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CanvasComponent_s
{
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s          super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Canvas_s *          fCanvas; /* 76 */
	jboolean                                                     fHasFocus; /* 80 */
	jboolean                                                     fHasKeyRepeatEvents; /* 81 */
	jboolean                                                     fHasPointerEvents; /* 82 */
	jboolean                                                     fHasPointerMotionEvents; /* 83 */
	jboolean                                                     fClearBackground; /* 84 */
	char pad85[3]; /* pad to offset 88 */
	jint                                                         fBackgroundColor; /* 88 */
	jint                                                         fAbsoluteX; /* 92 */
	jint                                                         fAbsoluteY; /* 96 */
}; /* 100 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_ChoiceInputHandler_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardInputHandler_s super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_GenericChoiceEditor_s *  fChoiceEditor; /* 16 */
	jboolean                                                     fFireCommand; /* 20 */
	char pad21[3]; /* pad to offset 24 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandContext_s *  fSelectCommandContext; /* 24 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s *        fActivatedComponent; /* 28 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_ScrollDecorator_s *  fScrollDecorator; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandBarLayout_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardLayout_s super; /* 0 */
	jint                                                         fSpacing; /* 40 */
	jint                                                         fCommandHeight; /* 44 */
}; /* 48 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CustomItemComponent_s
{
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s          super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_CustomItem_s *      fCustomItem; /* 76 */
	jint                                                         fFocusState; /* 80 */
	INTARRAY                                                     fFocusRectangle; /* 84 */
	jint                                                         fTraversalModes; /* 88 */
	jboolean                                                     fPressed; /* 92 */
	jboolean                                                     fRequestTraverse; /* 93 */
	jboolean                                                     fJustTraverseIn; /* 94 */
	char pad95[1]; /* pad to offset 96 */
}; /* 96 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_DateInputHandler_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardInputHandler_s super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_DateComponent_s *  fComponent; /* 16 */
	jint                                                         fCurrentFieldIndex; /* 20 */
	jboolean                                                     fEditing; /* 24 */
	char pad25[3]; /* pad to offset 28 */
	jint                                                         fEditLength; /* 28 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardDateFieldPeer_s *  fDateFieldPeer; /* 32 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandContext_s *  fInnerCommandContext; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_DateInputHandler_000241_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandContext_s super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_DateInputHandler_s *  this_000240; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_DisplayableCommandContext_s
{
	/* Type of field "fActivationListener" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.toolkit.ewt.CommandActivationListener;" */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandContext_s super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     fDisplayable; /* 16 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommitListener_s *  fCommitListener; /* 20 */
	struct INSTANCE_java_lang_Object_s *                         fActivationListener; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_FormLayout_s
{
	/* Type of field "fLayoutPolicy" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Ljavax.microedition.lcdui.FormLayoutPolicy;" */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardLayout_s super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         fLayoutPolicy; /* 40 */
}; /* 44 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_GaugeInputHandler_s
{
	/* Type of field "fGaugeState" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.toolkit.ewt.GaugeState;" */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardInputHandler_s super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         fGaugeState; /* 16 */
	jboolean                                                     fPointerAccepted; /* 20 */
	char pad21[3]; /* pad to offset 24 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_HorizontalLayout_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardLayout_s super; /* 0 */
	jint                                                         fSpacing; /* 40 */
	jboolean                                                     fRightToLeft; /* 44 */
	char pad45[3]; /* pad to offset 48 */
}; /* 48 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_HorizontalScrollLayout_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardLayout_s super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_ScrollDecorator_s *  fScrollDecorator; /* 40 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s *        fScrollBar; /* 44 */
	jboolean                                                     fRightToLeft; /* 48 */
	char pad49[3]; /* pad to offset 52 */
}; /* 52 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_ItemCommandContext_s
{
	/* Type of field "fActivationListener" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.toolkit.ewt.CommandActivationListener;" */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandContext_s super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Item_s *            fItem; /* 16 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommitListener_s *  fCommitListener; /* 20 */
	struct INSTANCE_java_lang_Object_s *                         fActivationListener; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_PopupInputHandler_s
{
	/* Type of field "fPopupPeer" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.lookandfeel.peer.PopupPeer;" */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardInputHandler_s super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         fPopupPeer; /* 16 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandContext_s *  fSelectCommandContext; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_PressKeyInputHandler_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_InputHandlerDecorator_s super; /* 0 */
	jint                                                         fKey; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_SimpleEditTextInputHandler_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardInputHandler_s super; /* 0 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_SpacerComponent_s
{
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s          super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Item_s *            fItem; /* 76 */
	jint                                                         fSpecifiedMinimumWidth; /* 80 */
	jint                                                         fSpecifiedMinimumHeight; /* 84 */
	jint                                                         fSpecifiedPreferredWidth; /* 88 */
	jint                                                         fSpecifiedPreferredHeight; /* 92 */
}; /* 96 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardCommandHandler_000241_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CommandContext_s super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardCommandHandler_s *  this_000240; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardComponent_s
{
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Component_s          super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardComponentRenderer_s *  fRenderer; /* 76 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_InputHandler_s *  fInputHandler; /* 80 */
	jboolean                                                     fHasFocus; /* 84 */
	char pad85[3]; /* pad to offset 88 */
}; /* 88 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_ThreePassCommandHandler_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardCommandHandler_s super; /* 0 */
}; /* 92 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_VerticalLayout_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_StandardLayout_s super; /* 0 */
	jint                                                         fSpacing; /* 40 */
}; /* 44 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_VerticalLayout_000241_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_VerticalLayout_00024Distributor_s super; /* 0 */
	jint                                                         val_00024contentWidthHint; /* 44 */
}; /* 48 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_VerticalLayout_000242_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_VerticalLayout_00024Distributor_s super; /* 0 */
	jint                                                         bottom; /* 44 */
	jint                                                         y; /* 48 */
	jint                                                         val_00024contentAvailableWidth; /* 52 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_VerticalLayout_s *  this_000240; /* 56 */
}; /* 60 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_CommandMenuRequestor_s
{
	struct INSTANCE_com_jbed_midp_lcdui_model_SystemScreen_s     super; /* 0 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fCommandContexts; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_NativeTextBoxDispatcherImpl_00024DispatchWorker_s
{
	struct INSTANCE_java_lang_Thread_s                           super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_NativeTextBoxDispatcherImpl_s *  this_000240; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_PopupMenuRequestor_s
{
	struct INSTANCE_com_jbed_midp_lcdui_model_SystemScreen_s     super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_ChoiceGroup_s *     fChoiceGroup; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardAlertPeer_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardDisplayablePeer_s super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Alert_s *           fAlert; /* 44 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_TextComponent_s *    fStringComponent; /* 48 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_ImageComponent_s *   fImageComponent; /* 52 */
	jboolean                                                     fHasPlayedAlertSound; /* 56 */
	char pad57[3]; /* pad to offset 60 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Composite_s *        fIndicatorContainer; /* 60 */
}; /* 64 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardCanvasPeer_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardDisplayablePeer_s super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CanvasComponent_s *  fCanvasComponent; /* 44 */
}; /* 48 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardChoiceGroupPeer_s
{
	/* Type of field "fChoiceItemFactory" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.toolkit.ewt.ChoiceItemFactory;" */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardItemPeer_s super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_ChoiceGroup_s *     fChoiceGroup; /* 28 */
	struct INSTANCE_javax_microedition_lcdui_Font_s *            fDefaultFont; /* 32 */
	struct INSTANCE_java_lang_Object_s *                         fChoiceItemFactory; /* 36 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_Composite_s *        fContent; /* 40 */
}; /* 44 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardCustomItemPeer_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardItemPeer_s super; /* 0 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_CustomItemComponent_s *  fCustomItemComponent; /* 28 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardDateFieldPeer_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardItemPeer_s super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_DateField_s *       fDateField; /* 28 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_DateComponent_s *  fDateComponent; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardFormPeer_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardDisplayablePeer_s super; /* 0 */
}; /* 44 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardGaugePeer_s
{
	/* Type of field "fGaugeState" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.toolkit.ewt.GaugeState;" */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardItemPeer_s super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Gauge_s *           fGauge; /* 28 */
	struct INSTANCE_java_lang_Object_s *                         fGaugeState; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardImageItemPeer_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardItemPeer_s super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_ImageItem_s *       fImageItem; /* 28 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_ImageComponent_s *   fImageComponent; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardListPeer_s
{
	/* Type of field "fChoiceItemFactory" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.toolkit.ewt.ChoiceItemFactory;" */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardDisplayablePeer_s super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_List_s *            fList; /* 44 */
	struct INSTANCE_javax_microedition_lcdui_Font_s *            fDefaultFont; /* 48 */
	struct INSTANCE_java_lang_Object_s *                         fChoiceItemFactory; /* 52 */
}; /* 56 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardPopupPeer_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardItemPeer_s super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_ChoiceGroup_s *     fChoiceGroup; /* 28 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_ImageComponent_s *   fImageComponent; /* 32 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_TextComponent_s *    fTextComponent; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardSpacerPeer_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardItemPeer_s super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Spacer_s *          fSpacer; /* 28 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_ewt_SpacerComponent_s *  fSpacerComponent; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardStringItemPeer_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardItemPeer_s super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_StringItem_s *      fStringItem; /* 28 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_TextComponent_s *    fTextComponent; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardTextFieldPeer_s
{
	/* Type of field "fTextFormatterFactory" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.toolkit.text.TextFormatterFactory;" */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StandardItemPeer_s super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_TextField_s *       fTextField; /* 28 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_EditTextComponent_s *  fTextComponent; /* 32 */
	struct INSTANCE_java_lang_Object_s *                         fTextFormatterFactory; /* 36 */
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_peer_StringSequence_s *  fInputModeSequence; /* 40 */
	jint                                                         fConstraints; /* 44 */
}; /* 48 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_DefaultLineBreakIterator_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_LineBreakIterator_s super; /* 0 */
	jint                                                         fWhiteSpaceMode; /* 12 */
	STRING_INSTANCE                                              fString; /* 16 */
	jint                                                         fStringLength; /* 20 */
	jint                                                         fOffset; /* 24 */
	jint                                                         fLength; /* 28 */
	jboolean                                                     fForced; /* 32 */
	char pad33[3]; /* pad to offset 36 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_NewlineLineBreakIterator_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_LineBreakIterator_s super; /* 0 */
	STRING_INSTANCE                                              fString; /* 12 */
	jint                                                         fStringLength; /* 16 */
	jint                                                         fOffset; /* 20 */
	jint                                                         fLength; /* 24 */
	jboolean                                                     fForced; /* 28 */
	char pad29[3]; /* pad to offset 32 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_PasswordTextFormatter_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_TextFormatterDecorator_s super; /* 0 */
	jchar                                                        fPasswordCharacter; /* 16 */
	char pad18[2]; /* pad to offset 20 */
	struct INSTANCE_com_jbed_midp_lcdui_ewt_EditTextComponent_s *  fEditTextComponent; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_PhoneNumberTextFormatter_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_DefaultTextFormatter_s super; /* 0 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_PhoneNumberTextFormatter_000241_s
{
	struct INSTANCE_com_jbed_midp_lcdui_toolkit_text_FormattedText_s super; /* 0 */
	jint                                                         val_00024stringLength; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_pim_BinaryField_s
{
	struct INSTANCE_com_jbed_pim_Field_s                         super; /* 0 */
	REFARRAY                                                     dataValues; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_pim_BoolField_s
{
	struct INSTANCE_com_jbed_pim_Field_s                         super; /* 0 */
	BOOLEANARRAY                                                 dataValues; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_pim_ContactImpl_s
{
	struct INSTANCE_com_jbed_pim_PIMItemImpl_s                   super; /* 0 */
}; /* 56 bytes */

struct INSTANCE_com_jbed_pim_ContactListImpl_s
{
	struct INSTANCE_com_jbed_pim_PIMListImpl_s                   super; /* 0 */
}; /* 68 bytes */

struct INSTANCE_com_jbed_pim_DateField_s
{
	struct INSTANCE_com_jbed_pim_Field_s                         super; /* 0 */
	LONGARRAY                                                    dataValues; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_pim_EventImpl_s
{
	struct INSTANCE_com_jbed_pim_PIMItemImpl_s                   super; /* 0 */
	struct INSTANCE_javax_microedition_pim_RepeatRule_s *        repeatRule; /* 56 */
}; /* 60 bytes */

struct INSTANCE_com_jbed_pim_EventListImpl_s
{
	struct INSTANCE_com_jbed_pim_PIMListImpl_s                   super; /* 0 */
}; /* 68 bytes */

struct INSTANCE_com_jbed_pim_IntField_s
{
	struct INSTANCE_com_jbed_pim_Field_s                         super; /* 0 */
	INTARRAY                                                     dataValues; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_pim_PIMImpl_s
{
	struct INSTANCE_javax_microedition_pim_PIM_s                 super; /* 0 */
	jint                                                         __nextFinalized__; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_pim_StringArrayField_s
{
	struct INSTANCE_com_jbed_pim_Field_s                         super; /* 0 */
	REFARRAY                                                     dataValues; /* 32 */
	jint                                                         stringArraySize; /* 36 */
}; /* 40 bytes */

struct INSTANCE_com_jbed_pim_StringField_s
{
	struct INSTANCE_com_jbed_pim_Field_s                         super; /* 0 */
	STRINGARRAY                                                  dataValues; /* 32 */
}; /* 36 bytes */

struct INSTANCE_com_jbed_pim_ToDoImpl_s
{
	struct INSTANCE_com_jbed_pim_PIMItemImpl_s                   super; /* 0 */
}; /* 56 bytes */

struct INSTANCE_com_jbed_pim_ToDoListImpl_s
{
	struct INSTANCE_com_jbed_pim_PIMListImpl_s                   super; /* 0 */
}; /* 68 bytes */

struct INSTANCE_com_jbed_reflect_DynamicMethod_s
{
	struct INSTANCE_com_jbed_reflect_Method_s                    super; /* 0 */
	jint                                                         label; /* 36 */
	jchar                                                        maxStack; /* 40 */
	char pad42[2]; /* pad to offset 44 */
	BYTEARRAY                                                    code; /* 44 */
	INTARRAY                                                     handlers; /* 48 */
	CHARARRAY                                                    stackMap; /* 52 */
	CHARARRAY                                                    posInfo; /* 56 */
	struct INSTANCE_com_jbed_reflect_DynamicMethod_s *           next; /* 60 */
}; /* 64 bytes */

struct INSTANCE_com_jbed_runtime_Collector_s
{
	struct INSTANCE_com_jbed_runtime_CollectorBase_s             super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Compactor_s
{
	struct INSTANCE_com_jbed_runtime_CollectorBase_s             super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_Evacuator_s
{
	struct INSTANCE_com_jbed_runtime_CollectorBase_s             super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_HeapCodeBlocks_s
{
	struct INSTANCE_com_jbed_tbcc_CodeBlock_s                    super; /* 0 */
	jint                                                         myId; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_runtime_Isolate_00024FinalizerThread_s
{
	struct INSTANCE_java_lang_Thread_s                           super; /* 0 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_runtime_JarLoader_s
{
	struct INSTANCE_com_jbed_runtime_ClassLoader_s               super; /* 0 */
	REFARRAY                                                     zf; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_runtime_NullOutputStream_s
{
	struct INSTANCE_java_io_OutputStream_s                       super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_OsLog_s
{
	struct INSTANCE_java_io_OutputStream_s                       super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_SoftReference_s
{
	struct INSTANCE_java_lang_ref_Reference_s                    super; /* 0 */
}; /* 32 bytes */

struct INSTANCE_com_jbed_runtime_kdwp_KdwpTransport_s
{
	struct INSTANCE_com_jbed_runtime_NativeTransport_s           super; /* 0 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_security_FileSecureStore_s
{
	struct INSTANCE_com_jbed_security_SecureStore_s              super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_tbcc_CodeBlockWriter_s
{
	struct INSTANCE_com_jbed_tbcc_Writer_s                       super; /* 0 */
	jint                                                         topAdr; /* 44 */
	jint                                                         baseAdr; /* 48 */
	jint                                                         allocAdr; /* 52 */
	jint                                                         openTo; /* 56 */
	INTARRAY                                                     used; /* 60 */
	jint                                                         joinedBlocks; /* 64 */
	jint                                                         fixedBlocks; /* 68 */
	BYTEARRAY                                                    blockData; /* 72 */
	jboolean                                                     noAccess; /* 76 */
	jboolean                                                     noAllocations; /* 77 */
	jboolean                                                     noStackmaps; /* 78 */
	char pad79[1]; /* pad to offset 80 */
	jint                                                         largeTopAdr; /* 80 */
	jint                                                         largeBlockCount; /* 84 */
	INTARRAY                                                     largeBlockBases; /* 88 */
	REFARRAY                                                     largeBlocks; /* 92 */
	jint                                                         staticPointerBytes; /* 96 */
	jint                                                         staticPrimBytes; /* 100 */
	REFARRAY                                                     stackmaps; /* 104 */
	REFARRAY                                                     stackmapFlushQueue; /* 108 */
	jint                                                         numStackmapsToFlush; /* 112 */
	jboolean                                                     flushingStackmaps; /* 116 */
	char pad117[3]; /* pad to offset 120 */
	jint                                                         writtenStackMaps; /* 120 */
	jint                                                         writtenLongStackMapWords; /* 124 */
	struct INSTANCE_com_jbed_runtime_RomObjects_s *              objs; /* 128 */
	jint                                                         actualCodeSize; /* 132 */
	jint                                                         splitChainHead; /* 136 */
	jint                                                         totalSpaceUsed; /* 140 */
	jint                                                         totalJoined; /* 144 */
}; /* 148 bytes */

struct INSTANCE_com_jbed_tbcc_FCoder_s
{
	struct INSTANCE_com_jbed_tbcc_Coder_s                        super; /* 0 */
}; /* 196 bytes */

struct INSTANCE_com_jbed_tbcc_Verifier_s
{
	struct INSTANCE_com_jbed_tbcc_VerifierUtil_s                 super; /* 0 */
}; /* 88 bytes */

struct INSTANCE_com_jbed_tina_OplDeviceToolkit_s
{
	struct INSTANCE_com_jbed_tina_DeviceToolkit_s                super; /* 0 */
	struct INSTANCE_com_jbed_tina_event_EventSystem_s *          evtSys; /* 12 */
}; /* 16 bytes */

struct INSTANCE_com_jbed_tina_event_OPLEventSystem_s
{
	struct INSTANCE_com_jbed_tina_event_EventSystem_s            super; /* 0 */
	jint                                                         redKey; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_tina_media_MediaClip_s
{
	struct INSTANCE_com_jbed_tina_media_MediaSpecificObject_s    super; /* 0 */
	struct INSTANCE_java_io_InputStream_s *                      _stream; /* 16 */
	jint                                                         _length; /* 20 */
	BYTEARRAY                                                    _buffer; /* 24 */
	struct INSTANCE_com_jbed_tina_media_clip_ClipHelper_s *      _helper; /* 28 */
	BYTEARRAY                                                    _steppingBuff; /* 32 */
	jint                                                         _steppingBytesAvail; /* 36 */
	jint                                                         _steppingBufIdx; /* 40 */
	jint                                                         _stepTotalOffset; /* 44 */
	jboolean                                                     _eof; /* 48 */
	char pad49[3]; /* pad to offset 52 */
	struct INSTANCE_java_io_ByteArrayOutputStream_s *            _collectingBuffer; /* 52 */
	jboolean                                                     _collectDataRead; /* 56 */
	char pad57[3]; /* pad to offset 60 */
}; /* 60 bytes */

struct INSTANCE_com_jbed_tina_media_MediaPlayer_s
{
	struct INSTANCE_com_jbed_tina_media_MediaSpecificObject_s    super; /* 0 */
	struct INSTANCE_com_jbed_tina_media_MediaListener_s *        _listener; /* 16 */
	jint                                                         _playerCallBackId; /* 20 */
	struct INSTANCE_com_jbed_tina_media_MediaClip_s *            _clip; /* 24 */
	BYTEARRAY                                                    _soundBuffer; /* 28 */
	jint                                                         _soundBufferLength; /* 32 */
	jint                                                         _duration; /* 36 */
	jint                                                         _curVolume; /* 40 */
	jint                                                         _curMediaTime; /* 44 */
	jint                                                         _playbackState; /* 48 */
	jint                                                         _playerPropsMask; /* 52 */
	jboolean                                                     isPlayWithURI; /* 56 */
	jboolean                                                     isSuspended; /* 57 */
	char pad58[2]; /* pad to offset 60 */
}; /* 60 bytes */

struct INSTANCE_com_jbed_tina_media_MediaToolkitBase_s
{
	struct INSTANCE_com_jbed_tina_media_MediaSystem_s            super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_tina_media_NativeMediaSystem_s
{
	struct INSTANCE_com_jbed_tina_media_MediaSystem_s            super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_tina_media_player_ExpandedStreamRecorder_00024RThread_s
{
	struct INSTANCE_java_lang_Thread_s                           super; /* 0 */
	struct INSTANCE_com_jbed_tina_media_player_ExpandedStreamRecorder_s *  this_000240; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_tina_media_player_NativeCoreStreamPlayer_s
{
	struct INSTANCE_com_jbed_tina_media_player_NativePlayer_s    super; /* 0 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_util_zip_ZipFileData_s
{
	struct INSTANCE_com_jbed_util_ZipFile_s                      super; /* 0 */
	struct INSTANCE_com_jbed_io_RawInputStream_s *               ris; /* 12 */
	REFARRAY                                                     entries; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_util_zip_ZipFileData_00024ZipFileDataEntry_s
{
	struct INSTANCE_com_jbed_util_ZipEntry_s                     super; /* 0 */
	jint                                                         method; /* 28 */
	jint                                                         crc; /* 32 */
	jint                                                         compsize; /* 36 */
	jint                                                         newOffset; /* 40 */
	jint                                                         fnlen; /* 44 */
	jboolean                                                     preInflate; /* 48 */
	char pad49[3]; /* pad to offset 52 */
}; /* 52 bytes */

struct INSTANCE_com_sun_cldc_io_ConnectionBase_s
{
	struct INSTANCE_com_sun_cldc_io_GeneralBase_s                super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_iaik_me_asn1_ASN1InputStream_s
{
	struct INSTANCE_java_io_InputStream_s                        super; /* 0 */
	jint                                                         length; /* 12 */
	BYTEARRAY                                                    oneByte; /* 16 */
	jint                                                         readAhead; /* 20 */
	BYTEARRAY                                                    readBuffer; /* 24 */
	struct INSTANCE_java_io_InputStream_s *                      in; /* 28 */
	jint                                                         bytesRead; /* 32 */
	BYTEARRAY                                                    encoding; /* 36 */
	jint                                                         encodingRead; /* 40 */
}; /* 44 bytes */

struct INSTANCE_iaik_me_security_PrivateKey_s
{
	struct INSTANCE_iaik_me_security_CryptoBag_s                 super; /* 0 */
}; /* 20 bytes */

struct INSTANCE_iaik_me_security_PublicKey_s
{
	struct INSTANCE_iaik_me_security_CryptoBag_s                 super; /* 0 */
	STRING_INSTANCE                                              algorithmId; /* 20 */
}; /* 24 bytes */

struct INSTANCE_iaik_me_security_cipher_AES_s
{
	struct INSTANCE_iaik_me_security_Cipher_s                    super; /* 0 */
	INTARRAY                                                     tempInts; /* 44 */
	INTARRAY                                                     block; /* 48 */
	jint                                                         iv0; /* 52 */
	jint                                                         iv1; /* 56 */
	jint                                                         iv2; /* 60 */
	jint                                                         iv3; /* 64 */
	jint                                                         origIv0; /* 68 */
	jint                                                         origIv1; /* 72 */
	jint                                                         origIv2; /* 76 */
	jint                                                         origIv3; /* 80 */
	jint                                                         R; /* 84 */
	INTARRAY                                                     K; /* 88 */
}; /* 92 bytes */

struct INSTANCE_iaik_me_security_cipher_ARCFOUR_s
{
	struct INSTANCE_iaik_me_security_Cipher_s                    super; /* 0 */
	INTARRAY                                                     state; /* 44 */
	jint                                                         x; /* 48 */
	jint                                                         y; /* 52 */
}; /* 56 bytes */

struct INSTANCE_iaik_me_security_md_MD2_s
{
	struct INSTANCE_iaik_me_security_MessageDigest_s             super; /* 0 */
	INTARRAY                                                     X; /* 40 */
	INTARRAY                                                     C; /* 44 */
	BYTEARRAY                                                    temp; /* 48 */
}; /* 52 bytes */

struct INSTANCE_iaik_me_security_md_MD5_s
{
	struct INSTANCE_iaik_me_security_MessageDigest_s             super; /* 0 */
	INTARRAY                                                     state; /* 40 */
	INTARRAY                                                     M; /* 44 */
	BYTEARRAY                                                    bits; /* 48 */
}; /* 52 bytes */

struct INSTANCE_iaik_me_security_md_SHA_s
{
	struct INSTANCE_iaik_me_security_MessageDigest_s             super; /* 0 */
	INTARRAY                                                     state; /* 40 */
	BYTEARRAY                                                    bits; /* 44 */
	INTARRAY                                                     W; /* 48 */
}; /* 52 bytes */

struct INSTANCE_iaik_me_security_md_SHA256_s
{
	struct INSTANCE_iaik_me_security_MessageDigest_s             super; /* 0 */
	struct INSTANCE_iaik_me_security_md_sha256_SHA256Digest_s *  digest; /* 40 */
}; /* 44 bytes */

struct INSTANCE_iaik_me_security_md_sha256_SHA256Digest_s
{
	struct INSTANCE_iaik_me_security_md_sha256_GeneralDigest_s   super; /* 0 */
	jint                                                         H1; /* 32 */
	jint                                                         H2; /* 36 */
	jint                                                         H3; /* 40 */
	jint                                                         H4; /* 44 */
	jint                                                         H5; /* 48 */
	jint                                                         H6; /* 52 */
	jint                                                         H7; /* 56 */
	jint                                                         H8; /* 60 */
	INTARRAY                                                     X; /* 64 */
	jint                                                         xOff; /* 68 */
}; /* 72 bytes */

struct INSTANCE_iaik_me_security_rsa_RSA_s
{
	struct INSTANCE_iaik_me_security_Cipher_s                    super; /* 0 */
	struct INSTANCE_iaik_me_security_CryptoBag_s *               key; /* 44 */
	jint                                                         blockType; /* 48 */
	struct INSTANCE_iaik_me_security_SecureRandom_s *            random; /* 52 */
	jint                                                         padding; /* 56 */
	struct INSTANCE_java_util_Vector_s *                         tempData; /* 60 */
	jint                                                         tempDataSize; /* 64 */
}; /* 68 bytes */

struct INSTANCE_iaik_me_security_rsa_RSASignature_s
{
	struct INSTANCE_iaik_me_security_Signature_s                 super; /* 0 */
	struct INSTANCE_iaik_me_security_Cipher_s *                  rsa; /* 20 */
}; /* 24 bytes */

struct INSTANCE_iaik_me_security_ssl_AlertMessage_s
{
	struct INSTANCE_iaik_me_security_ssl_SSLMessage_s            super; /* 0 */
	jint                                                         alert_level; /* 12 */
	jint                                                         alert_description; /* 16 */
}; /* 20 bytes */

struct INSTANCE_iaik_me_security_ssl_OutputRecord_s
{
	struct INSTANCE_java_io_OutputStream_s                       super; /* 0 */
	BYTEARRAY                                                    tbuf; /* 12 */
	BYTEARRAY                                                    buf; /* 16 */
	jint                                                         count; /* 20 */
	struct INSTANCE_java_io_OutputStream_s *                     outputStream; /* 24 */
	struct INSTANCE_iaik_me_security_Cipher_s *                  write_cipher; /* 28 */
	struct INSTANCE_iaik_me_security_ssl_MAC_s *                 write_mac; /* 32 */
	jint                                                         last; /* 36 */
	struct INSTANCE_iaik_me_security_ssl_SSLTransport_s *        transport; /* 40 */
	jint                                                         activeVersion; /* 44 */
	jint                                                         cipher_type; /* 48 */
	jint                                                         blockSize; /* 52 */
	jint                                                         messageStart; /* 56 */
	jint                                                         maxMessageSize; /* 60 */
	jint                                                         messageSize; /* 64 */
	jint                                                         dataRecordsWritten; /* 68 */
	jint                                                         dataBytes; /* 72 */
	jint                                                         dataBytesNet; /* 76 */
	jint                                                         otherRecordsWritten; /* 80 */
	jint                                                         otherBytes; /* 84 */
}; /* 88 bytes */

struct INSTANCE_iaik_me_security_ssl_SSLConnection_s
{
	struct INSTANCE_iaik_me_security_ssl_SSLTransportSpi_s       super; /* 0 */
	struct INSTANCE_iaik_me_security_ssl_SSLTransport_s *        transport; /* 16 */
	STRING_INSTANCE                                              hostid; /* 20 */
	struct INSTANCE_javax_microedition_io_StreamConnection_s *   connection; /* 24 */
	struct INSTANCE_java_io_OutputStream_s *                     out; /* 28 */
	struct INSTANCE_java_io_InputStream_s *                      in; /* 32 */
}; /* 36 bytes */

struct INSTANCE_iaik_me_security_ssl_SSLInputStream_s
{
	struct INSTANCE_java_io_InputStream_s                        super; /* 0 */
	struct INSTANCE_iaik_me_security_ssl_SSLTransport_s *        transport; /* 12 */
	struct INSTANCE_java_io_InputStream_s *                      is; /* 16 */
	struct INSTANCE_iaik_me_security_ssl_InputRecord_s *         ir; /* 20 */
	struct INSTANCE_iaik_me_security_ssl_OutputRecord_s *        orec; /* 24 */
	BYTEARRAY                                                    oneByte; /* 28 */
}; /* 32 bytes */

struct INSTANCE_iaik_me_security_ssl_SSLOutputStream_s
{
	struct INSTANCE_java_io_OutputStream_s                       super; /* 0 */
	struct INSTANCE_iaik_me_security_ssl_SSLTransport_s *        transport; /* 12 */
	struct INSTANCE_java_io_OutputStream_s *                     os; /* 16 */
	jboolean                                                     autoflush; /* 20 */
	char pad21[3]; /* pad to offset 24 */
}; /* 24 bytes */

struct INSTANCE_iaik_me_utils_SysUtilME_s
{
	struct INSTANCE_iaik_me_utils_SysUtil_s                      super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_java_io_ByteArrayInputStream_s
{
	struct INSTANCE_java_io_InputStream_s                        super; /* 0 */
	BYTEARRAY                                                    buf; /* 12 */
	jint                                                         pos; /* 16 */
	jint                                                         mark; /* 20 */
	jint                                                         count; /* 24 */
}; /* 28 bytes */

struct INSTANCE_java_io_ByteArrayOutputStream_s
{
	struct INSTANCE_java_io_OutputStream_s                       super; /* 0 */
	BYTEARRAY                                                    buf; /* 12 */
	jint                                                         count; /* 16 */
}; /* 20 bytes */

struct INSTANCE_java_io_DataInputStream_s
{
	struct INSTANCE_java_io_InputStream_s                        super; /* 0 */
	struct INSTANCE_java_io_InputStream_s *                      in; /* 12 */
}; /* 16 bytes */

struct INSTANCE_java_io_DataOutputStream_s
{
	struct INSTANCE_java_io_OutputStream_s                       super; /* 0 */
	struct INSTANCE_java_io_OutputStream_s *                     out; /* 12 */
}; /* 16 bytes */

struct INSTANCE_java_io_InputStreamReader_s
{
	struct INSTANCE_java_io_Reader_s                             super; /* 0 */
	struct INSTANCE_java_io_InputStream_s *                      in; /* 20 */
	struct INSTANCE_com_jbed_io_CharConverter_s *                conv; /* 24 */
	BYTEARRAY                                                    tmpBuf; /* 28 */
	CHARARRAY                                                    charBuf_; /* 32 */
}; /* 36 bytes */

struct INSTANCE_java_io_OutputStreamWriter_s
{
	struct INSTANCE_java_io_Writer_s                             super; /* 0 */
	struct INSTANCE_java_io_OutputStream_s *                     out; /* 20 */
	struct INSTANCE_com_jbed_io_CharConverter_s *                conv; /* 24 */
	CHARARRAY                                                    strBuf; /* 28 */
	BYTEARRAY                                                    tmpBuf; /* 32 */
}; /* 36 bytes */

struct INSTANCE_java_io_PrintStream_s
{
	struct INSTANCE_java_io_OutputStream_s                       super; /* 0 */
	jboolean                                                     trouble; /* 12 */
	char pad13[3]; /* pad to offset 16 */
	struct INSTANCE_java_io_OutputStreamWriter_s *               charOut; /* 16 */
	struct INSTANCE_java_io_OutputStream_s *                     byteOut; /* 20 */
	jboolean                                                     closing; /* 24 */
	char pad25[3]; /* pad to offset 28 */
}; /* 28 bytes */

struct INSTANCE_java_lang_Error_s
{
	struct INSTANCE_java_lang_Throwable_s                        super; /* 0 */
}; /* 20 bytes */

struct INSTANCE_java_lang_Exception_s
{
	struct INSTANCE_java_lang_Throwable_s                        super; /* 0 */
}; /* 20 bytes */

struct INSTANCE_java_lang_ref_WeakReference_s
{
	struct INSTANCE_java_lang_ref_Reference_s                    super; /* 0 */
}; /* 32 bytes */

struct INSTANCE_java_util_Calendar_00024Impl_s
{
	struct INSTANCE_java_util_Calendar_s                         super; /* 0 */
}; /* 40 bytes */

struct INSTANCE_java_util_Stack_s
{
	struct INSTANCE_java_util_Vector_s                           super; /* 0 */
}; /* 24 bytes */

struct INSTANCE_java_util_TimeZone_00024TimeZoneImpl_s
{
	struct INSTANCE_java_util_TimeZone_s                         super; /* 0 */
	STRING_INSTANCE                                              ID; /* 12 */
	jint                                                         offset; /* 16 */
}; /* 20 bytes */

struct INSTANCE_java_util_Timer_00024TimerWorker_s
{
	struct INSTANCE_java_lang_Thread_s                           super; /* 0 */
	struct INSTANCE_java_util_TimerTask_s *                      head; /* 20 */
	struct INSTANCE_java_util_TimerTask_s *                      toadd; /* 24 */
	jboolean                                                     canceled; /* 28 */
	jboolean                                                     timed_out; /* 29 */
	char pad30[2]; /* pad to offset 32 */
}; /* 32 bytes */

struct INSTANCE_javax_microedition_io_DatagramObject_s
{
	struct INSTANCE_com_sun_cldc_io_GeneralBase_s                super; /* 0 */
	BYTEARRAY                                                    buf; /* 12 */
	jint                                                         off; /* 16 */
	jint                                                         len; /* 20 */
	jint                                                         ipNumber; /* 24 */
	STRING_INSTANCE                                              host; /* 28 */
	jint                                                         port; /* 32 */
	jint                                                         pointer; /* 36 */
}; /* 40 bytes */

struct INSTANCE_javax_microedition_io_HttpProtocolBase_00024BaseInputStream_s
{
	struct INSTANCE_java_io_InputStream_s                        super; /* 0 */
	struct INSTANCE_javax_microedition_io_HttpProtocolBase_s *   parent; /* 12 */
	BYTEARRAY                                                    buf; /* 16 */
}; /* 20 bytes */

struct INSTANCE_javax_microedition_io_HttpProtocolBase_00024BaseOutputStream_s
{
	struct INSTANCE_java_io_OutputStream_s                       super; /* 0 */
	struct INSTANCE_javax_microedition_io_HttpProtocolBase_s *   parent; /* 12 */
	BYTEARRAY                                                    buf; /* 16 */
}; /* 20 bytes */

struct INSTANCE_javax_microedition_io_PrivateInputStream_s
{
	struct INSTANCE_java_io_InputStream_s                        super; /* 0 */
	struct INSTANCE_javax_microedition_io_socket_1Protocol_s *   parent; /* 12 */
	jboolean                                                     eof; /* 16 */
	char pad17[3]; /* pad to offset 20 */
	BYTEARRAY                                                    bytebuf; /* 20 */
}; /* 24 bytes */

struct INSTANCE_javax_microedition_io_PrivateOutputStream_s
{
	struct INSTANCE_java_io_OutputStream_s                       super; /* 0 */
	struct INSTANCE_javax_microedition_io_socket_1Protocol_s *   parent; /* 12 */
	BYTEARRAY                                                    bytebuf; /* 16 */
}; /* 20 bytes */

struct INSTANCE_javax_microedition_io_SmsBinaryMessage_s
{
	struct INSTANCE_javax_microedition_io_SmsMessage_s           super; /* 0 */
	BYTEARRAY                                                    data; /* 32 */
}; /* 36 bytes */

struct INSTANCE_javax_microedition_io_SmsConnectionThread_s
{
	struct INSTANCE_java_lang_Thread_s                           super; /* 0 */
	BYTEARRAY                                                    msisdn; /* 20 */
	jint                                                         msisdnLen; /* 24 */
	BYTEARRAY                                                    data; /* 28 */
	jint                                                         srcPort; /* 32 */
	jint                                                         dstPort; /* 36 */
	jint                                                         type; /* 40 */
	jint                                                         seq_id; /* 44 */
	jint                                                         seq_idx; /* 48 */
	jint                                                         seq_len; /* 52 */
	jlong                                                        timestamp; /* 56 */
	jint                                                         isCbs; /* 64 */
	jint                                                         scratch; /* 68 */
}; /* 72 bytes */

struct INSTANCE_javax_microedition_io_SmsIncompleteMessage_s
{
	struct INSTANCE_javax_microedition_io_SmsMessage_s           super; /* 0 */
	jint                                                         nroffragments; /* 32 */
	REFARRAY                                                     fragments; /* 36 */
	jint                                                         nrpresentfragments; /* 40 */
	jint                                                         encoding; /* 44 */
	jint                                                         sequenceid; /* 48 */
	jboolean                                                     invalid; /* 52 */
	char pad53[3]; /* pad to offset 56 */
}; /* 56 bytes */

struct INSTANCE_javax_microedition_io_SmsTextMessage_s
{
	struct INSTANCE_javax_microedition_io_SmsMessage_s           super; /* 0 */
	STRING_INSTANCE                                              payloadText; /* 32 */
}; /* 36 bytes */

struct INSTANCE_javax_microedition_io_fc_1Protocol_s
{
	struct INSTANCE_com_jbed_io_JbedFileConnection_s             super; /* 0 */
	STRING_INSTANCE                                              host; /* 96 */
	STRING_INSTANCE                                              fullPath; /* 100 */
	STRING_INSTANCE                                              platformParentPath; /* 104 */
	STRING_INSTANCE                                              parentPath; /* 108 */
	STRING_INSTANCE                                              fileName; /* 112 */
}; /* 116 bytes */

struct INSTANCE_javax_microedition_io_http_1Protocol_s
{
	struct INSTANCE_javax_microedition_io_HttpProtocolBase_s     super; /* 0 */
}; /* 152 bytes */

struct INSTANCE_javax_microedition_io_httpsConnect_s
{
	struct INSTANCE_javax_microedition_io_httpsConnectBase_s     super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_javax_microedition_io_https_1Protocol_s
{
	struct INSTANCE_javax_microedition_io_HttpProtocolBase_s     super; /* 0 */
	struct INSTANCE_javax_microedition_io_SecureConnection_s *   sslConnection; /* 152 */
}; /* 156 bytes */

struct INSTANCE_javax_microedition_lcdui_Canvas_s
{
	struct INSTANCE_javax_microedition_lcdui_Displayable_s       super; /* 0 */
	jboolean                                                     fFullScreenMode; /* 52 */
	jboolean                                                     fSuppressKeyEvents; /* 53 */
	char pad54[2]; /* pad to offset 56 */
	jint                                                         fKeyStates; /* 56 */
	jint                                                         fKeyDown; /* 60 */
	jint                                                         fRepaintState; /* 64 */
	jint                                                         fRepaintRegionX; /* 68 */
	jint                                                         fRepaintRegionY; /* 72 */
	jint                                                         fRepaintRegionWidth; /* 76 */
	jint                                                         fRepaintRegionHeight; /* 80 */
	struct INSTANCE_com_jbed_midp_lcdui_model_CanvasListener_s *  fCanvasListener; /* 84 */
	struct INSTANCE_com_jbed_util_FastVector_s *                 fCanvasListeners; /* 88 */
	struct INSTANCE_java_lang_Object_s *                         fGraphicsLock; /* 92 */
	jboolean                                                     fInsidePaint; /* 96 */
	char pad97[3]; /* pad to offset 100 */
}; /* 100 bytes */

struct INSTANCE_javax_microedition_lcdui_ChoiceGroup_s
{
	struct INSTANCE_javax_microedition_lcdui_Item_s              super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_ChoiceModel_s *     fModel; /* 60 */
}; /* 64 bytes */

struct INSTANCE_javax_microedition_lcdui_CustomItem_s
{
	struct INSTANCE_javax_microedition_lcdui_Item_s              super; /* 0 */
	jint                                                         fRepaintState; /* 60 */
	jint                                                         fRepaintRegionX; /* 64 */
	jint                                                         fRepaintRegionY; /* 68 */
	jint                                                         fRepaintRegionWidth; /* 72 */
	jint                                                         fRepaintRegionHeight; /* 76 */
	jboolean                                                     fShown; /* 80 */
	char pad81[3]; /* pad to offset 84 */
}; /* 84 bytes */

struct INSTANCE_javax_microedition_lcdui_DateField_s
{
	struct INSTANCE_javax_microedition_lcdui_Item_s              super; /* 0 */
	jint                                                         fMode; /* 60 */
	struct INSTANCE_java_util_TimeZone_s *                       fTimeZone; /* 64 */
	jboolean                                                     fValid; /* 68 */
	char pad69[3]; /* pad to offset 72 */
	struct INSTANCE_java_util_Calendar_s *                       fCalendar; /* 72 */
}; /* 76 bytes */

struct INSTANCE_javax_microedition_lcdui_Display_00024ScreenUpdateTask_s
{
	/* Type of field "fPaintStrategies" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.midp.lcdui.lookandfeel.PaintStrategies;" */
	struct INSTANCE_com_jbed_midp_lcdui_ScreenRefresher_00024Task_s super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         fPaintStrategies; /* 16 */
	jint                                                         fX; /* 20 */
	jint                                                         fY; /* 24 */
	jint                                                         fWidth; /* 28 */
	jint                                                         fHeight; /* 32 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         this_000240; /* 36 */
}; /* 40 bytes */

struct INSTANCE_javax_microedition_lcdui_GameCanvasGraphics_s
{
	struct INSTANCE_javax_microedition_lcdui_Graphics_s          super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_GameCanvasGraphics_00024Listener_s *  fListener; /* 124 */
	INTARRAY                                                     fOperationBoundingBox; /* 128 */
}; /* 132 bytes */

struct INSTANCE_javax_microedition_lcdui_Gauge_s
{
	struct INSTANCE_javax_microedition_lcdui_Item_s              super; /* 0 */
	jboolean                                                     fInteractive; /* 60 */
	char pad61[3]; /* pad to offset 64 */
	jint                                                         fMaxValue; /* 64 */
	jint                                                         fValue; /* 68 */
	struct INSTANCE_javax_microedition_lcdui_Alert_s *           fAlert; /* 72 */
}; /* 76 bytes */

struct INSTANCE_javax_microedition_lcdui_ImageGraphics_s
{
	struct INSTANCE_javax_microedition_lcdui_Graphics_s          super; /* 0 */
}; /* 124 bytes */

struct INSTANCE_javax_microedition_lcdui_ImageItem_s
{
	struct INSTANCE_javax_microedition_lcdui_Item_s              super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Image_s *           fImage; /* 60 */
	struct INSTANCE_javax_microedition_lcdui_Image_s *           fImmutableImage; /* 64 */
	STRING_INSTANCE                                              fAltText; /* 68 */
	jint                                                         fAppearance; /* 72 */
	jint                                                         fDynamicAppearance; /* 76 */
}; /* 80 bytes */

struct INSTANCE_javax_microedition_lcdui_ImmutableImage_s
{
	struct INSTANCE_javax_microedition_lcdui_Image_s             super; /* 0 */
}; /* 32 bytes */

struct INSTANCE_javax_microedition_lcdui_ItemLayoutInfo_s
{
	struct INSTANCE_javax_microedition_lcdui_LayoutInfo_s        super; /* 0 */
}; /* 28 bytes */

struct INSTANCE_javax_microedition_lcdui_MultiChoiceModel_s
{
	struct INSTANCE_javax_microedition_lcdui_ChoiceModel_s       super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_MultiChoiceModel_00024LabelModifiableCommand_s *  fMarkCommand; /* 36 */
	BOOLEANARRAY                                                 fSelected; /* 40 */
}; /* 44 bytes */

struct INSTANCE_javax_microedition_lcdui_MultiChoiceModel_00024LabelModifiableCommand_s
{
	struct INSTANCE_javax_microedition_lcdui_Command_s           super; /* 0 */
	STRING_INSTANCE                                              fLabel; /* 32 */
}; /* 36 bytes */

struct INSTANCE_javax_microedition_lcdui_MutableImage_s
{
	struct INSTANCE_javax_microedition_lcdui_Image_s             super; /* 0 */
}; /* 32 bytes */

struct INSTANCE_javax_microedition_lcdui_Screen_s
{
	struct INSTANCE_javax_microedition_lcdui_Displayable_s       super; /* 0 */
}; /* 52 bytes */

struct INSTANCE_javax_microedition_lcdui_SingleChoiceModel_s
{
	struct INSTANCE_javax_microedition_lcdui_ChoiceModel_s       super; /* 0 */
	jint                                                         fSelectedIndex; /* 36 */
	struct INSTANCE_javax_microedition_lcdui_Command_s *         fChoiceCommand; /* 40 */
}; /* 44 bytes */

struct INSTANCE_javax_microedition_lcdui_Spacer_s
{
	struct INSTANCE_javax_microedition_lcdui_Item_s              super; /* 0 */
	jint                                                         fMinWidth; /* 60 */
	jint                                                         fMinHeight; /* 64 */
}; /* 68 bytes */

struct INSTANCE_javax_microedition_lcdui_StringItem_s
{
	struct INSTANCE_javax_microedition_lcdui_Item_s              super; /* 0 */
	STRING_INSTANCE                                              fText; /* 60 */
	jint                                                         fAppearance; /* 64 */
	jint                                                         fDynamicAppearance; /* 68 */
	struct INSTANCE_javax_microedition_lcdui_Font_s *            fFont; /* 72 */
}; /* 76 bytes */

struct INSTANCE_javax_microedition_lcdui_TextField_s
{
	struct INSTANCE_javax_microedition_lcdui_Item_s              super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_TextModel_s *       fText; /* 60 */
	struct INSTANCE_javax_microedition_lcdui_TextModel_s *       fBackText; /* 64 */
	jint                                                         fConstraints; /* 68 */
	STRING_INSTANCE                                              fInitialInputMode; /* 72 */
}; /* 76 bytes */

struct INSTANCE_javax_microedition_lcdui_game_GameCanvas_00024GameCanvasRefreshTask_s
{
	struct INSTANCE_com_jbed_midp_lcdui_ScreenRefresher_00024Task_s super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_game_GameCanvas_s *  fGameCanvas; /* 16 */
	struct INSTANCE_javax_microedition_lcdui_Image_s *           fBufferToDraw; /* 20 */
	jboolean                                                     fFlushOnScreenBitmap; /* 24 */
	char pad25[3]; /* pad to offset 28 */
	struct INSTANCE_javax_microedition_lcdui_game_GameCanvas_s *  this_000240; /* 28 */
}; /* 32 bytes */

struct INSTANCE_javax_microedition_lcdui_game_Sprite_s
{
	struct INSTANCE_javax_microedition_lcdui_game_Layer_s        super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Image_s *           sourceImage; /* 32 */
	jint                                                         numberFrames; /* 36 */
	INTARRAY                                                     frameCoordsX; /* 40 */
	INTARRAY                                                     frameCoordsY; /* 44 */
	jint                                                         srcFrameWidth; /* 48 */
	jint                                                         srcFrameHeight; /* 52 */
	INTARRAY                                                     frameSequence; /* 56 */
	jint                                                         sequenceIndex; /* 60 */
	jboolean                                                     customSequenceDefined; /* 64 */
	char pad65[3]; /* pad to offset 68 */
	jint                                                         dRefX; /* 68 */
	jint                                                         dRefY; /* 72 */
	jint                                                         collisionRectX; /* 76 */
	jint                                                         collisionRectY; /* 80 */
	jint                                                         collisionRectWidth; /* 84 */
	jint                                                         collisionRectHeight; /* 88 */
	jint                                                         t_currentTransformation; /* 92 */
	jint                                                         t_collisionRectX; /* 96 */
	jint                                                         t_collisionRectY; /* 100 */
	jint                                                         t_collisionRectWidth; /* 104 */
	jint                                                         t_collisionRectHeight; /* 108 */
}; /* 112 bytes */

struct INSTANCE_javax_microedition_lcdui_game_TiledLayer_s
{
	struct INSTANCE_javax_microedition_lcdui_game_Layer_s        super; /* 0 */
	jint                                                         cellHeight; /* 32 */
	jint                                                         cellWidth; /* 36 */
	jint                                                         rows; /* 40 */
	jint                                                         columns; /* 44 */
	REFARRAY                                                     cellMatrix; /* 48 */
	struct INSTANCE_javax_microedition_lcdui_Image_s *           sourceImage; /* 52 */
	jint                                                         numberOfTiles; /* 56 */
	INTARRAY                                                     tileSetX; /* 60 */
	INTARRAY                                                     tileSetY; /* 64 */
	INTARRAY                                                     anim_to_static; /* 68 */
	jint                                                         numOfAnimTiles; /* 72 */
}; /* 76 bytes */

struct INSTANCE_javax_microedition_rms_RecordStorePeer_s
{
	struct INSTANCE_javax_microedition_rms_RecordStorePeerBase_s super; /* 0 */
	STRING_INSTANCE                                              recordStoreName; /* 12 */
	STRING_INSTANCE                                              recordStoreRoot; /* 16 */
	jint                                                         opencount; /* 20 */
	jint                                                         freeSpace; /* 24 */
	struct INSTANCE_com_jbed_ams_RecordStoreFile_s *             dbraf; /* 28 */
	struct INSTANCE_javax_microedition_rms_RecordStorePeer_00024RecordHeaderCache_s *  recHeadCache; /* 32 */
	jint                                                         dbNextRecordID; /* 36 */
	jint                                                         dbVersion; /* 40 */
	jint                                                         dbAuthMode; /* 44 */
	jint                                                         dbNumLiveRecords; /* 48 */
	char pad52[4]; /* pad to offset 56 */
	jlong                                                        dbLastModified; /* 56 */
	jint                                                         dbFirstRecordOffset; /* 64 */
	jint                                                         oldDbFirstRecordOffset; /* 68 */
	jint                                                         dbFirstFreeBlockOffset; /* 72 */
	jint                                                         dbDataStart; /* 76 */
	jint                                                         dbDataEnd; /* 80 */
	jint                                                         oldDbDataEnd; /* 84 */
	BYTEARRAY                                                    dbBuf; /* 88 */
}; /* 92 bytes */

struct INSTANCE_com_jbed_ams_AmsFolderException_s
{
	struct INSTANCE_java_lang_Exception_s                        super; /* 0 */
	jint                                                         id; /* 20 */
	STRINGARRAY                                                  params; /* 24 */
}; /* 28 bytes */

struct INSTANCE_com_jbed_ams_BlankScreenCanvas_s
{
	struct INSTANCE_javax_microedition_lcdui_Canvas_s            super; /* 0 */
	jint                                                         bgColor; /* 100 */
}; /* 104 bytes */

struct INSTANCE_com_jbed_ams_Manager_000241_s
{
	struct INSTANCE_com_jbed_ams_AmsThread_s                     super; /* 0 */
	struct INSTANCE_com_jbed_ams_Manager_s *                     this_000240; /* 20 */
}; /* 24 bytes */

struct INSTANCE_com_jbed_ams_SplashScreenCanvas_s
{
	struct INSTANCE_javax_microedition_lcdui_Canvas_s            super; /* 0 */
	struct INSTANCE_javax_microedition_lcdui_Displayable_s *     next; /* 100 */
	struct INSTANCE_javax_microedition_lcdui_Display_s *         display; /* 104 */
	struct INSTANCE_javax_microedition_lcdui_Image_s *           image; /* 108 */
	jboolean                                                     started; /* 112 */
	jboolean                                                     done; /* 113 */
	jboolean                                                     nextOnKey; /* 114 */
	char pad115[1]; /* pad to offset 116 */
	jint                                                         x; /* 116 */
	jint                                                         y; /* 120 */
	jint                                                         w; /* 124 */
	jint                                                         h; /* 128 */
	jint                                                         timeout; /* 132 */
	jint                                                         bgColor; /* 136 */
	jint                                                         fgColor; /* 140 */
	struct INSTANCE_javax_microedition_lcdui_CommandListener_s *  listener; /* 144 */
	struct INSTANCE_java_lang_Object_s *                         notifyMeWhenDone; /* 148 */
	STRING_INSTANCE                                              pinCode; /* 152 */
	jint                                                         pinIndex; /* 156 */
	struct INSTANCE_java_lang_Runnable_s *                       pinHandler; /* 160 */
	struct INSTANCE_com_jbed_midp_lcdui_lookandfeel_EventLoop_00024Canceller_s *  timeoutEvent; /* 164 */
}; /* 168 bytes */

struct INSTANCE_com_jbed_ams_SuiteProperties_s
{
	struct INSTANCE_com_jbed_ams_BaseProperties_s                super; /* 0 */
