/* Copyright 2004-2009 Myriad Group AG. All Rights Reserved. */
/* THIS FILE IS AUTOMATICALLY GENERATED */

#ifndef _JBED_JBEDCOREINSTANCE_H_
#define _JBED_JBEDCOREINSTANCE_H_

#if defined(__cplusplus)
extern "C" {
#endif
typedef struct INSTANCE_java_lang_Object_s* INSTANCE;

typedef struct booleanArrayStruct* BOOLEANARRAY;

typedef struct byteArrayStruct* BYTEARRAY;

typedef struct shortArrayStruct* SHORTARRAY;

typedef struct charArrayStruct* CHARARRAY;

typedef struct intArrayStruct* INTARRAY;

typedef struct longArrayStruct* LONGARRAY;

typedef struct legacyArrayStruct* ARRAY;

typedef struct refArrayStruct* REFARRAY;

typedef struct stringArrayStruct* STRINGARRAY;

typedef struct INSTANCE_java_lang_Class_s* CLASS_INSTANCE;

typedef struct INSTANCE_java_lang_String_s* STRING_INSTANCE;

typedef struct INSTANCE_java_lang_Throwable_s* THROWABLE_INSTANCE;

#ifndef _JBED_INSTANCE_java_lang_Object_s_H_
#define _JBED_INSTANCE_java_lang_Object_s_H_
struct INSTANCE_java_lang_Object_s
{
	jint                                                         tag; /* 0 */
	jint                                                         mark; /* 4 */
	jint                                                         synchRef; /* 8 */
}; /* 12 bytes */
#endif /* _JBED_INSTANCE_java_lang_Object_s_H_ */

struct booleanArrayStruct
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         length; /* 12 */
	jboolean                                                     data[1]; /* 16 */
	char pad17[3]; /* pad to offset 20 */
}; /* 20 bytes */

struct byteArrayStruct
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         length; /* 12 */
	jbyte                                                        data[1]; /* 16 */
	char pad17[3]; /* pad to offset 20 */
}; /* 20 bytes */

struct shortArrayStruct
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         length; /* 12 */
	jshort                                                       data[1]; /* 16 */
	char pad18[2]; /* pad to offset 20 */
}; /* 20 bytes */

struct charArrayStruct
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         length; /* 12 */
	jchar                                                        data[1]; /* 16 */
	char pad18[2]; /* pad to offset 20 */
}; /* 20 bytes */

struct intArrayStruct
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         length; /* 12 */
	jint                                                         data[1]; /* 16 */
}; /* 20 bytes */

struct longArrayStruct
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         length; /* 12 */
	jlong                                                        data[1]; /* 16 */
}; /* 24 bytes */

struct legacyArrayStruct
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         length; /* 12 */
	struct INSTANCE_java_lang_Object_s *                         data[1]; /* 16 */
}; /* 20 bytes */

struct refArrayStruct
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         length; /* 12 */
	struct INSTANCE_java_lang_Object_s *                         data[1]; /* 16 */
}; /* 20 bytes */

struct stringArrayStruct
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         length; /* 12 */
	STRING_INSTANCE                                              data[1]; /* 16 */
}; /* 20 bytes */

struct INSTANCE_java_lang_Class_s
{
	/* Type of field "methods" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.reflect.DynamicMethod;" */
	/* Type of field "fields" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.reflect.Field;" */
	/* Type of field "pool" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.tbcc.Pool;" */
	/* Type of field "dynClassAccess" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.reflect.ClassAccess;" */
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	jint                                                         modifiers; /* 12 */
	jint                                                         classId; /* 16 */
	struct INSTANCE_java_lang_Class_s *                          base; /* 20 */
	REFARRAY                                                     interfaces; /* 24 */
	jint                                                         size; /* 28 */
	jshort                                                       level; /* 32 */
	jshort                                                       tsize; /* 34 */
	jint                                                         classTag; /* 36 */
	jint                                                         defConstr; /* 40 */
	jint                                                         initializer; /* 44 */
	jint                                                         initFlags; /* 48 */
	jchar                                                        numMeth; /* 52 */
	jchar                                                        numField; /* 54 */
	struct INSTANCE_java_lang_Object_s *                         dynClassAccess; /* 56 */
	jchar                                                        baseId; /* 60 */
	jchar                                                        pkgId; /* 62 */
	jchar                                                        arrayLevel; /* 64 */
	char pad66[2]; /* pad to offset 68 */
	jint                                                         tbccLabel; /* 68 */
	struct INSTANCE_java_lang_Object_s *                         statics; /* 72 */
	struct INSTANCE_java_lang_Object_s *                         anchor; /* 76 */
	struct INSTANCE_java_lang_Object_s *                         pool; /* 80 */
	STRING_INSTANCE                                              source; /* 84 */
	struct INSTANCE_java_lang_Object_s *                         fields; /* 88 */
	struct INSTANCE_java_lang_Object_s *                         methods; /* 92 */
}; /* 96 bytes */

struct INSTANCE_java_lang_String_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	CHARARRAY                                                    value; /* 12 */
	jint                                                         addr; /* 16 */
	jint                                                         count; /* 20 */
	STRING_INSTANCE                                              next; /* 24 */
	jboolean                                                     interned; /* 28 */
	jboolean                                                     isStatic; /* 29 */
	char pad30[2]; /* pad to offset 32 */
}; /* 32 bytes */

struct INSTANCE_java_lang_Throwable_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_java_lang_Object_s *                         trace; /* 12 */
	STRING_INSTANCE                                              detailMessage; /* 16 */
}; /* 20 bytes */

struct INSTANCE_com_jbed_runtime_Signal_s
{
	/* Type of field "synch" unavailable */
	/*     Using "Ljava.lang.Object;" */
	/*     Instead of "Lcom.jbed.runtime.Synchronizer;" */
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
	struct INSTANCE_com_jbed_runtime_Signal_s *                  next; /* 12 */
	struct INSTANCE_com_jbed_runtime_Signal_s *                  last; /* 16 */
	jboolean                                                     waiting; /* 20 */
	jboolean                                                     signalled; /* 21 */
	jboolean                                                     queued; /* 22 */
	char pad23[1]; /* pad to offset 24 */
	struct INSTANCE_java_lang_Object_s *                         synch; /* 24 */
	struct INSTANCE_java_lang_Object_s *                         objArg; /* 28 */
	jint                                                         arg; /* 32 */
	jint                                                         state; /* 36 */
	jint                                                         notifierCallback; /* 40 */
	jint                                                         invalidateCallback; /* 44 */
	jint                                                         asyncTimeout; /* 48 */
	BYTEARRAY                                                    asyncBuffer; /* 52 */
	jint                                                         vmRef; /* 56 */
}; /* 60 bytes */

struct INSTANCE_com_jbed_runtime_SignalQueue_s
{
	struct INSTANCE_com_jbed_runtime_Signal_s                    super; /* 0 */
	INTARRAY                                                     queue; /* 60 */
	jint                                                         queuePtr; /* 64 */
	jint                                                         evtIn; /* 68 */
	jint                                                         evtOut; /* 72 */
}; /* 76 bytes */

struct INSTANCE_com_jbed_runtime_Jbni_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct INSTANCE_com_jbed_runtime_AsyncIO_s
{
	struct INSTANCE_java_lang_Object_s                           super; /* 0 */
}; /* 12 bytes */

struct __unused___jbed_jbedcoreinstance_h__size_assertions__ {
	char check_0[sizeof(struct INSTANCE_java_lang_Object_s) == 12 ? 1 : -1];
	char check_1[sizeof(struct booleanArrayStruct) == 20 ? 1 : -1];
	char check_2[sizeof(struct byteArrayStruct) == 20 ? 1 : -1];
	char check_3[sizeof(struct shortArrayStruct) == 20 ? 1 : -1];
	char check_4[sizeof(struct charArrayStruct) == 20 ? 1 : -1];
	char check_5[sizeof(struct intArrayStruct) == 20 ? 1 : -1];
	char check_6[sizeof(struct longArrayStruct) == 24 ? 1 : -1];
	char check_7[sizeof(struct legacyArrayStruct) == 20 ? 1 : -1];
	char check_8[sizeof(struct refArrayStruct) == 20 ? 1 : -1];
	char check_9[sizeof(struct stringArrayStruct) == 20 ? 1 : -1];
	char check_10[sizeof(struct INSTANCE_java_lang_Class_s) == 96 ? 1 : -1];
	char check_11[sizeof(struct INSTANCE_java_lang_String_s) == 32 ? 1 : -1];
	char check_12[sizeof(struct INSTANCE_java_lang_Throwable_s) == 20 ? 1 : -1];
	char check_13[sizeof(struct INSTANCE_com_jbed_runtime_Signal_s) == 60 ? 1 : -1];
	char check_14[sizeof(struct INSTANCE_com_jbed_runtime_SignalQueue_s) == 76 ? 1 : -1];
	char check_15[sizeof(struct INSTANCE_com_jbed_runtime_Jbni_s) == 12 ? 1 : -1];
	char check_16[sizeof(struct INSTANCE_com_jbed_runtime_AsyncIO_s) == 12 ? 1 : -1];
};
/* Static Final Constants */
#define STATIC_java_lang_Object_MAX_WAIT (9223372036854775L)
#define STATIC_com_jbed_runtime_AsyncIO_LOOP (5)
#define STATIC_com_jbed_runtime_AsyncIO_TIMEOUT (4)
#define STATIC_com_jbed_runtime_AsyncIO_DONE (3)
#define STATIC_com_jbed_runtime_AsyncIO_DONE0 (2)
#define STATIC_com_jbed_runtime_AsyncIO_BUSY (1)
#define STATIC_com_jbed_runtime_AsyncIO_IDLE (0)
#define STATIC_com_jbed_runtime_Constants_JBED_ISOLATE_ALL (-1)
#define STATIC_com_jbed_runtime_Constants_debugModeFullDebugInfo (4)
#define STATIC_com_jbed_runtime_Constants_debugModeMIDletProfiling (2)
#define STATIC_com_jbed_runtime_Constants_debugModeKdwp (1)
#define STATIC_com_jbed_runtime_Constants_debugModeNone (0)
#define STATIC_com_jbed_runtime_Constants_BAD_CLASS_ID (-32768)
#define STATIC_com_jbed_runtime_Constants_ONLY_THREADGROUP_ID (-32)
#define STATIC_com_jbed_runtime_Constants_sizeOffs (14)
#define STATIC_com_jbed_runtime_Constants_numOffs (12)
#define STATIC_com_jbed_runtime_Constants_valOffs (12)
#define STATIC_com_jbed_runtime_Constants_adrOffs (8)
#define STATIC_com_jbed_runtime_Constants_typeOffs (6)
#define STATIC_com_jbed_runtime_Constants_nameOffs (4)
#define STATIC_com_jbed_runtime_Constants_modOffs (0)
#define STATIC_com_jbed_runtime_Constants_reflFieldSize (16)
#define STATIC_com_jbed_runtime_Constants_reflMethSize (16)
#define STATIC_com_jbed_runtime_Constants_reflClassSize (56)
#define STATIC_com_jbed_runtime_Constants_ACC_PRIMITIVE (16777216)
#define STATIC_com_jbed_runtime_Constants_ACC_CODERANGES (524288)
#define STATIC_com_jbed_runtime_Constants_ACC_RELATIVE (65536)
#define STATIC_com_jbed_runtime_Constants_ACC_IN_PROFILE (-2147483648)
#define STATIC_com_jbed_runtime_Constants_ACC_CONST (16777216)
#define STATIC_com_jbed_runtime_Constants_ACC_DYNAMIC (8388608)
#define STATIC_com_jbed_runtime_Constants_ACC_ARRAY (33554432)
#define STATIC_com_jbed_runtime_Constants_ACC_STATIC (8)
#define STATIC_com_jbed_runtime_Constants_relative (16)
#define STATIC_com_jbed_runtime_Constants_verified (16)
#define STATIC_com_jbed_runtime_Constants_translated (19)
#define STATIC_com_jbed_runtime_Constants_preparing (17)
#define STATIC_com_jbed_runtime_Constants_resolved (30)
#define STATIC_com_jbed_runtime_Constants_prepared (18)
#define STATIC_com_jbed_runtime_Constants_noFrame (18)
#define STATIC_com_jbed_runtime_Constants_noChecks (17)
#define STATIC_com_jbed_runtime_Constants_linked (16)
#define STATIC_com_jbed_runtime_Constants_initializing (20)
#define STATIC_com_jbed_runtime_Constants_initialized (21)
#define STATIC_com_jbed_runtime_Constants_dynamic (23)
#define STATIC_com_jbed_runtime_Constants_classPtrOffset (0)
#define STATIC_com_jbed_runtime_Constants_refTyp (2)
#define STATIC_com_jbed_runtime_Constants_longTyp (11)
#define STATIC_com_jbed_runtime_Constants_intTyp (10)
#define STATIC_com_jbed_runtime_Constants_shortTyp (9)
#define STATIC_com_jbed_runtime_Constants_byteTyp (8)
#define STATIC_com_jbed_runtime_Constants_doubleTyp (7)
#define STATIC_com_jbed_runtime_Constants_floatTyp (6)
#define STATIC_com_jbed_runtime_Constants_charTyp (5)
#define STATIC_com_jbed_runtime_Constants_boolTyp (4)
#define STATIC_com_jbed_runtime_Constants_accDefConstructorPrivate (15)
#define STATIC_com_jbed_runtime_Constants_accDefConstructorPublic (14)
#define STATIC_com_jbed_runtime_Constants_invalidFieldRef (27)
#define STATIC_com_jbed_runtime_Constants_notLeaf (20)
#define STATIC_com_jbed_runtime_Constants_catched (16)
#define STATIC_com_jbed_runtime_Constants_codeRanges (19)
#define STATIC_com_jbed_runtime_Constants_arrayLengthOffset (12)
#define STATIC_com_jbed_runtime_Constants_allocatable (22)
#define STATIC_com_jbed_runtime_Constants_accInProfile (31)
#define STATIC_com_jbed_runtime_Constants_accVolatile (6)
#define STATIC_com_jbed_runtime_Constants_accTransient (7)
#define STATIC_com_jbed_runtime_Constants_accSynchronized (5)
#define STATIC_com_jbed_runtime_Constants_accSuper (5)
#define STATIC_com_jbed_runtime_Constants_accStrict (11)
#define STATIC_com_jbed_runtime_Constants_accStaticInit (29)
#define STATIC_com_jbed_runtime_Constants_accStatic (3)
#define STATIC_com_jbed_runtime_Constants_accPublic (0)
#define STATIC_com_jbed_runtime_Constants_accProtected (2)
#define STATIC_com_jbed_runtime_Constants_accPrivate (1)
#define STATIC_com_jbed_runtime_Constants_accPrimitive (24)
#define STATIC_com_jbed_runtime_Constants_accNativeInline (25)
#define STATIC_com_jbed_runtime_Constants_accNativeCode (24)
#define STATIC_com_jbed_runtime_Constants_accNative (8)
#define STATIC_com_jbed_runtime_Constants_accLocal (25)
#define STATIC_com_jbed_runtime_Constants_accInterface (9)
#define STATIC_com_jbed_runtime_Constants_accInline (27)
#define STATIC_com_jbed_runtime_Constants_accInitializer (28)
#define STATIC_com_jbed_runtime_Constants_accFinalizable (28)
#define STATIC_com_jbed_runtime_Constants_accFinal (4)
#define STATIC_com_jbed_runtime_Constants_accException (27)
#define STATIC_com_jbed_runtime_Constants_accConstructor (26)
#define STATIC_com_jbed_runtime_Constants_accConstant (24)
#define STATIC_com_jbed_runtime_Constants_accArray (25)
#define STATIC_com_jbed_runtime_Constants_accArrInt (26)
#define STATIC_com_jbed_runtime_Constants_accAbstract (10)
#define STATIC_com_jbed_runtime_Jbni_HEAP_NOLOCK (1)
#define STATIC_com_jbed_runtime_Jbni_HEAP_NORMAL (0)
#define STATIC_com_jbed_runtime_Jbni_GC_RELEASE (2)
#define STATIC_com_jbed_runtime_Jbni_GC_COMPACT (1)
#define STATIC_com_jbed_runtime_Jbni_GC_COLLECT (0)
#define STATIC_com_jbed_runtime_Jbni_exIndexOutOfBoundsException (20)
#define STATIC_com_jbed_runtime_Jbni_exIOException (19)
#define STATIC_com_jbed_runtime_Jbni_exOutOfMemoryError (18)
#define STATIC_com_jbed_runtime_Jbni_exIllegalArgumentException (17)
#define STATIC_com_jbed_runtime_Jbni_exStringIndexOutOfBoundsException (16)
#define STATIC_com_jbed_runtime_Jbni_exArrayIndexOutOfBoundsException (1)
#define STATIC_com_jbed_runtime_Jbni_exNullPointerException (0)
#define STATIC_java_lang_String_SIGN (-2147483648)
#define STATIC_java_lang_String_arrayOffset (16)
#define STATIC_com_jbed_runtime_SignalQueue_QUEUE_SIZE (256)
/* End Of Static Final Constants */

#if defined(__cplusplus)
}
#endif
#endif /* _JBED_JBEDCOREINSTANCE_H_ */
