/******************************************************************************/
// File Name:       McfTime.h                                           
// Author:          wilsonzhu wiltan                                 
// DATE:            10/01/2011                                  
// Modifed:         haijunqiu 09/26/2011
// Copyright:       2011 Tencent, Incoporated. All Rights Reserved.
// Description:     用来定义时间相关接口                                                
/******************************************************************************/
#ifndef _MCFTIME_H_
#define _MCFTIME_H_
#ifdef __cplusplus
    extern  "C"
    {
#endif

/******************************************************************************/
//                      include files
/******************************************************************************/
#include "mcfcommon.h"
/******************************************************************************/
//                      Macro Declaration
/******************************************************************************/

/******************************************************************************/
//                      Type and constant
/*****************************************************************************/
/******************************************************************************/
//                      Local variables Declaration
/******************************************************************************/

/******************************************************************************/
//                      Local function extern
/******************************************************************************/


/******************************************************************************/
//	FUNCTION: McfTime_GetSysTimes
//	Descrption:获取系统时间和日期，并转换为mcare平台日期时间
//	Param:  
//	IN:          
//	OUT:        pTime:输出时间
//	Return:     MVOID
//  Note: 
/******************************************************************************/
MVOID McfTime_GetSysTimes(MTime_DateTime* pTime);

#if 0
/******************************************************************************/
//	FUNCTION: McfTime_GetSysTicks
//	Descrption:获取系统ticks
//	Param:  
//	IN:          MVOID
//	OUT:         
//	Return:      当前的系统ticks
//  Note: 
/******************************************************************************/
MUINT McfTime_GetSysTicks(MVOID);
#endif

/******************************************************************************/
//	FUNCTION: McfTime_GetSysTimeMs
//	Descrption:获取系统毫秒数
//	Param:  
//	IN:          MVOID
//	OUT:         
//	Return:      当前的系统tick对应的MS
//  Note: 
/******************************************************************************/
MUINT McfTime_GetSysTimeMs(MVOID);

#if 0
/******************************************************************************/
//	FUNCTION: McfTime_TicksToMilliSecs
//	Descrption:获取系统毫秒数
//	Param:  
//	IN:          nTicks:待转换的TICKS
//	OUT:         
//	Return:      当前的tickS对应的MS
//  Note: 
/******************************************************************************/
MUINT McfTime_TicksToMilliSecs(MUINT nTicks);
#endif

/******************************************************************************/

#ifdef __cplusplus
    }
#endif


#endif//#ifndef _MCFTIME_H_

