/*
 * <sprd_codec_ap_phy_sc2720.h> - <codec ap control.>
 *
 * Copyright (c) 2019 Unisoc Communications Inc.
 * History
 *      <15/04/2021> <yuzhen.long> <create> *      
 *      codec ap control for sc2720.
 */
#ifndef __SPRD_CODEC_AP_PHY_SC2720_H___
#define __SPRD_CODEC_AP_PHY_SC2720_H___

/**---------------------------------------------------------------------------*
 **                         Dependencies                                      *
 **---------------------------------------------------------------------------*/
#include "chip_plf_export.h"

/**---------------------------------------------------------------------------*
 **                       A Die codec analog part                             *
 **                         Register description                              *
 **---------------------------------------------------------------------------*/

#define MASK_1_BIT 0x1
#define MASK_2_BITS 0x3
#define MASK_3_BITS 0x7
#define MASK_4_BITS 0xf
#define MASK_5_BITS 0x1f
#define MASK_6_BITS 0x3f
#define MASK_7_BITS 0x7f
#define MASK_8_BITS 0xff
#define MASK_16_BITS 0xffff

#define CHIP_ID_2720 0x2720
#define CHIP_ID_2721 0x2721

/// ANA_PMU0 0x00 ///

/* RG_AUD_VB_EN [15] RW 0 Audio LDO VB enable signal
 * RG_AUD_VB_NLEAK_PD [14] RW 0 Audio LDO VB prevent reverse flow back power down signal
                                        0 = power up        1 = power down
 * RG_AUD_VB_HDMC_SP_PD     [13]    RW  0x1 Audio LDO VB SLEEP MODE PD signal

 * RG_AUD_PA_OTP_FLAG       [4]     RO  0   Audio PA over temperature protection circuit alert signal
                                            0 = normal          1 = over temperature
 * RG_AUD_DRV_OCP_FLAG      [3:0]   RO  0   Audio Driver over current protection circuit alert signal
                                            <3:2> for SPK       <1:0> for Headphone/Earpiece */
#define HEAD_INSERT_ALL		(BIT_12)
#define HEAD_INSERT3		(BIT_11)
#define HEAD_INSERT2		(BIT_10)
#define HEAD_INSERT		    (BIT_9)
#define HEAD_BUTTON		    (BIT_8)
#define PA_SH_FLAG		    (BIT_7)
#define PA_SL_FLAG		    (BIT_6)
#define PA_OVP_FLAG		    (BIT_5)
#define PA_OTP_FLAG		    (BIT_4)
#define DRV_OCP_FLAG_SPK	(BIT_2)
#define DRV_OCP_FLAG_HPRCV	(0)
#define DRV_OCP_FLAG_MASK	(MASK_2_BITS << DRV_OCP_FLAG_HPRCV)

/// ANA_CLK1 0x7C ///
/* RG_AUD_DCDCGEN_CLK_F   [15: 14]  RW 0    DCDC GEN/MEM clock frequency select (based on Fclk=6.5MHz)
                                            00 = Fclk/4              01 = Fclk / 3
                                            10/11 = Fclk / 2
 * RG_AUD_DCDCCORE_CLK_F  [13: 12]  RW 0    DCDC CORE clock frequency select (based on Fclk=6.5MHz)
                                            00 = Fclk/4              01 = Fclk / 3
                                            10/11 = Fclk / 2
 * RG_AUD_DCDCCHG_CLK_F   [11: 10]  RW 0    DCDC CHG clock frequency select (based on Fclk=6.5MHz)
                                            00 = Fclk/4              01 = Fclk / 3
                                            10/11 = Fclk / 2
 * RG_AUD_PA_CLK_F        [9: 8]    RW 0    Audio PA clock frequency select (based on ADC Clock)
                                            00 = 1/2                  01 = 1/4
                                            10 = 1/8                  11 = 1/16
 * RG_AUD_CLK_PN_SEL      [7: 0]    RW 4    Audio clock PN select (If RG_AUD_AD_CLK_F[1:0]=00 or 10 & RG_AUD_DA_CLK_F[1:0]=00, RG_AUD_CLK_PN_SEL)
                                            <0> CLK_AUD_DIG_LOOP       <1> CLK_AUD_DIG_6P5M
                                            <2> CLK_AUD_DAC                 <3> CLK_AUD_ADC
                                            <4> CLK_AUD_DCDCGEN       <5> CLK_AUD_VAD_CLK_SEL
                                            <6> CLK_AUD_DCDCCORE     <7> RG_AUD_VB_V<5> */

#define DCDCGEN_CLK_F		(14)
#define DCDCGEN_CLK_F_MASK	(MASK_2_BITS << DCDCGEN_CLK_F)

#define DCDCCORE_CLK_F		(12)
#define DCDCCORE_CLK_F_MASK	(MASK_2_BITS << DCDCCORE_CLK_F)

#define DCDCCHG_CLK_F		(10)
#define DCDCCHG_CLK_F_MASK	(MASK_2_BITS << DCDCCHG_CLK_F)

#define PA_CLK_F		    (8)
#define PA_CLK_F_MASK		(MASK_2_BITS << PA_CLK_F)

#define CLK_PN_SEL		    (0)
#define CLK_PN_SEL_MASK		(MASK_8_BITS << CLK_PN_SEL)

/**---------------------------------------------------------------------------*
 **                         register mapping definition                       *
 **---------------------------------------------------------------------------*/

#define SC2720_AP_REG_BASE  (0x00000700)

typedef struct
{
	uint32  ana_pmu0;           //0x00
	uint32  ana_pmu1;           //0x04
	uint32  ana_pmu2;           //0x08
	uint32  ana_pmu3;           //0x0c
	uint32  ana_pmu4;           //0x10
	uint32  ana_pmu5;           //0x14

	uint32  ana_clk0;           //0x18

	uint32  ana_cdc0;           //0x1c
	uint32  ana_cdc1;           //0x20
	uint32  ana_cdc2;           //0x24
	uint32  ana_cdc3;           //0x28
	uint32  ana_cdc4;           //0x2c

	uint32  ana_hdt0;           //0x30
	uint32  ana_hdt1;           //0x34
	uint32  ana_hdt2;           //0x38

	uint32  ana_dcl0;           //0x3c
	uint32  ana_dcl1;           //0x40
	uint32  ana_dcl2;           //0x44
	uint32  ana_dcl3;           //0x48
	uint32  ana_dcl4;           //0x4c
	uint32  ana_dcl5;           //0x50
	uint32  ana_dcl6;           //0x54
	uint32  ana_dcl7;           //0x58

	uint32  ana_sts0;           //0x5C
	uint32  ana_sts1;           //0x60
	uint32  ana_sts2;           //0x64
	uint32  ana_sts3;           //0x68
	uint32  ana_sts4;           //0x6C
	uint32  ana_sts5;           //0x70
	uint32  ana_sts6;           //0x74
	uint32  ana_sts7;           //0x78

	uint32  ana_clk1;           //0x7C
} SPRD_CODEC_AP_REG_CTL_T;

/**---------------------------------------------------------------------------*
 **                       A Die codec digital part                            *
 **                         Register description                              *
 **---------------------------------------------------------------------------*/

/// AUD_CFGA_CLR 0x00 ///
/// aud_cfgal clr
/* ear_shutdown_clr     [10]    WC	0	ear shut down clear
 * hp_shutdown_clr      [9]     WC	0	hp shut down clear
 * pa_shutdown_clr      [8]     WC	0	pa shut down clear
 * aud_int_clr	        [7:0]	WC	0	[7:0]={audio_rcv_depop,audio_pacal_irq,audio_hp_dpop_irq,
                                        ovp_irq,otp_irq,pa_ocp_irq,ear_ocp_irq,hp_ocp_irq}*/
#define EAR_SHUTDOWN_CLR                (BIT_10)
#define HP_SHUTDOWN_CLR                 (BIT_9)
#define PA_SHUTDOWN_CLR                 (BIT_8)
#define AUD_INT_CLR_MASK			    (MASK_8_BITS)
#define AUD_INT_CLR_ALL                 (AUD_INT_CLR_MASK)
#define AUD_INT_CLR_AUDIO_RCV_DPOP_IRQ  (BIT_7)
#define AUD_INT_CLR_AUDIO_PACAL_IRQ     (BIT_6)
#define AUD_INT_CLR_AUDIO_HP_DPOP_IRQ   (BIT_5)
#define AUD_INT_CLR_OVP_IRQ             (BIT_4)
#define AUD_INT_CLR_OTP_IRQ             (BIT_3)
#define AUD_INT_CLR_PA_OCP_IRQ          (BIT_2)
#define AUD_INT_CLR_EAR_OCP_IRQ         (BIT_1)
#define AUD_INT_CLR_HP_OCP_IRQ          (BIT_0)


/// AUD_CFGA_HID_CFG0 0x04 ///
/// audio head insert detect status
/* UD_DBNC_EN           [2: 1]  RW  0   [0]: audio HEAD_INSERT debounce enable
                                        [1]: audio HEAD_BUTTON_OUT debounce enable
 * HID_EN               [0]     RW  0 */
#define AUD_HEAD_BUTTON_OUT_DEBOUNCE_EN   (BIT_2)
#define AUD_HEAD_INSERT_DEBOUNCE_EN       (BIT_1)
#define HID_EN                            (BIT_0)

// TODO: low or high ??
/// AUD_CFGA_HID_CFG1 0x08 ///
/// audio head insert detect status
/* HID_HIGH_DBNC_THD0	[15: 8]	RW	0	low debounce threshold(clock 1k), for HEAD_INSERT signal
 * HID_LOW_DBNC_THD0	[7: 0]	RW	0	high debounce threshold(clock 1k), for HEAD_INSERT signal */
#define HID_HIGH_DBNC_THD0       (8)
#define HID_HIGH_DBNC_THD0_MASK  (MASK_8_BITS << HID_HIGH_DBNC_THD0)
#define HID_LOW_DBNC_THD0        (0)
#define HID_LOW_DBNC_THD0_MASK   (MASK_8_BITS << HID_LOW_DBNC_THD0)

/// AUD_CFGA_HID_CFG2 0x0c ///
/// audio head insert detect status
/* HID_TMR_T1T2_STEP	[9: 5]	RW	0	head insert detect T1/T2 timer step (clock 1k)
 * HID_TMR_T0	        [4: 0]	RW	0	head insert detect T0 timer , (clock 1k) */
#define HID_TMR_T1T2_STEP       (5)
#define HID_TMR_T1T2_STEP_MASK  (MASK_5_BITS << HID_TMR_T1T2_STEP)
#define HID_TMR_T0              (0)
#define HID_TMR_T0_MASK         (MASK_5_BITS << HID_TMR_T0)

/// AUD_CFGA_HID_CFG3 0x10 ///
/// audio head insert detect status
/* HID_TMR_T1           [15: 0]	RW	0	head insert detect T1 timer ,step: HID_TMR_T1T2_STEP */
#define HID_TMR_T1          (0)
#define HID_TMR_T1_MASK     (MASK_16_BITS << HID_TMR_T1)

/// AUD_CFGA_HID_CFG4 0x14 ///
/// audio head insert detect status
/* HID_TMR_T2           [15: 0]	RW	0	head insert detect T2 timer ,step: HID_TMR_T1T2_STEP */
#define HID_TMR_T2          (0)
#define HID_TMR_T2_MASK     (MASK_16_BITS << HID_TMR_T2)

/// AUD_CFGA_HID_CFG5 0x18 ///
/// audio head insert detect status
/* HID_HIGH_DBNC_THD1	[15: 8]	RW	0	low debounce threshold(clock 1k), for HEAD_BUTTON_OUT signal
 * HID_LOW_DBNC_THD1	[7: 0]	RW	0	high debounce threshold(clock 1k), for HEAD_BUTTON_OUT signal */
#define HID_HIGH_DBNC_THD1              (8)
#define HID_HIGH_DBNC_THD1_MASK         (MASK_8_BITS << HID_HIGH_DBNC_THD1)
#define HID_LOW_DBNC_THD1               (0)
#define HID_LOW_DBNC_THD1_MASK          (MASK_8_BITS << HID_LOW_DBNC_THD1)

/// AUD_CFGA_HID_STS0 0x1c ///
/// audio head insert detect status
/* EAR_SHUTDOWN	            [10]	RO	0	ear_shutdown
 * HP_SHUTDOWN	            [9]	    RO	0	hp_shutdown
 * PA_SHUTDOWN	            [8]	    RO	0	pa_shutdown
 * AUDIO_HEAD_INSERT_OUT	[7]	    RO	0	head insert detect out: AUDIO_HEAD_INSERT_OUT state
 * AUDIO_HEAD_BUTTON_OUT	[6]	    RO	0	head button detect out: AUDIO_HEAD_BUTTON_OUT state
 * AUD_DBNC_STS1	        [5: 3]	RO	0	u1 debounce state machine  status
 * AUD_DBNC_STS0	        [2: 0]	RO	0	u0 debounce state machine  status */
#define EAR_SHUTDOWN            (BIT_10)
#define HP_SHUTDOWN             (BIT_9)
#define PA_SHUTDOWN             (BIT_8)
#define AUDIO_HEAD_INSERT_OUT   (BIT_7)
#define AUDIO_HEAD_BUTTON_OUT   (BIT_6)
#define AUD_DBNC_STS1           (3)
#define AUD_DBNC_STS1_MASK      (MASK_3_BITS << AUD_DBNC_STS1)
#define AUD_DBNC_STS0           (0)
#define AUD_DBNC_STS0_MASK      (MASK_3_BITS << AUD_DBNC_STS0)

/// AUD_CFGA_PRT_CFG_0 0x20 ///
/// aud protect module configuration
/* EAR_SHUTDOWN_EN      [9]     RW	0	ear_shutdown_enable
 * HP_SHUTDOWN_EN       [8]     RW	0	hp_shutdown_enable
 * PA_SHUTDOWN_EN2      [7]     RW	0	pa_shutdown_enable2
 * PA_SHUTDOWN_EN1      [6]     RW	0	pa_shutdown_enable1
 * PA_SHUTDOWN_EN0	    [5]     RW	0	pa_shutdown_enable0
 * AUD_CLK_SEL	        [4]     RW	0x1	1:32k_clk 0:1k_clk
 * AUD_PRT_EN	        [3]     RW	0	protect enable
 * OTP_PD_THD	        [2:0]	RW	0x3	over-temperature protection threshold */
#define EAR_SHUTDOWN_EN	    (BIT_9)
#define HP_SHUTDOWN_EN	    (BIT_8)
#define PA_SHUTDOWN_EN2	    (BIT_7)
#define PA_SHUTDOWN_EN1	    (BIT_6)
#define PA_SHUTDOWN_EN0	    (BIT_5)
#define AUD_CLK_SEL	        (BIT_4)
#define AUD_PRT_EN	        (BIT_3)
#define OTP_PD_THD	        (0)
#define OTP_PD_THD_MASK	    (MASK_3_BITS << OTP_PD_THD)

/// AUD_CFGA_PRT_CFG_1 0x24 ///
/// aud protect module configuration
/* OTP_PRECIS	[14: 12]	RW	0x2	over-temperature protection precis
 * OVP_PD_THD	[11: 9]     RW	0x2	overvoltage protection threshold
 * OVP_PRECIS	[8: 6]      RW	0	overvoltage protection precis
 * OCP_PD_THD	[5: 3]      RW	0x3	overcurrent protection threshold
 * OCP_PRECIS	[2: 0]      RW	0x2	overcurrent protection precis */
#define OTP_PRECIS          (12)
#define OTP_PRECIS_MASK     (MASK_3_BITS << OTP_PRECIS)
#define OVP_PD_THD          (9)
#define OVP_PD_THD_MASK     (MASK_3_BITS << OVP_PD_THD)
#define OVP_PRECIS          (6)
#define OVP_PRECIS_MASK     (MASK_3_BITS << OVP_PRECIS)
#define OCP_PD_THD          (3)
#define OCP_PD_THD_MASK     (MASK_3_BITS << OCP_PD_THD)
#define OCP_PRECIS          (0)
#define OCP_PRECIS_MASK     (MASK_3_BITS << OCP_PRECIS)

/// AUD_CFGA_RD_STS 0x28 ///
/// aud read states0&1
/* aud_irq_raw	[15: 8]	RO	0	int status: [7:0]={audio_rcv_depop,audio_pacal_irq,
                                audio_hp_dpop_irq,ovp_irq,otp_irq,pa_ocp_irq,ear_ocp_irq,hp_ocp_irq}
 * aud_irq_msk	[7: 0]	RO	0	int mask = aud_irq_raw & aud_int_en */
#define AUDIO_IRQ_RAW                  (8)
#define AUDIO_IRQ_RAW_MASK             (MASK_8_BITS << AUDIO_IRQ_RAW)
#define AUDIO_RCV_DEPOP_IRQ_RAW_STATUS (BIT_15)
#define AUDIO_PACAL_IRQ_RAW_STATUS     (BIT_14) // TODO: Maybe BIT_7
#define AUDIO_HP_DPOP_IRQ_RAW_STATUS   (BIT_13)
#define OVP_IRQ_RAW_STATUS             (BIT_12)
#define OTP_IRQ_RAW_STATUS             (BIT_11)
#define PA_OCP_IRQ_RAW_STATUS          (BIT_10)
#define EAR_OCP_IRQ_RAW_STATUS         (BIT_9)
#define HP_OCP_IRQ_RAW_STATUS          (BIT_8)

#define AUDIO_IRQ                        (0)
#define AUDIO_IRQ_MASK                   (MASK_8_BITS << AUDIO_IRQ)
#define AUDIO_RCV_DEPOP_IRQ_MASK_STATUS  (BIT_7)
#define AUDIO_PACAL_IRQ_MASK_STATUS      (BIT_6) // TODO: Maybe BIT_0
#define AUDIO_HP_DPOP_IRQ_MASK_STATUS    (BIT_5)
#define OVP_IRQ_MASK_STATUS              (BIT_4)
#define OTP_IRQ_MASK_STATUS              (BIT_3)
#define PA_OCP_IRQ_MASK_STATUS           (BIT_2)
#define EAR_OCP_IRQ_MASK_STATUS          (BIT_1)
#define HP_OCP_IRQ_MASK_STATUS           (BIT_0)

/// AUD_CFGA_INT_MODULE_CTRL 0x2c ///
/// aud interrupt module control
/* AUD_INT_EN	[7: 0]	RW	0	int enable: {audio_rcv_depop,audio_pacal_irq,audio_hp_dpop_irq,ovp_irq,otp_irq,pa_ocp_irq,ear_ocp_irq,hp_ocp_irq} */
#define AUDIO_IRQ_EN_MASK       (MASK_7_BITS)
#define AUDIO_RCV_DEPOP_IRQ_EN  (BIT_7)
#define AUDIO_PACAL_IRQ_EN      (BIT_6) // TODO: Maybe BIT_0
#define AUDIO_HP_DPOP_IRQ_EN    (BIT_5)
#define OVP_IRQ_EN              (BIT_4)
#define OTP_IRQ_EN              (BIT_3)
#define PA_OCP_IRQ_EN           (BIT_2)
#define EAR_OCP_IRQ_EN          (BIT_1)
#define HP_OCP_IRQ_EN           (BIT_0)

/// AUD_CFGA_LP_MODULE_CTRL 0x30 ///
/// aud loop module control
/* ADC_EN_R             [5]	RW	0	adc right enable
 * DAC_EN_R             [4]	RW	0	dac right enable
 * ADC_EN_L             [3]	RW	0	adc left enable
 * DAC_EN_L             [2]	RW	0	adc right enable
 * AUDIO_LOOP_MAP_SEL	[1]	RW	0x1
 * AUDIO_ADIE_LOOP_EN	[0]	RW	0 */
#define ADC_EN_R            (BIT_5)
#define DAC_EN_R            (BIT_4)
#define ADC_EN_L            (BIT_3)
#define DAC_EN_L            (BIT_2)
#define AUDIO_LOOP_MAP_SEL  (BIT_1)
#define AUDIO_ADIE_LOOP_EN  (BIT_0)

/// ANA_ET2 0x34 ///
/// Audio DACL & DACR output mixer select
/* DEM_BYPASS           [4]     RW	0	bypass DEM
 * RG_AUD_DALR_MIX_SEL	[3:2]	RW	0	Audio DACL & DACR output mixer select
                                        00 = R/L         01 = R/0
                                        10 = 0/L         11 = 0/0
 * RG_AUD_DAS_MIX_SEL	[1:0]	RW	0	Audio DACL & DACR output mixer select
                                        00 = L + R       01 = 2 x L
                                        10 = 2 x R       11 = 0 */
#define DEM_BYPASS              (4)
#define AUD_DALR_MIX_SEL        (2)
#define AUD_DALR_MIX_SEL_MASK   (MASK_2_BITS << AUD_DALR_MIX_SEL)
#define AUD_DALR_MIX_RL_MODE    (0x00)
#define AUD_DALR_MIX_R0_MODE    (0x01)
#define AUD_DALR_MIX_0L_MODE    (0x10)
#define AUD_DALR_MIX_00_MODE	(0x11)
#define AUD_DAS_MIX_SEL			(0)
#define AUD_DAS_MIX_SEL_MASK	(MASK_2_BITS << AUD_DALR_MIX_SEL)
#define AUD_DAS_MIX_RL_MODE		(0x00)
#define AUD_DAS_MIX_2L_MODE		(0x01)
#define AUD_DAS_MIX_2R_MODE		(0x10)
#define AUD_DAS_MIX_00_MODE		(0x11)

/// CLK_EN 0x38 ///
/// clock enable
/* CLK_AUD_LOOP_INV_EN	[5]	RW	0   // invalid
 * CLK_AUD_6P5M_EN      [4]	RW	0   // invalid
 * CLK_AUD_LOOP_EN      [3]	RW	0
 * CLK_AUD_HID_EN       [2]	RW	0
 * CLK_AUD_1K_EN        [1]	RW	0
 * CLK_AUD_32K_EN       [0]	RW	0 */
#define CLK_AUD_MASK		(MASK_6_BITS)
#define CLK_AUD_LOOP_INV	(BIT_5) // invalid
#define CLK_AUD_6P5M		(BIT_4) // invalid
#define CLK_AUD_LOOP		(BIT_3)
#define CLK_AUD_HID			(BIT_2)
#define CLK_AUD_1K			(BIT_1)
#define CLK_AUD_32K			(BIT_0)

/// SOFT_RST 0x3c ///
/// audio soft reset
/* AUD_DAC_POST_SOFT_RST    [5]	WC	0
 * AUD_DIG_6P5M_SOFT_RST    [4]	WC	0
 * AUD_DIG_LOOP_SOFT_RST    [3]	WC	0
 * AUD_HID_SOFT_RST	        [2]	WC	0
 * AUD_1K_SOFT_RST	        [1]	WC	0
 * AUD_32K_SOFT_RST	        [0]	WC	0 */
#define AUD_DAC_POST_SOFT_RST	(BIT_5)
#define AUD_DIG_6P5M_SOFT_RST	(BIT_4)
#define AUD_DIG_LOOP_SOFT_RST	(BIT_3)
#define AUD_HID_SOFT_RST		(BIT_2)
#define AUD_1K_SOFT_RST			(BIT_1)
#define AUD_32K_SOFT_RST		(BIT_0)
/**---------------------------------------------------------------------------*                            *
 **---------------------------------------------------------------------------*/
#define SC2720_AUD_CFGA_REG_BASE (0x00000800)

typedef struct
{
	uint32 aud_cfgal_clr;			//0x00

	uint32 aud_cfga_hid_cfg0;		//0x04
	uint32 aud_cfga_hid_cfg1;		//0x08
	uint32 aud_cfga_hid_cfg2;		//0x0c
	uint32 aud_cfga_hid_cfg3;		//0x10
	uint32 aud_cfga_hid_cfg4;		//0x14
	uint32 aud_cfga_hid_cfg5;		//0x18

	uint32 aud_cfga_hid_sts0;		//0x1c

	uint32 aud_cfga_prt_cfg_0;		//0x20
	uint32 aud_cfga_prt_cfg_1;		//0x24

	uint32 aud_cfga_rd_sts;			//0x28

	uint32 aud_cfga_int_module_ctrl;//002c
	uint32 aud_cfga_lp_module_ctrl;	//0030

	uint32 ana_et2;					//0034
	uint32 clk_en;					//0038
	uint32 soft_rst;				//003c
} SPRD_AUD_CFGA_REG_CTL_T;

typedef enum
{
	SPRD_CODEC_MAIN_MIC_NONE_OCCUPIED = 0,
	SPRD_CODEC_MAIN_MIC_HP_OCCUPIED = BIT_0,
	SPRD_CODEC_MAIN_MIC_MIC_OCCUPIED = BIT_1,
	SPRD_CODEC_MAIN_MIC_AUXMIC_OCCUPIED = BIT_2
}MAIN_MIC_OCCUPIED_E;

#endif//__SPRD_CODEC_AP_PHY_SC1161_H___
