/*****************************************************************************
** File Name:      mmiqq_export.h                                                  *
** Author:                                                                   *
** Date:             11/05/2010                                                *
** Copyright:      2003 Spreadtrum, Incoporated. All Rights Reserved.         *
** Description:    This file is used to declare QQ function and define global               *
*****************************************************************************
**                         Important Edit History                            *
** --------------------------------------------------------------------------*
** DATE           NAME             DESCRIPTION                               *
** 05/2010       fen.xie       Create
******************************************************************************/
#ifndef MMIQQ_EXPORT_H_
#define MMIQQ_EXPORT_H_

/**--------------------------------------------------------------------------*
 **                         Include Files                                    *
 **--------------------------------------------------------------------------*/

/**--------------------------------------------------------------------------*
 **                         Compiler Flag                                    *
 **--------------------------------------------------------------------------*/
#ifdef __cplusplus
    extern   "C"
    {
#endif

/**--------------------------------------------------------------------------*
 **                         MACRO DEFINITION                                 *
 **--------------------------------------------------------------------------*/

/**--------------------------------------------------------------------------*
 **                         TYPE DEFINITION                                 *
 **--------------------------------------------------------------------------*/

/**--------------------------------------------------------------------------*
 **                         FUNCTION DEFINITION                              *
 **--------------------------------------------------------------------------*/
/*****************************************************************************/
//  Description :Get the state of QQ when leave it
//  Global resource dependence : s_qq_leave_state
//  Author: 
//  Note: 
/*****************************************************************************/
PUBLIC int MMIAPIQQ_GetLeaveQQState(void);//Get_leavev_qq_state_value(void)

/*****************************************************************************/
//  Description :MMIAPIQQ_GetIdleImageID
//  Global resource dependence : none
//  Author: 
//  Note: 
/*****************************************************************************/
PUBLIC  MMI_IMAGE_ID_T MMIAPIQQ_GetIdleImageID(void);

/*****************************************************************************/
//  Description: QQ入口函数,调用此函数进入QQ 主界面
//  Global resource dependence :  
//  Author: 
//  Note: 
/*****************************************************************************/
PUBLIC BOOLEAN MMIAPIQQ_OpenMainWin(void);

/*****************************************************************************/
//  Description :退出QQ
//  Global resource dependence : none
//  Author: fen.xie
//  Note: 
/*****************************************************************************/
PUBLIC void MMIAPIQQ_ExitQQ(void);

/*****************************************************************************/
//  Description: MMIAPIQQ_HandleTimer
//  Global resource dependence :  
//  Author: 
//  Note: 
/*****************************************************************************/
PUBLIC void MMIAPIQQ_HandleTimer(uint8 timer_id, uint32 param);


/*****************************************************************************/
//  Description :更新当前QQ使用的sim卡(sim1 or sim2)
//  Global resource dependence : none
//  Author: fen.xie
//  Note: 
/*****************************************************************************/
PUBLIC void MMIAPIQQ_UpdateSimSelect(MN_DUAL_SYS_E sim_select);

/**--------------------------------------------------------------------------*
 **                         Compiler Flag                                    *
 **--------------------------------------------------------------------------*/
#ifdef   __cplusplus
    }
#endif
#endif
